{"wife": 5861, "took": 5449, "birthday": 517, "breakfast": 631, "excellent": 1844, "weather": 5804, "perfect": 3855, "made": 3163, "sitting": 4790, "outside": 3698, "overlooking": 3709, "grounds": 2344, "absolute": 3, "pleasure": 3963, "waitress": 5744, "food": 2085, "arrived": 267, "quickly": 4171, "saturday": 4543, "morning": 3434, "looked": 3109, "like": 3042, "place": 3933, "fills": 2010, "pretty": 4056, "earlier": 1681, "get": 2220, "better": 494, "favor": 1958, "bloody": 552, "mary": 3236, "phenomenal": 3879, "simply": 4772, "best": 492, "ive": 2788, "ever": 1827, "im": 2643, "sure": 5212, "use": 5650, "ingredients": 2711, "garden": 2192, "blend": 542, "fresh": 2137, "order": 3674, "amazing": 156, "everything": 1833, "menu": 3312, "looks": 3111, "white": 5849, "truffle": 5533, "scrambled": 4586, "eggs": 1725, "vegetable": 5677, "skillet": 4802, "tasty": 5291, "delicious": 1430, "came": 760, "pieces": 3910, "bread": 625, "absolutely": 4, "meal": 3268, "complete": 1114, "toast": 5423, "anyway": 205, "cant": 777, "wait": 5739, "go": 2257, "back": 362, "idea": 2628, "people": 3847, "give": 2238, "bad": 368, "reviews": 4383, "goes": 2261, "show": 4741, "please": 3960, "everyone": 1831, "probably": 4079, "something": 4893, "many": 3208, "case": 814, "friend": 2145, "pm": 3970, "past": 3795, "sunday": 5189, "crowded": 1307, "thought": 5380, "evening": 1822, "would": 5929, "forever": 2095, "seat": 4607, "said": 4498, "well": 5826, "seated": 4608, "girl": 2234, "comes": 1072, "seating": 4609, "someone": 4890, "else": 1740, "waiter": 5741, "got": 2279, "drink": 1630, "orders": 3677, "pleasant": 3958, "host": 2577, "us": 5648, "server": 4656, "prices": 4063, "good": 2268, "placed": 3934, "decided": 1400, "wanted": 5765, "shared": 4693, "baked": 381, "spaghetti": 4942, "calzone": 759, "small": 4833, "heres": 2489, "beef": 458, "pizza": 3930, "try": 5540, "huge": 2601, "smallest": 4835, "one": 3645, "personal": 3866, "awesome": 354, "liked": 3043, "sauce": 4545, "thats": 5350, "box": 609, "part": 3781, "take": 5258, "home": 2541, "door": 1590, "great": 2315, "reviewers": 4381, "things": 5369, "serious": 4652, "issues": 2779, "love": 3127, "dog": 1577, "park": 3776, "convenient": 1189, "surrounded": 5222, "lot": 3119, "paths": 3808, "desert": 1460, "baseball": 416, "fields": 1992, "lake": 2930, "ducks": 1659, "scottsdale": 4585, "dept": 1454, "wonderful": 5897, "job": 2819, "keeping": 2861, "clean": 1000, "find": 2015, "trash": 5496, "cans": 776, "located": 3092, "area": 248, "let": 3017, "dogs": 1578, "run": 4478, "play": 3951, "general": 2206, "manager": 3197, "scott": 4584, "egg": 1722, "detail": 1481, "assure": 307, "albeit": 122, "rare": 4205, "speak": 4945, "treat": 5505, "guy": 2371, "respect": 4354, "state": 5036, "id": 2627, "surprised": 5219, "dont": 1587, "walk": 5750, "totally": 5464, "satisfied": 4539, "always": 153, "say": 4560, "mistakes": 3392, "important": 2656, "thanks": 5348, "staff": 5012, "youve": 5984, "customer": 1344, "life": 3033, "drop": 1645, "youre": 5983, "drive": 1635, "ate": 310, "next": 3534, "day": 1377, "cute": 1347, "little": 3072, "green": 2321, "building": 692, "may": 3261, "gone": 2266, "hadnt": 2382, "driving": 1641, "palm": 3755, "rd": 4222, "avoid": 349, "construction": 1167, "waiting": 5743, "turn": 5557, "onto": 3651, "th": 5342, "street": 5109, "grand": 2294, "opening": 3656, "sign": 4760, "caught": 832, "eye": 1897, "yelping": 5966, "soul": 4922, "joy": 2834, "new": 3529, "opened": 3655, "put": 4147, "easy": 1693, "decor": 1406, "smell": 4840, "cleanliness": 1005, "inside": 2725, "ordered": 3675, "dinner": 1518, "two": 5569, "loved": 3128, "seeing": 4623, "variety": 5671, "poblano": 3972, "peppers": 3852, "mole": 3415, "mahi": 3170, "wrapped": 5935, "banana": 391, "leaves": 2991, "difficult": 1504, "choose": 954, "far": 1938, "la": 2915, "condesa": 1135, "shrimp": 4748, "burro": 713, "baja": 379, "sur": 5211, "taco": 5250, "meals": 3269, "stole": 5083, "much": 3460, "flavor": 2049, "bites": 526, "hubbys": 2597, "mmmm": 3401, "delight": 1433, "salsa": 4509, "bar": 397, "endless": 1764, "really": 4236, "stocked": 5080, "excited": 1852, "strawberry": 5106, "hot": 2582, "fact": 1911, "big": 504, "horchata": 2565, "handmade": 2406, "throw": 5389, "pecans": 3837, "fruit": 2157, "yummy": 5990, "bonus": 574, "wasnt": 5783, "enough": 1778, "win": 5869, "art": 271, "restaurant": 4362, "sucker": 5165, "mexican": 3332, "theres": 5359, "painting": 3743, "diego": 1498, "hanging": 2410, "paintings": 3744, "artist": 277, "nobuo": 3550, "shows": 4746, "unique": 5613, "crafted": 1267, "features": 1968, "start": 5029, "pork": 4002, "belly": 474, "buns": 703, "stout": 5098, "longer": 3106, "man": 3193, "owns": 3722, "store": 5094, "sweet": 5231, "perhaps": 3861, "sweeter": 5232, "cookies": 1199, "ice": 2621, "cream": 1279, "giant": 2226, "cookie": 1198, "sandwiches": 4527, "super": 5196, "cheap": 897, "basically": 420, "snickerdoodle": 4861, "marvelous": 3235, "vietnamese": 5705, "sandwich": 4526, "oven": 3701, "butter": 723, "choices": 951, "modest": 3409, "selection": 4632, "goods": 2272, "along": 141, "rolls": 4433, "around": 259, "bring": 650, "cash": 817, "atm": 313, "card": 788, "credit": 1290, "cards": 790, "accepted": 11, "limited": 3050, "time": 5408, "thing": 5368, "going": 2262, "right": 4402, "bbq": 436, "chicken": 924, "long": 3105, "last": 2948, "tried": 5518, "tomato": 5439, "basil": 422, "soup": 4926, "every": 1828, "stars": 5028, "rate": 4208, "deli": 1427, "worth": 5927, "salad": 4501, "service": 4659, "maybe": 3262, "guys": 2372, "grandma": 2296, "died": 1497, "know": 2897, "want": 5764, "tell": 5315, "mad": 3162, "experience": 1875, "could": 1230, "cared": 792, "less": 3013, "sat": 4536, "looking": 3110, "hmm": 2526, "saying": 4562, "large": 2941, "wow": 5932, "nice": 3535, "told": 5436, "left": 2997, "hungry": 2610, "unsatisfied": 5626, "owner": 3719, "teach": 5299, "employees": 1752, "value": 5666, "telling": 5316, "specials": 4950, "affect": 82, "customers": 1345, "salads": 4502, "severely": 4675, "overpriced": 3713, "wont": 5901, "unless": 5618, "desperate": 1474, "okay": 3635, "grew": 2326, "shopping": 4727, "los": 3114, "shock": 4718, "saw": 4559, "world": 5919, "stuff": 5135, "cheese": 909, "wine": 5875, "happy": 2423, "arizona": 254, "shouldnt": 4737, "even": 1821, "reviewed": 4379, "kind": 2883, "keep": 2860, "first": 2029, "went": 5830, "garlic": 2194, "knots": 2896, "favorite": 1959, "course": 1244, "alot": 143, "check": 900, "car": 785, "wanna": 5763, "buy": 730, "wrong": 5943, "move": 3450, "biggest": 506, "mistake": 3391, "asked": 289, "girlfriend": 2235, "oil": 3631, "guess": 2359, "ripped": 4410, "lying": 3153, "without": 5889, "fixing": 2040, "problem": 4080, "might": 3347, "accident": 15, "brand": 621, "tires": 5420, "timing": 5411, "belt": 476, "worst": 5926, "changed": 875, "months": 3430, "somewhere": 4898, "coming": 1077, "ages": 94, "favorites": 1960, "burgers": 705, "dragon": 1613, "wings": 5878, "pepper": 3850, "atmosphere": 314, "fun": 2173, "display": 1554, "cool": 1202, "boss": 591, "healthy": 2457, "eating": 1700, "recommended": 4258, "highly": 2506, "skeptical": 4799, "friends": 2149, "dumplings": 1669, "onion": 3647, "tart": 5281, "starters": 5032, "noodles": 3562, "tacos": 5251, "entrees": 1793, "also": 147, "dishes": 1551, "times": 5410, "since": 4773, "never": 3528, "disappointed": 1535, "yoga": 5974, "kale": 2854, "chopped": 957, "aid": 104, "table": 5247, "whole": 5853, "plant": 3944, "patio": 3813, "embarrassed": 1747, "date": 1369, "careful": 793, "arms": 256, "quite": 4177, "sometimes": 4896, "think": 5370, "live": 3073, "true": 5532, "charming": 891, "homes": 2545, "restaurants": 4364, "certain": 856, "colored": 1060, "opinion": 3662, "cibo": 977, "lunch": 3147, "minutes": 3379, "close": 1017, "served": 4655, "side": 4756, "perfectly": 3857, "crisp": 1298, "chewy": 920, "sausage": 4550, "flavorful": 2051, "complimented": 1121, "roasted": 4420, "red": 4261, "onions": 3648, "finished": 2023, "quality": 4156, "mozzarella": 3456, "friendly": 2148, "comfortable": 1074, "though": 5379, "bit": 523, "hang": 2409, "lived": 3074, "nearby": 3503, "disgusting": 1549, "groupon": 2346, "daughter": 1372, "outdated": 3692, "style": 5143, "interior": 2749, "feel": 1974, "episode": 1799, "simple": 4771, "trying": 5541, "positive": 4007, "owners": 3720, "creating": 1285, "dealt": 1390, "discount": 1540, "tire": 5418, "phoenix": 3885, "texas": 5337, "knowing": 2898, "expect": 1868, "pleasantly": 3959, "amount": 171, "parking": 3778, "front": 2153, "open": 3654, "adequate": 57, "already": 144, "cars": 809, "see": 4621, "working": 5916, "busy": 720, "helping": 2484, "yet": 5971, "hello": 2480, "theyd": 5360, "soon": 4908, "didnt": 1495, "helped": 2482, "plan": 3938, "action": 36, "gave": 2200, "options": 3670, "headed": 2451, "decision": 1402, "replace": 4326, "checked": 901, "stock": 5079, "unfortunately": 5605, "called": 753, "another": 189, "picked": 3895, "come": 1070, "boys": 616, "installed": 2730, "relief": 4297, "although": 151, "serviced": 4660, "exactly": 1840, "min": 3363, "apologized": 214, "need": 3510, "nd": 3501, "sorry": 4917, "forgot": 2100, "name": 3487, "professional": 4089, "recommend": 4255, "bringing": 651, "future": 2181, "definitely": 1419, "tip": 5414, "make": 3181, "appointment": 234, "online": 3649, "believe": 472, "helps": 2485, "manage": 3194, "easier": 1689, "benefits": 483, "eaten": 1695, "none": 3558, "night": 3542, "attentive": 329, "horrible": 2567, "expectation": 1869, "serve": 4654, "steak": 5050, "par": 3772, "seafood": 4597, "charging": 887, "bucks": 682, "ribeye": 4389, "hoping": 2562, "thick": 5364, "cooked": 1197, "piece": 3909, "meat": 3278, "mostly": 3438, "fat": 1947, "way": 5799, "similar": 4770, "chick": 923, "filet": 2003, "veggies": 5682, "blah": 534, "basket": 424, "ample": 173, "old": 3638, "certainly": 857, "addition": 52, "crammed": 1268, "room": 4438, "nuts": 3596, "tables": 5248, "listening": 3066, "conversations": 1192, "ranging": 4203, "someones": 4891, "recent": 4248, "couple": 1239, "entirely": 1789, "french": 2131, "showed": 4742, "turned": 5558, "switch": 5241, "suddenly": 5169, "began": 464, "speaking": 4947, "english": 1770, "pay": 3823, "itll": 2787, "steaks": 5053, "perfection": 3856, "half": 2389, "doesnt": 1576, "wind": 5870, "plate": 3948, "lux": 3151, "house": 2589, "nearly": 3505, "coffee": 1048, "pastries": 3802, "music": 3474, "beat": 444, "dead": 1385, "horse": 2570, "ill": 2641, "add": 44, "offer": 3621, "wide": 5860, "quesadillas": 4162, "catch": 826, "deep": 1411, "fried": 2144, "alright": 145, "away": 353, "yelp": 5962, "fitting": 2036, "review": 4378, "waffles": 5738, "yes": 5969, "ghetto": 2224, "tea": 5298, "quick": 4170, "ridiculously": 4400, "year": 5956, "damn": 1359, "seasoning": 4606, "deliciously": 1431, "soft": 4875, "crispy": 1300, "cramped": 1269, "matter": 3255, "delivered": 1438, "quiet": 4173, "tunnel": 5555, "vision": 5718, "bite": 525, "taken": 5259, "goodness": 2271, "requirement": 4341, "real": 4232, "early": 1682, "prepared": 4042, "forget": 2096, "velvet": 5685, "cake": 746, "koolaid": 2908, "fits": 2035, "fancy": 1935, "couldnt": 1231, "stop": 5090, "talking": 5267, "lolos": 3102, "weeks": 5819, "shoot": 4723, "later": 2953, "still": 5073, "drooling": 1644, "thinking": 5371, "happened": 2417, "app": 216, "entree": 1792, "panini": 3764, "walked": 5751, "sit": 4786, "stood": 5088, "finally": 2014, "nothing": 3581, "figured": 2000, "wed": 5806, "luckily": 3140, "noticed": 3583, "end": 1760, "moved": 3451, "apart": 209, "party": 3788, "cider": 978, "pear": 3834, "poured": 4022, "glass": 2244, "attention": 328, "flirting": 2060, "ask": 288, "correct": 1217, "drinks": 1633, "across": 31, "gods": 2260, "sake": 4500, "split": 4974, "eat": 1694, "stupid": 5142, "lose": 3115, "money": 3422, "whatever": 5837, "brought": 663, "hard": 2425, "remember": 4305, "care": 791, "stopped": 5091, "shes": 4709, "behind": 469, "cell": 848, "phone": 3886, "shed": 4701, "conversation": 1191, "done": 1585, "incredible": 2682, "pasta": 3796, "tiramisu": 5417, "calamari": 748, "tomatoes": 5440, "freshest": 2138, "tasted": 5285, "moms": 3419, "italian": 2780, "feeling": 1975, "visitors": 5722, "impress": 2660, "helpful": 2483, "cares": 794, "providing": 4113, "dining": 1517, "hes": 2491, "spot": 4986, "recommendations": 4257, "tasting": 5290, "events": 1825, "joining": 2829, "list": 3062, "facebook": 1904, "page": 3736, "fan": 1934, "deals": 1389, "however": 2593, "return": 4373, "instead": 2734, "line": 3053, "employee": 1751, "three": 5384, "help": 2481, "words": 5910, "except": 1845, "hold": 2530, "pissed": 3923, "lady": 2928, "needed": 3511, "work": 5912, "meeting": 3292, "laugh": 2959, "waited": 5740, "beer": 459, "refilled": 4270, "empty": 1753, "asking": 290, "refill": 4269, "recognize": 4253, "friday": 2141, "bartender": 413, "management": 3196, "pull": 4123, "head": 2450, "ass": 295, "sad": 4489, "watch": 5787, "talk": 5265, "trout": 5529, "shocked": 4719, "lots": 3120, "bones": 573, "isnt": 2777, "fish": 2030, "comped": 1100, "church": 972, "christ": 966, "relationship": 4290, "jesus": 2813, "allow": 134, "reach": 4223, "several": 4674, "tempe": 5319, "casa": 813, "grande": 2295, "childrens": 929, "appeal": 218, "biscuits": 519, "gravy": 2311, "complaint": 1111, "mornings": 3435, "packed": 3732, "luck": 3139, "finding": 2016, "balance": 385, "wedding": 5807, "thomas": 5376, "step": 5060, "designing": 1469, "knew": 2892, "design": 1465, "creativity": 1289, "anyone": 202, "needing": 3512, "print": 4072, "crew": 1296, "stellar": 5059, "yikes": 5972, "reading": 4229, "realize": 4234, "laid": 2929, "require": 4339, "benefit": 482, "extra": 1892, "person": 3864, "adorable": 64, "appetizer": 225, "charged": 885, "ahi": 102, "tuna": 5554, "overcooked": 3704, "color": 1059, "consistency": 1161, "mentioned": 3310, "clear": 1006, "point": 3976, "kitchen": 2889, "cooking": 1200, "stressed": 5113, "unusual": 5629, "either": 1729, "known": 2902, "boutique": 605, "incredibly": 2683, "gift": 2228, "items": 2785, "years": 5958, "whenever": 5843, "range": 4201, "specialty": 4951, "hand": 2399, "whether": 5845, "bride": 645, "baby": 361, "heavenly": 2469, "candles": 771, "willing": 5866, "within": 5888, "price": 4061, "based": 417, "occasion": 3606, "wrap": 5934, "jobs": 2820, "making": 3186, "giving": 2241, "final": 2013, "annual": 188, "clearance": 1007, "sale": 4504, "days": 1380, "blow": 554, "finds": 2017, "ensure": 1779, "heads": 2453, "miss": 3387, "group": 2345, "concert": 1131, "weekday": 5814, "hour": 2587, "pricing": 4066, "fair": 1920, "tap": 5277, "sell": 4636, "clothing": 1027, "wandering": 5762, "worried": 5922, "reply": 4331, "center": 851, "east": 1691, "four": 2116, "peaks": 3831, "brewery": 642, "reasonable": 4238, "distance": 1558, "light": 3037, "rail": 4188, "classy": 999, "studio": 5132, "connection": 1153, "mr": 3457, "classes": 996, "asu": 309, "gym": 2373, "stretch": 5114, "class": 995, "spring": 4992, "body": 566, "jeans": 2804, "fill": 2006, "american": 165, "nicely": 3536, "raved": 4216, "teacher": 5300, "started": 5030, "practice": 4027, "recently": 4249, "filled": 2007, "material": 3253, "space": 4939, "remodeled": 4312, "bathroom": 431, "dressing": 1626, "rooms": 4440, "change": 874, "cheesy": 915, "southwest": 4934, "creepy": 1292, "gem": 2205, "truly": 5535, "floors": 2062, "high": 2500, "beautiful": 448, "tasteful": 5286, "decorations": 1409, "mirrors": 3382, "staring": 5027, "whoever": 5852, "tree": 5510, "entire": 1788, "stress": 5112, "concentrate": 1126, "feels": 1976, "opposed": 3665, "read": 4227, "confident": 1145, "voice": 5727, "ears": 1686, "shoulders": 4736, "inspired": 2729, "intense": 2743, "hurt": 2613, "getting": 2222, "focus": 2073, "bike": 507, "riding": 4401, "focused": 2074, "lower": 3135, "knees": 2891, "felt": 1981, "kicked": 2871, "afterwards": 89, "tons": 5448, "personable": 3865, "package": 3728, "membership": 3303, "summer": 5184, "ending": 1763, "received": 4245, "greeted": 2324, "rather": 4211, "rudely": 4471, "pretentious": 4055, "bitch": 524, "warm": 5770, "welcome": 5823, "reservation": 4346, "seem": 4625, "hostess": 2578, "explained": 1881, "fit": 2033, "informed": 2708, "arriving": 269, "werent": 5831, "lovely": 3129, "yelpers": 5965, "reservations": 4347, "automatically": 340, "shit": 4716, "according": 23, "ahead": 101, "anyways": 206, "minute": 3378, "squeeze": 5001, "top": 5452, "cork": 1210, "low": 3134, "fucking": 2167, "dollars": 1580, "office": 3626, "spectacular": 4954, "apples": 230, "bleu": 545, "means": 3272, "sort": 4918, "expert": 1879, "cold": 1052, "soggy": 4877, "yuck": 5987, "filling": 2009, "extreme": 1895, "annoyance": 185, "cutting": 1351, "solved": 4885, "placing": 3936, "leg": 3000, "admit": 61, "mashed": 3241, "potatoes": 4016, "tenderloin": 5325, "strange": 5101, "pairing": 3747, "particularly": 3784, "broke": 657, "menus": 3313, "bulk": 696, "disappointing": 1536, "honestly": 2549, "comfy": 1076, "welcoming": 5825, "wee": 5812, "tiny": 5413, "shack": 4680, "biltmore": 513, "write": 5940, "special": 4949, "occasions": 3609, "bone": 571, "fillet": 2008, "understand": 5597, "cuts": 1349, "almost": 139, "fantastic": 1937, "adding": 51, "anything": 203, "destroy": 1480, "taste": 5283, "mean": 3270, "needs": 3514, "explaining": 1882, "significant": 4764, "must": 3477, "tower": 5477, "different": 1502, "ways": 5800, "match": 3251, "appetite": 224, "likes": 3045, "presented": 4049, "guests": 2363, "blown": 555, "daily": 1356, "sides": 4757, "suggest": 5172, "lobster": 3087, "mash": 3240, "neither": 3521, "leave": 2990, "often": 3629, "wanting": 5766, "notch": 3577, "topping": 5455, "servers": 4657, "town": 5478, "makes": 3184, "entertaining": 1784, "describe": 1456, "gourmet": 2283, "adult": 67, "pockets": 3975, "literally": 3071, "melt": 3298, "mouth": 3447, "cajun": 745, "dill": 1508, "salmon": 4506, "everyday": 1830, "event": 1824, "expectations": 1870, "underwhelmed": 5601, "shade": 4681, "ran": 4195, "water": 5790, "vendors": 5687, "charge": 884, "kept": 2865, "chefs": 917, "consumer": 1169, "devoured": 1488, "wish": 5886, "beach": 438, "paradise": 3773, "flight": 2057, "places": 3935, "story": 5097, "short": 4729, "luggage": 3142, "arrive": 266, "destination": 1479, "various": 5672, "articles": 275, "missing": 3389, "mention": 3309, "security": 4619, "sealed": 4598, "containers": 1176, "sons": 4906, "milk": 3355, "bright": 648, "least": 2988, "premium": 4038, "inhouse": 2712, "middle": 3344, "baristas": 406, "warmed": 5771, "upon": 5637, "request": 4336, "fruity": 2159, "noted": 3579, "espresso": 1807, "hope": 2558, "subs": 5152, "priced": 4062, "chic": 921, "nails": 3484, "used": 5651, "toes": 5429, "ray": 4220, "road": 4416, "discovered": 1544, "manicures": 3204, "pedicures": 3840, "extremely": 1896, "nail": 3483, "salon": 4507, "ps": 4116, "grill": 2328, "training": 5492, "game": 2188, "charlies": 889, "dad": 1355, "eyes": 1899, "signed": 4763, "wall": 5754, "everywhere": 1835, "look": 3108, "floor": 2061, "ceiling": 842, "covered": 1254, "sports": 4984, "besides": 491, "assortment": 303, "especially": 1806, "cactus": 739, "league": 2981, "pairs": 3749, "city": 988, "team": 5302, "chicago": 922, "san": 4521, "stone": 5086, "ipa": 2766, "etc": 1815, "mentioning": 3311, "complimentary": 1120, "liver": 3076, "platter": 3950, "rye": 4487, "bagel": 371, "chips": 946, "ribs": 4390, "coconut": 1044, "combo": 1069, "thrilled": 5387, "dish": 1550, "au": 333, "gratin": 2308, "bowl": 606, "cole": 1053, "slaw": 4816, "entre": 1791, "smaller": 4834, "full": 2171, "dessert": 1477, "found": 2113, "possible": 4008, "lobby": 3085, "book": 576, "donation": 1583, "needless": 3513, "impressive": 2664, "cakes": 747, "flavors": 2053, "create": 1283, "family": 1932, "impressed": 2661, "compete": 1103, "ultimate": 5580, "call": 752, "company": 1093, "says": 4563, "yeah": 5955, "shirts": 4715, "guard": 2358, "skirt": 4811, "sadly": 4490, "handed": 2400, "bill": 510, "counter": 1235, "kidding": 2874, "originally": 3685, "heading": 2452, "fine": 2018, "pickup": 3901, "advertised": 75, "fake": 1924, "learned": 2985, "onsite": 3650, "buck": 679, "uh": 5579, "oh": 3630, "jersey": 2812, "refused": 4279, "twice": 5566, "screamed": 4589, "wrote": 5944, "license": 3029, "police": 3984, "visiting": 5721, "lit": 3069, "medical": 3286, "husband": 2615, "fuego": 2170, "bistro": 522, "ambiance": 159, "lights": 3041, "courtyard": 1250, "fusion": 2179, "highlight": 2504, "trip": 5523, "excuse": 1855, "bianco": 502, "larger": 2943, "deserts": 1461, "die": 1496, "ten": 5322, "main": 3173, "rice": 4391, "orange": 3671, "double": 1594, "ginger": 2233, "katsu": 2859, "normally": 3569, "grilled": 2329, "sushi": 5226, "knock": 2894, "shitty": 4717, "costumes": 1224, "together": 5432, "george": 2218, "hill": 2510, "yep": 5968, "men": 3307, "madonna": 3164, "sue": 5170, "kid": 2873, "mom": 3416, "pulling": 4125, "yellow": 5960, "laughs": 2962, "grab": 2285, "em": 1743, "fifteen": 1993, "shut": 4752, "rolled": 4431, "pleased": 3961, "parties": 3785, "wonder": 5895, "ups": 5639, "guessing": 2361, "ton": 5443, "magic": 3167, "south": 4932, "mcdowell": 3266, "halloween": 2393, "regular": 4285, "wallet": 5755, "cost": 1221, "runs": 4482, "desserts": 1478, "aged": 91, "balsamic": 390, "vinegar": 5713, "suggested": 5173, "near": 3502, "explain": 1880, "duck": 1658, "fishy": 2032, "dollar": 1579, "bottle": 596, "gotten": 2282, "rich": 4392, "chocolate": 949, "overall": 3702, "overcharged": 3703, "girls": 2237, "plain": 3937, "warning": 5776, "complaints": 1112, "apology": 215, "comp": 1089, "hyatt": 2618, "rude": 4470, "thumbs": 5394, "elsewhere": 1742, "kids": 2875, "member": 3301, "ok": 3634, "outrageous": 3696, "sounds": 4925, "soso": 4921, "cocktails": 1042, "shop": 4725, "cocktail": 1041, "glasses": 2245, "seen": 4629, "families": 1931, "bet": 493, "ones": 3646, "fiance": 1989, "valentines": 5662, "research": 4344, "romantic": 4436, "valley": 5664, "immediately": 2650, "walking": 5752, "youll": 5980, "notice": 3582, "dark": 1367, "candle": 770, "tight": 5402, "guacamole": 2355, "tender": 5324, "shoulder": 4735, "fell": 1979, "fork": 2102, "tortillas": 5461, "exceptional": 1847, "included": 2674, "pineapple": 3917, "glaze": 2246, "equally": 1801, "level": 3023, "reached": 4224, "bottom": 599, "plenty": 3965, "recommending": 4259, "others": 3687, "visit": 5719, "portions": 4005, "environment": 1795, "spacious": 4941, "calm": 756, "location": 3093, "disappoint": 1534, "knowledgeable": 2901, "cucumber": 1321, "jalapeo": 2795, "crave": 1275, "worthy": 5928, "expected": 1871, "usual": 5656, "growing": 2349, "pains": 3740, "neighborhood": 3518, "sol": 4878, "darn": 1368, "burger": 704, "smoked": 4849, "corn": 1211, "meh": 3294, "oily": 3632, "texture": 5340, "crunchy": 1313, "bug": 689, "running": 4480, "entrance": 1790, "towards": 5474, "rotisserie": 4450, "bugs": 690, "lol": 3099, "lunches": 3148, "safeway": 4494, "foods": 2088, "ordinary": 3678, "ham": 2395, "mushrooms": 3472, "parmesan": 3780, "macaroni": 3155, "picnic": 3903, "chef": 916, "personality": 3867, "whatsoever": 5839, "suggestion": 5175, "reaction": 4226, "ajs": 116, "fabulous": 1902, "individual": 2690, "servings": 4663, "catering": 830, "compliments": 1122, "pass": 3789, "inn": 2718, "described": 1457, "purchase": 4132, "sleep": 4818, "awhile": 357, "booked": 577, "stay": 5044, "entered": 1781, "smoking": 4851, "hotel": 2584, "local": 3088, "deal": 1386, "desk": 1473, "surely": 5213, "nope": 3565, "towels": 5476, "cow": 1255, "tongue": 5445, "missed": 3388, "late": 2951, "star": 5024, "minimum": 3371, "rating": 4212, "pool": 3992, "degree": 1421, "stores": 5095, "horrendous": 2566, "post": 4010, "mail": 3172, "repeatedly": 4325, "face": 1903, "lie": 3031, "fault": 1953, "sent": 4647, "dissapointed": 1557, "type": 5570, "comment": 1078, "substantial": 5156, "feedback": 1973, "supposed": 5209, "detailed": 1482, "due": 1662, "polite": 3988, "delayed": 1425, "appreciated": 237, "steam": 5056, "cleaning": 1004, "exterior": 1891, "wax": 5797, "negatives": 3516, "cleaned": 1001, "pointed": 3977, "scratch": 4588, "leather": 2989, "hole": 2534, "carpet": 802, "knows": 2903, "oriented": 3683, "present": 4047, "prior": 4074, "boyfriend": 614, "touch": 5466, "trunk": 5536, "bother": 594, "vacuum": 5661, "advertise": 74, "website": 5805, "poor": 3995, "expecting": 1872, "picky": 3902, "ny": 3597, "sticks": 5071, "monster": 3426, "pie": 3908, "pepperoni": 3851, "bell": 473, "threw": 5385, "taking": 5262, "advantage": 71, "football": 2091, "games": 2189, "glad": 2242, "hit": 2523, "average": 347, "strong": 5122, "inexpensive": 2701, "given": 2239, "critical": 1302, "nature": 3499, "save": 4553, "cenpho": 849, "lets": 3018, "personally": 3868, "responsible": 4359, "citizens": 986, "happen": 2416, "today": 5425, "black": 531, "topped": 5454, "pickled": 3898, "carne": 799, "asada": 283, "mesquite": 3320, "charcoal": 883, "weekly": 5817, "brunch": 670, "relax": 4292, "ago": 96, "odd": 3615, "manicure": 3203, "spaces": 4940, "hate": 2437, "decline": 1404, "sucks": 5167, "hands": 2407, "anywhere": 207, "weekend": 5815, "loves": 3132, "july": 2840, "enjoy": 1771, "questions": 4168, "wandered": 5761, "buttery": 728, "cues": 1323, "drank": 1614, "test": 5336, "set": 4667, "limit": 3049, "shown": 4745, "kick": 2869, "mark": 3223, "spend": 4957, "tastes": 5288, "grape": 2303, "total": 5463, "paying": 3824, "sportsmans": 4985, "afternoon": 86, "drinking": 1632, "mesa": 3319, "hunt": 2611, "tops": 5457, "atlantic": 311, "seared": 4602, "lightly": 3040, "breaded": 626, "sliced": 4820, "romaine": 4435, "lettuce": 3022, "tartar": 5282, "brioche": 653, "roll": 4430, "fluffy": 2067, "breading": 628, "vegetables": 5678, "overpower": 3712, "background": 364, "shortly": 4731, "miles": 3354, "staying": 5047, "heard": 2459, "honey": 2551, "adventure": 72, "appetizers": 226, "allergic": 129, "wheat": 5840, "gluten": 2253, "free": 2128, "created": 1284, "dipping": 1523, "provided": 4110, "sized": 4795, "presentation": 4048, "bathrooms": 432, "forward": 2112, "frequent": 2132, "travel": 5497, "downtown": 1605, "route": 4458, "bros": 659, "familiar": 1930, "tuesdays": 5552, "per": 3854, "ounce": 3690, "gotta": 2281, "west": 5832, "north": 3570, "begin": 465, "establishment": 1811, "frequenting": 2134, "compare": 1095, "filibertos": 2004, "sketchy": 4800, "holeinthewall": 2535, "appearance": 221, "lacks": 2925, "secret": 4616, "beans": 440, "seriously": 4653, "icing": 2625, "havent": 2445, "vacation": 5660, "highlights": 2505, "botanical": 593, "gardens": 2193, "skipping": 4810, "altogether": 152, "butterfly": 726, "closed": 1018, "areas": 249, "blame": 535, "plants": 3946, "managed": 3195, "enjoyment": 1775, "hiding": 2499, "varieties": 5670, "cacti": 738, "site": 4787, "major": 3179, "health": 2455, "considering": 1159, "control": 1187, "wtf": 5946, "barnes": 408, "relaxing": 4294, "library": 3028, "sense": 4644, "noise": 3552, "cozy": 1260, "gross": 2341, "lounge": 3125, "magazines": 3166, "wheels": 5842, "actually": 42, "purchased": 4133, "books": 578, "cafe": 742, "dirty": 1531, "wooden": 5906, "benches": 479, "serving": 4662, "drum": 1653, "solo": 4883, "ipod": 2769, "hear": 2458, "wifi": 5863, "novel": 3584, "watching": 5789, "kinds": 2886, "fav": 1955, "crappy": 1273, "burn": 706, "bummer": 699, "indian": 2686, "grown": 2351, "london": 3103, "imagine": 2645, "memory": 3306, "curry": 1341, "introduced": 2758, "stoked": 5082, "francisco": 2122, "york": 5977, "closer": 1020, "plus": 3968, "anymore": 201, "convinced": 1195, "rarely": 4206, "attempts": 322, "internet": 2750, "rolling": 4432, "earned": 1684, "showing": 4744, "scheduled": 4574, "tech": 5306, "disagree": 1532, "speed": 4955, "cave": 838, "creek": 1291, "slow": 4830, "month": 3428, "upgraded": 5636, "furthermore": 2178, "send": 4640, "tomorrow": 5442, "demand": 1443, "remove": 4315, "fees": 1977, "upgrade": 5635, "faster": 1945, "worse": 5925, "hype": 2620, "realized": 4235, "overrated": 3714, "chilis": 935, "praise": 4029, "pastor": 3800, "sets": 4668, "god": 2259, "stronger": 5123, "magical": 3168, "week": 5813, "ethnic": 1817, "cashiers": 820, "theyre": 5362, "locked": 3096, "moment": 3417, "flowers": 2065, "cut": 1346, "products": 4088, "sales": 4505, "da": 1354, "iced": 2624, "lined": 3054, "cups": 1332, "ready": 4231, "mixed": 3396, "creamy": 1282, "sip": 4781, "caramel": 786, "melts": 3300, "pho": 3882, "hippies": 2515, "preparation": 4040, "pharmacy": 3878, "bought": 600, "tries": 5519, "fifth": 1994, "gin": 2232, "slammed": 4814, "partake": 3782, "journey": 2833, "teenager": 5313, "easily": 1690, "flat": 2046, "school": 4577, "bag": 370, "seasoned": 4605, "fries": 2150, "soda": 4873, "afraid": 85, "ingredient": 2710, "organic": 3680, "jerrys": 2811, "lives": 3077, "liberty": 3027, "market": 3225, "funny": 2175, "joes": 2823, "farm": 1940, "ended": 1762, "search": 4599, "stand": 5018, "number": 3589, "brings": 652, "size": 4794, "homemade": 2544, "loaded": 3081, "cupcake": 1330, "restrooms": 4367, "setup": 4672, "nyc": 3598, "stalls": 5016, "mens": 3308, "restroom": 4366, "worries": 5923, "yum": 5988, "finish": 2022, "view": 5706, "olive": 3640, "pesto": 3871, "penne": 3845, "squash": 5000, "moneys": 3423, "sleek": 4817, "played": 3952, "competitive": 1106, "rates": 4210, "jeff": 2805, "agent": 92, "tuscan": 5561, "enjoyable": 1772, "surroundings": 5224, "screw": 4593, "earth": 1687, "possibly": 4009, "dream": 1620, "brands": 622, "skin": 4805, "extensive": 1890, "product": 4087, "christmas": 967, "creams": 1281, "fashion": 1943, "square": 4999, "strip": 5120, "vegas": 5676, "slice": 4819, "heaven": 2468, "couples": 1241, "load": 3080, "uninteresting": 5611, "crap": 1272, "single": 4779, "written": 5942, "summary": 5183, "reason": 4237, "forced": 2094, "az": 359, "urban": 5645, "stab": 5008, "overweight": 3715, "blaring": 539, "dj": 1570, "trouble": 5528, "throughout": 5388, "enormous": 1777, "completely": 1116, "names": 3489, "numbers": 3590, "proud": 4106, "guessed": 2360, "chairs": 865, "typically": 5573, "delivery": 1441, "cosmo": 1220, "purse": 4141, "aside": 287, "cheesecake": 911, "pushing": 4145, "dripping": 1634, "waffle": 5737, "round": 4455, "ship": 4711, "chance": 870, "factory": 1913, "hint": 2512, "sour": 4929, "takes": 5261, "whipped": 5848, "efficient": 1718, "humor": 2606, "appropriate": 241, "weve": 5836, "rule": 4475, "wouldnt": 5930, "spoiled": 4977, "asian": 286, "bay": 435, "fairly": 1921, "bland": 537, "steamed": 5057, "veggie": 5681, "lacking": 2923, "stir": 5078, "seemed": 4626, "canned": 774, "answers": 193, "admittedly": 62, "ds": 1657, "definition": 1420, "experienced": 1876, "description": 1459, "interesting": 2748, "summit": 5185, "zinburger": 5994, "scared": 4567, "mike": 3349, "chain": 862, "brother": 661, "crab": 1261, "bisque": 521, "stuffed": 5136, "brie": 646, "unbelievably": 5591, "shape": 4690, "brick": 644, "apple": 228, "barely": 403, "outstanding": 3699, "stopping": 5092, "annoying": 187, "visits": 5723, "mi": 3335, "joint": 2830, "aesthetics": 80, "maximum": 3260, "capacity": 782, "folks": 2076, "pizzas": 3931, "classic": 997, "toppings": 5456, "arent": 251, "youd": 5979, "hut": 2617, "slices": 4821, "salami": 4503, "arugula": 282, "beyond": 498, "legit": 3004, "freshly": 2139, "loaves": 3084, "focaccia": 2072, "virgin": 5716, "grandmothers": 2299, "airy": 112, "explode": 1885, "cotton": 1227, "hooked": 2556, "wednesday": 5810, "lack": 2921, "rave": 4215, "starting": 5033, "question": 4165, "associate": 299, "salt": 4511, "skip": 4808, "oreganos": 3679, "seems": 4628, "buddy": 683, "thin": 5367, "crust": 1314, "crackers": 1265, "melted": 3299, "fastfood": 1946, "beats": 446, "pan": 3757, "deserves": 1464, "subpar": 5151, "expensive": 1874, "alternatives": 150, "pizzeria": 3932, "grimaldis": 2330, "mias": 3337, "original": 3684, "mia": 3336, "lucky": 3141, "six": 4793, "enjoyed": 1773, "venue": 5690, "offered": 3622, "brown": 664, "sub": 5149, "quote": 4179, "item": 2784, "squid": 5004, "ao": 208, "greens": 2322, "latter": 2957, "pricey": 4064, "portion": 4004, "unimpressed": 5609, "recall": 4241, "hana": 2398, "andor": 177, "apps": 244, "attended": 326, "pressure": 4053, "offers": 3625, "discounts": 1542, "grinder": 2332, "everytime": 1834, "tips": 5416, "attend": 323, "glendale": 2248, "enjoys": 1776, "sorts": 4920, "togo": 5433, "pulled": 4124, "dry": 1656, "tasteless": 5287, "overly": 3710, "second": 4613, "coworkers": 1258, "complained": 1109, "prefer": 4033, "fig": 1995, "theyve": 5363, "fennel": 1983, "beautifully": 449, "produce": 4086, "department": 1451, "boneless": 572, "roast": 4419, "butcher": 721, "peek": 3842, "freezer": 2130, "section": 4617, "gets": 2221, "five": 2037, "holidays": 2538, "grain": 2293, "mustard": 3478, "otherwise": 3688, "carries": 804, "practically": 4026, "culinary": 1325, "recipe": 4252, "appreciate": 236, "via": 5699, "laptop": 2939, "freeway": 2129, "courtesy": 1248, "mile": 3353, "americas": 168, "eddie": 1707, "bashas": 418, "thank": 5344, "provide": 4109, "hidden": 2497, "loud": 3121, "clientele": 1013, "karaoke": 2855, "weird": 5822, "weekends": 5816, "cuz": 1352, "aint": 105, "cowboy": 1256, "ciao": 976, "share": 4692, "stetson": 5064, "bigger": 505, "exotic": 1866, "mushroom": 3471, "fry": 2163, "bacon": 367, "peanut": 3832, "brittle": 655, "cannot": 775, "greasy": 2314, "chunks": 970, "pot": 4014, "steal": 5054, "authentic": 337, "halibut": 2391, "remind": 4309, "beverage": 495, "actual": 41, "hong": 2552, "kong": 2906, "suit": 5178, "designer": 1467, "despite": 1476, "odor": 3618, "justify": 2849, "absurd": 5, "warned": 5775, "lost": 3118, "leaf": 2980, "refrigerator": 4276, "beers": 460, "promise": 4094, "somehow": 4889, "become": 452, "surly": 5217, "seemingly": 4627, "forgetting": 2097, "hospitality": 2575, "industry": 2699, "bars": 412, "fly": 2069, "dance": 1361, "redeeming": 4262, "swear": 5229, "dude": 1660, "imaginable": 2644, "gonna": 2267, "snap": 4859, "roughly": 4454, "mediterranean": 3288, "prompt": 4097, "hi": 2496, "ultimately": 5581, "stocking": 5081, "shelves": 4707, "waste": 5784, "saturdays": 4544, "entering": 1782, "register": 4283, "booth": 582, "spotless": 4987, "monte": 3427, "cristo": 1301, "among": 169, "blueberry": 559, "jam": 2796, "managers": 3198, "hours": 2588, "asparagus": 293, "tempura": 5321, "inedible": 2700, "ends": 1765, "talked": 5266, "companions": 1092, "experiences": 1877, "paid": 3737, "mongolian": 3424, "boo": 575, "starving": 5035, "msg": 3459, "sick": 4755, "woo": 5904, "bf": 499, "spent": 4959, "southern": 4933, "sits": 4789, "cocoa": 1043, "fortunately": 2110, "buds": 685, "syrup": 5244, "wifes": 5862, "mine": 3367, "cheaper": 898, "complaining": 1110, "hash": 2431, "browns": 667, "thru": 5392, "halfway": 2390, "lemonade": 3008, "mint": 3376, "son": 4900, "pancakes": 3760, "hashbrowns": 2432, "pecan": 3836, "band": 393, "playing": 3955, "crowd": 1306, "attempt": 319, "volume": 5730, "whose": 5858, "failed": 1916, "dinning": 1520, "delivering": 1439, "patrons": 3818, "cameras": 763, "ranch": 4196, "consistently": 1163, "gary": 2195, "gas": 2196, "execution": 1857, "hummus": 2605, "sample": 4515, "olives": 3641, "choice": 950, "plantains": 3945, "ciabatta": 975, "typical": 5572, "mix": 3395, "wilted": 5868, "nasty": 3493, "shame": 4687, "dried": 1628, "goat": 2258, "struggled": 5127, "proper": 4099, "martini": 3233, "communication": 1087, "skills": 4803, "lemon": 3007, "pour": 4021, "twist": 5567, "congrats": 1152, "shabby": 4679, "club": 1028, "juices": 2837, "piercings": 3912, "nose": 3573, "problems": 4081, "jewelry": 2815, "informative": 2707, "shops": 4728, "sex": 4676, "cappuccino": 783, "rocks": 4428, "hell": 2479, "replaced": 4327, "appetizing": 227, "break": 630, "whats": 5838, "herb": 2487, "uses": 5654, "vegetarian": 5679, "vegan": 5675, "glutenfree": 2254, "spinach": 4967, "artichoke": 272, "dip": 1521, "mexico": 3333, "hatch": 2436, "chile": 931, "country": 1237, "heated": 2466, "planned": 3941, "members": 3302, "rent": 4318, "court": 1246, "basis": 423, "regardless": 4281, "courts": 1249, "facilities": 1908, "salted": 4512, "chandler": 873, "pick": 3894, "pint": 3920, "ballet": 388, "lindsey": 3052, "opportunity": 3664, "performance": 3859, "stunning": 5141, "decorated": 1407, "gentleman": 2213, "children": 928, "pictures": 3907, "bartenders": 414, "accomodating": 19, "dancers": 1362, "season": 4603, "ding": 1516, "district": 1563, "peanuts": 3833, "pointing": 3978, "proceeded": 4083, "sprinkle": 4994, "atleast": 312, "raw": 4219, "dumped": 1667, "spoke": 4978, "chinese": 942, "smile": 4844, "became": 451, "friendlier": 2146, "behavior": 468, "lobbys": 3086, "results": 4370, "freak": 2125, "chili": 933, "featured": 1967, "kinda": 2884, "crinkle": 1297, "del": 1423, "frozen": 2156, "approach": 239, "cup": 1329, "basic": 419, "boot": 581, "favors": 1961, "starbucks": 5025, "closest": 1022, "reads": 4230, "steps": 5063, "improve": 2665, "hubby": 2596, "visited": 5720, "enchiladas": 1755, "memorable": 3304, "terribly": 5334, "doubt": 1595, "common": 1085, "artists": 279, "crowds": 1308, "sound": 4923, "terrible": 5333, "bands": 394, "venues": 5691, "metal": 3327, "hiphop": 2514, "opinions": 3663, "wear": 5802, "pants": 3766, "suck": 5163, "exit": 1865, "significantly": 4765, "cooler": 1203, "afford": 83, "ac": 7, "answer": 190, "understaffed": 5596, "hire": 2518, "thus": 5397, "allowing": 136, "concept": 1127, "business": 716, "hopefully": 2560, "forgo": 2099, "wearing": 5803, "support": 5206, "craft": 1266, "hide": 2498, "sans": 4529, "holiday": 2537, "soups": 4927, "reflect": 4273, "preface": 4032, "sorely": 4916, "hopes": 2561, "confusing": 1150, "board": 561, "appeared": 222, "initial": 2713, "confusion": 1151, "smoothie": 4854, "microwave": 3341, "bowls": 608, "bean": 439, "thoroughly": 5378, "allowed": 135, "develop": 1485, "concoction": 1134, "diner": 1514, "amounts": 172, "sprinkled": 4995, "creation": 1286, "obviously": 3605, "prep": 4039, "consider": 1157, "chalkboard": 866, "deliver": 1437, "endeavor": 1761, "dang": 1364, "fingers": 2021, "lentils": 3012, "lamb": 2931, "scoop": 4580, "crepe": 1294, "king": 2887, "stick": 5067, "postinos": 4013, "valet": 5663, "bruschetta": 671, "determined": 1484, "ricotta": 4394, "dates": 1371, "pistachio": 3924, "steep": 5058, "planning": 3942, "agree": 97, "someday": 4888, "alone": 140, "resist": 4351, "definately": 1416, "joints": 2831, "outdoor": 3693, "singing": 4778, "ratings": 4213, "channel": 879, "cafeteria": 743, "stomach": 5085, "navigate": 3500, "historic": 2521, "quaint": 4154, "dcor": 1383, "fast": 1944, "havarti": 2444, "cheddar": 906, "hawaiian": 2447, "turkey": 5556, "gold": 2263, "lessons": 3016, "mall": 3189, "malls": 3190, "women": 5893, "styles": 5144, "pair": 3745, "bliss": 547, "unbelievable": 5590, "mastros": 3249, "hall": 2392, "steakhouse": 5051, "steakhouses": 5052, "jim": 2817, "sexy": 4677, "oysters": 3724, "legs": 3006, "mac": 3154, "sauteed": 4552, "illegal": 2642, "worry": 5924, "fourth": 2117, "bed": 455, "gel": 2203, "spa": 4938, "pedicure": 3839, "follows": 2080, "students": 5131, "unprofessional": 5624, "generally": 2207, "inappropriate": 2669, "setting": 4669, "disturbing": 1564, "stated": 5037, "peel": 3843, "polish": 3986, "remained": 4301, "massage": 3245, "weak": 5801, "carts": 812, "foot": 2090, "corner": 1214, "thai": 5343, "kung": 2913, "non": 3555, "pad": 3734, "container": 1175, "fridge": 2143, "edible": 1711, "gs": 2353, "jade": 2792, "palace": 3750, "mediocre": 3287, "mins": 3375, "higher": 2502, "situation": 4792, "smokey": 4850, "jack": 2790, "pressed": 4052, "pickle": 3897, "potato": 4015, "fountain": 2114, "refills": 4272, "indeed": 2684, "vanilla": 5668, "iti": 2786, "returning": 4375, "merry": 3318, "girlfriends": 2236, "hopping": 2564, "sight": 4759, "older": 3639, "intimate": 2752, "cause": 834, "twitter": 5568, "follow": 2077, "crazy": 1278, "confused": 1149, "plates": 3949, "omg": 3644, "waiters": 5742, "wasted": 5785, "tamales": 5271, "bunch": 702, "takeout": 5260, "foodie": 2086, "margherita": 3217, "eggplant": 1723, "parm": 3779, "lasagna": 2946, "hearts": 2463, "delicate": 1428, "particular": 3783, "celebration": 846, "requested": 4337, "courses": 1245, "paired": 3746, "vs": 5736, "standards": 5020, "comparing": 1098, "austin": 336, "bananas": 392, "divine": 1569, "delish": 1436, "michaels": 3339, "dislike": 1552, "using": 5655, "putting": 4149, "disaster": 1539, "aisles": 114, "heart": 2461, "spicy": 4964, "sticky": 5072, "mango": 3200, "mood": 3431, "amber": 158, "closing": 1024, "married": 3230, "leaving": 2992, "spoken": 4979, "hurry": 2612, "camelback": 761, "rundown": 4479, "rose": 4445, "shower": 4743, "savor": 4557, "mountain": 3444, "usually": 5657, "swim": 5235, "treatment": 5507, "dive": 1565, "overwhelmed": 3716, "note": 3578, "ridiculous": 4399, "female": 1982, "cashier": 819, "spending": 4958, "screen": 4591, "phx": 3891, "wished": 5887, "negative": 3515, "gyro": 2376, "pita": 3926, "greek": 2320, "gelato": 2204, "ritas": 4413, "smack": 4832, "locals": 3090, "charm": 890, "exception": 1846, "opens": 3657, "sublime": 5150, "reasonably": 4239, "buffet": 687, "includes": 2675, "including": 2676, "mothers": 3441, "holy": 2540, "stations": 5042, "candy": 772, "maker": 3183, "regret": 4284, "mind": 3365, "fountains": 2115, "views": 5708, "available": 344, "jerk": 2809, "noodle": 3561, "stayed": 5046, "surprisingly": 5221, "immediate": 2649, "response": 4357, "email": 1744, "additional": 53, "shirt": 4714, "tucked": 5549, "quoted": 4180, "fix": 2038, "normal": 3568, "smiles": 4846, "butt": 722, "plumbing": 3967, "coupon": 1242, "envy": 1797, "exceeded": 1843, "affordable": 84, "professionalism": 4090, "therapist": 5357, "worked": 5913, "points": 3979, "muscles": 3468, "young": 5981, "college": 1058, "student": 5130, "works": 5918, "attitude": 330, "killed": 2878, "hearing": 2460, "sloppy": 4829, "decent": 1398, "dancing": 1363, "cover": 1253, "raised": 4192, "coke": 1051, "combine": 1067, "republic": 4334, "flying": 2070, "roof": 4437, "perform": 3858, "vibe": 5700, "hannys": 2414, "straight": 5099, "lighting": 3039, "dim": 1510, "posh": 4006, "roommate": 4439, "margarita": 3215, "peach": 3829, "holding": 2532, "manhattan": 3201, "hed": 2473, "modern": 3408, "refried": 4275, "waitresses": 5745, "hasnt": 2433, "qt": 4152, "grabbing": 2287, "snack": 4857, "thursday": 5395, "wines": 5876, "introducing": 2759, "whites": 5850, "reds": 4263, "resturant": 4368, "pre": 4030, "chops": 958, "sum": 5182, "fuck": 2166, "soo": 4907, "watery": 5795, "substance": 5154, "poached": 3971, "hardly": 2427, "badly": 369, "matts": 3257, "roosevelt": 4442, "serves": 4658, "craving": 1276, "air": 107, "smelled": 4841, "frying": 2164, "diners": 1515, "duh": 1664, "opted": 3668, "japanese": 2799, "mai": 3171, "broth": 660, "added": 45, "casual": 824, "lines": 3056, "buffalo": 686, "wendys": 5829, "mani": 3202, "pedi": 3838, "services": 4661, "file": 2001, "smoothies": 4855, "tonight": 5447, "sun": 5187, "risotto": 4412, "marinated": 3222, "breast": 635, "blackened": 533, "forks": 2103, "combination": 1065, "coupled": 1240, "pudding": 4119, "jason": 2802, "touched": 5467, "continued": 1182, "latte": 2956, "searching": 4601, "stumbled": 5139, "rack": 4184, "slightly": 4826, "joke": 2832, "walks": 5753, "raving": 4217, "burrito": 711, "tortilla": 5460, "rip": 4407, "unaware": 5588, "bummed": 698, "mcdonalds": 3265, "likely": 3044, "rest": 4361, "midwest": 3346, "mayo": 3263, "blew": 546, "breasts": 636, "lb": 2975, "insisted": 2727, "meats": 3282, "trusted": 5538, "fatty": 1952, "stinks": 5075, "rotting": 4452, "animal": 182, "puts": 4148, "inches": 2671, "rotten": 4451, "stuffing": 5137, "junk": 2845, "frank": 2123, "trust": 5537, "gives": 2240, "ground": 2343, "thinks": 5372, "selling": 4637, "questionable": 4166, "throwing": 5390, "touching": 5468, "awful": 356, "valuable": 5665, "update": 5631, "huevos": 2600, "rancheros": 4197, "passed": 3790, "pricier": 4065, "wildflower": 5865, "hangout": 2411, "busboy": 715, "agreed": 98, "cleared": 1008, "clue": 1030, "upset": 5642, "um": 5583, "regularly": 4286, "relaxed": 4293, "handled": 2403, "gently": 2215, "kudos": 2912, "dunno": 1672, "express": 1888, "receive": 4244, "healing": 2454, "knowledge": 2900, "commitment": 1083, "client": 1012, "measured": 3277, "dedicated": 1410, "starts": 5034, "keeps": 2862, "multiple": 3465, "levels": 3024, "calling": 754, "listen": 3064, "listened": 3065, "ordering": 3676, "burnt": 709, "smoke": 4848, "burned": 707, "famous": 1933, "funky": 2174, "jerky": 2810, "happily": 2421, "creamed": 1280, "liking": 3046, "smiled": 4845, "qualities": 4155, "yelps": 5967, "requires": 4342, "hotter": 2586, "surface": 5214, "alcohol": 123, "smothered": 4856, "vig": 5709, "met": 3326, "standard": 5019, "trendy": 5515, "ie": 2634, "act": 33, "anytime": 204, "bitter": 528, "powder": 4024, "adds": 56, "difference": 1500, "effective": 1717, "snob": 4862, "supplies": 5204, "supply": 5205, "welcomed": 5824, "fully": 2172, "browse": 668, "drawing": 1617, "paint": 3741, "ceramic": 855, "tools": 5450, "desire": 1471, "golden": 2264, "diverse": 1566, "tummy": 5553, "sister": 4784, "lil": 3047, "condiment": 1137, "seaweed": 4612, "kimchi": 2882, "cabbage": 737, "crack": 1262, "sizzling": 4797, "pack": 3727, "boxes": 611, "fathers": 1951, "dumpling": 1668, "tofu": 5431, "suns": 5193, "organization": 3681, "treats": 5509, "contact": 1170, "kyle": 2914, "promptly": 4098, "process": 4084, "tickets": 5399, "discounted": 1541, "rewards": 4385, "depending": 1452, "target": 5280, "windshield": 5873, "shrugged": 4749, "solution": 4884, "encountered": 1757, "meet": 3291, "alfredo": 126, "period": 3862, "boba": 564, "word": 5909, "living": 3078, "vouch": 5734, "avocado": 348, "snow": 4865, "approached": 240, "nobody": 3549, "accustomed": 26, "guest": 2362, "treated": 5506, "hoped": 2559, "generic": 2208, "walls": 5756, "paper": 3770, "worn": 5921, "offerings": 3624, "gyoza": 2375, "cherry": 919, "blossom": 553, "somewhat": 4897, "runny": 4481, "messy": 3325, "awkward": 358, "octopus": 3614, "ramen": 4194, "miso": 3386, "deciding": 1401, "de": 1384, "locations": 3094, "pushy": 4146, "bras": 623, "bra": 617, "pink": 3918, "merchandise": 3314, "listing": 3068, "budget": 684, "jennifer": 2808, "jelly": 2806, "obliged": 3602, "emailed": 1745, "picture": 3906, "sugar": 5171, "butterflies": 725, "combinations": 1066, "pride": 4068, "dropped": 1646, "bakery": 382, "selections": 4633, "cheeses": 912, "breads": 629, "directly": 1528, "challenge": 867, "provolone": 4114, "proximity": 4115, "shell": 4705, "fee": 1971, "parts": 3787, "charges": 886, "intend": 2741, "mill": 3357, "university": 5616, "able": 2, "mess": 3321, "curious": 1336, "wing": 5877, "wongs": 5900, "torn": 5458, "ghost": 2225, "ruby": 4469, "hangs": 2413, "trend": 5514, "bills": 512, "tv": 5562, "sucked": 5164, "printed": 4073, "freaking": 2127, "bottles": 598, "clueless": 1031, "draft": 1609, "triple": 5524, "drowned": 1649, "cauliflower": 833, "nut": 3593, "example": 1842, "tuck": 5548, "result": 4369, "largest": 2944, "courteous": 1247, "carry": 807, "womens": 5894, "silver": 4768, "macys": 3161, "shoes": 4722, "accessories": 14, "punch": 4130, "clothes": 1026, "structure": 5126, "starter": 5031, "quesadilla": 4161, "lavosh": 2966, "falafel": 1925, "gyros": 2377, "thrown": 5391, "click": 1011, "nutrition": 3595, "chart": 893, "crumbs": 1311, "flour": 2063, "contain": 1173, "soy": 4936, "protein": 4105, "hey": 2494, "heck": 2472, "meatloaf": 3281, "social": 4870, "kim": 2881, "challenging": 868, "freakin": 2126, "facing": 1910, "pro": 4078, "stack": 5009, "piled": 3916, "cook": 1196, "movie": 3453, "theater": 5351, "minnie": 3373, "epic": 1798, "childhood": 927, "bobby": 565, "enjoying": 1774, "st": 5007, "louis": 3123, "fall": 1926, "practices": 4028, "sooo": 4910, "mini": 3368, "cupcakes": 1331, "debit": 1393, "include": 2673, "traveler": 5499, "fab": 1900, "decoration": 1408, "brulee": 669, "hip": 2513, "micro": 3340, "cinnamon": 982, "doughnuts": 1599, "scored": 4583, "conference": 1144, "chino": 943, "watering": 5793, "heartbroken": 2462, "history": 2522, "lo": 3079, "behold": 470, "frys": 2165, "appears": 223, "brushed": 673, "pico": 3904, "convince": 1194, "brownie": 665, "carrying": 808, "burritos": 712, "supporting": 5207, "businesses": 717, "farms": 1942, "safe": 4491, "restrictions": 4365, "continue": 1181, "grow": 2348, "adults": 68, "refilling": 4271, "tikka": 5403, "naan": 3480, "whos": 5857, "standing": 5021, "greet": 2323, "apparently": 217, "related": 4289, "chutney": 974, "plastic": 3947, "paste": 3798, "huh": 2602, "engaging": 1768, "potential": 4017, "repeat": 4324, "patronage": 3816, "ugly": 5578, "acted": 34, "soap": 4869, "ancient": 176, "switched": 5242, "unknown": 5617, "songs": 4902, "movies": 3454, "video": 5701, "swiss": 5240, "sudden": 5168, "advertising": 76, "pretzels": 4058, "medium": 3289, "father": 1950, "juice": 2836, "spilled": 4965, "wet": 5835, "towel": 5475, "uncle": 5592, "grandmother": 2298, "charred": 892, "edges": 1710, "strips": 5121, "bs": 675, "gay": 2201, "obvious": 3604, "thursdays": 5396, "sundays": 5190, "alternative": 149, "dig": 1505, "forbidden": 2092, "cheers": 908, "patios": 3814, "drag": 1611, "samples": 4518, "liquor": 3059, "sampled": 4516, "retail": 4371, "sliders": 4824, "dreams": 1621, "text": 5339, "information": 2706, "updated": 5632, "mascarpone": 3239, "currently": 1339, "nutella": 3594, "houses": 2591, "trips": 5525, "california": 751, "dvd": 1676, "rings": 4405, "fallen": 1927, "driven": 1637, "mushy": 3473, "consisted": 1160, "spices": 4962, "underneath": 5595, "polenta": 3983, "sharp": 4695, "bold": 568, "technique": 5309, "sounded": 4924, "guac": 2354, "ya": 5949, "bertos": 489, "lousy": 3126, "crying": 1318, "wants": 5767, "bags": 374, "therefore": 5358, "heavily": 2470, "coupons": 