{
    "AccountsNotesAndLoansReceivableNetCurrent": {
        "description": "Amount, after allowance for credit loss, of accounts and financing receivables, classified as current. Includes, but is not limited to, notes and loan receivable."
    },
    "AccountsPayableCurrent": {
        "description": "Carrying value as of the balance sheet date of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."
    },
    "AccountsReceivableNetCurrent": {
        "description": "Amount, after allowance for credit loss, of right to consideration from customer for product sold and service rendered in normal course of business, classified as current."
    },
    "AccrualForEnvironmentalLossContingencies": {
        "description": "Total costs accrued as of the balance sheet date for environmental loss contingencies."
    },
    "AccruedEnvironmentalLossContingenciesNoncurrent": {
        "description": "Carrying value of the obligation (known or estimated) arising from requirements to perform activities to remediate one or more sites, payable after twelve months or beyond the next operating cycle if longer."
    },
    "AccumulatedDepreciationDepletionAndAmortizationPropertyPlantAndEquipment": {
        "description": "Amount of accumulated depreciation, depletion and amortization for physical assets used in the normal conduct of business to produce goods and services."
    },
    "AccumulatedOtherComprehensiveIncomeLossNetOfTax": {
        "description": "Accumulated change in equity from transactions and other events and circumstances from non-owner sources, net of tax effect, at period end. Excludes Net Income (Loss), and accumulated changes in equity from transactions resulting from investments by owners and distributions to owners. Includes foreign currency translation items, certain pension adjustments, unrealized gains and losses on certain investments in debt and equity securities, other than temporary impairment (OTTI) losses related to factors other than credit losses on available-for-sale and held-to-maturity debt securities that an entity does not intend to sell and it is not more likely than not that the entity will be required to sell before recovery of the amortized cost basis, as well as changes in the fair value of derivatives related to the effective portion of a designated cash flow hedge."
    },
    "AcquiredFiniteLivedIntangibleAssetWeightedAverageUsefulLife": {
        "description": "The calculated weighted-average amortization period of a major class of finite-lived intangible assets acquired during the current period either individually or as part of a group of assets (in either an asset acquisition or business combination). A major class is composed of intangible assets that can be grouped together because they are similar, either by their nature or by their use in the operations of a company."
    },
    "AdjustmentsRelatedToTaxWithholdingForShareBasedCompensation": {
        "description": "Amount of decrease to equity for grantee's tax withholding obligation for award under share-based payment arrangement."
    },
    "AllocatedShareBasedCompensationExpense": {
        "description": "Amount of expense for award under share-based payment arrangement. Excludes amount capitalized."
    },
    "AllocatedShareBasedCompensationExpenseNetOfTax": {
        "description": "Amount, after tax, of expense for award under share-based payment arrangement."
    },
    "AllowanceForDoubtfulAccountsReceivable": {
        "description": "Amount of allowance for credit loss on accounts receivable."
    },
    "AllowanceForDoubtfulAccountsReceivableCurrent": {
        "description": "Amount of allowance for credit loss on accounts receivable, classified as current."
    },
    "AllowanceForDoubtfulAccountsReceivablePeriodIncreaseDecrease": {
        "description": "Amount of increase (decrease) in allowance for credit loss on accounts receivable."
    },
    "AllowanceForDoubtfulAccountsReceivableWriteOffs": {
        "description": "Amount of direct write-downs of accounts receivable charged against the allowance."
    },
    "AllowanceForDoubtfulOtherReceivablesCurrent": {
        "description": "Amount of valuation allowance for receivables classified as other, due within one year or the normal operating cycle, if longer."
    },
    "AllowanceForNotesAndLoansReceivableCurrent": {
        "description": "Amount of allowance for credit loss on financing receivable, classified as current."
    },
    "AllowanceForNotesAndLoansReceivableNoncurrent": {
        "description": "Amount of allowance for credit loss on financing receivable, classified as noncurrent."
    },
    "AmortizationOfFinancingCosts": {
        "description": "Amount of amortization expense attributable to debt issuance costs."
    },
    "AmortizationOfIntangibleAssets": {
        "description": "The aggregate expense charged against earnings to allocate the cost of intangible assets (nonphysical assets not used in production) in a systematic and rational manner to the periods expected to benefit from such assets. As a noncash expense, this element is added back to net income when calculating cash provided by or used in operations using the indirect method."
    },
    "AntidilutiveSecuritiesExcludedFromComputationOfEarningsPerShareAmount": {
        "description": "Securities (including those issuable pursuant to contingent stock agreements) that could potentially dilute basic earnings per share (EPS) or earnings per unit (EPU) in the future that were not included in the computation of diluted EPS or EPU because to do so would increase EPS or EPU amounts or decrease loss per share or unit amounts for the period presented."
    },
    "AssetRetirementObligation": {
        "description": "The carrying amount of a liability for an asset retirement obligation. An asset retirement obligation is a legal obligation associated with the disposal or retirement of a tangible long-lived asset that results from the acquisition, construction or development, or the normal operations of a long-lived asset, except for certain obligations of lessees."
    },
    "AssetRetirementObligationsNoncurrent": {
        "description": "Noncurrent portion of the carrying amount of a liability for an asset retirement obligation. An asset retirement obligation is a legal obligation associated with the disposal or retirement of a tangible long-lived asset that results from the acquisition, construction or development, or the normal operations of a long-lived asset, except for certain obligations of lessees."
    },
    "Assets": {
        "description": "Sum of the carrying amounts as of the balance sheet date of all assets that are recognized. Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."
    },
    "AssetsCurrent": {
        "description": "Sum of the carrying amounts as of the balance sheet date of all assets that are expected to be realized in cash, sold, or consumed within one year (or the normal operating cycle, if longer). Assets are probable future economic benefits obtained or controlled by an entity as a result of past transactions or events."
    },
    "AvailableForSaleDebtSecuritiesAccumulatedGrossUnrealizedGainBeforeTax": {
        "description": "Amount, before tax, of unrealized gain in accumulated other comprehensive income (AOCI) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale)."
    },
    "AvailableForSaleDebtSecuritiesAmortizedCostBasis": {
        "description": "Amortized cost of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale)."
    },
    "AvailableForSaleEquitySecuritiesAccumulatedGrossUnrealizedGainBeforeTax": {
        "description": "Amount before tax of unrealized gain in accumulated other comprehensive income (AOCI) on investments in equity securities classified as available-for-sale."
    },
    "AvailableForSaleEquitySecuritiesAccumulatedGrossUnrealizedLossBeforeTax": {
        "description": "Amount before tax of unrealized loss in accumulated other comprehensive income (AOCI) on investments in equity securities classified as available-for-sale."
    },
    "AvailableForSaleEquitySecuritiesAmortizedCostBasis": {
        "description": "This item represents the cost of equity securities, which are categorized neither as held-to-maturity nor trading, net of adjustments for other-than-temporary impairments recognized in earnings (less any cumulative-effect adjustments recognized, as defined), and fair value hedge accounting adjustments, if any."
    },
    "AvailableForSaleSecuritiesDebtSecuritiesCurrent": {
        "description": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), classified as current."
    },
    "AvailableForSaleSecuritiesDebtSecuritiesNoncurrent": {
        "description": "Amount of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), classified as noncurrent."
    },
    "AvailableForSaleSecuritiesEquitySecuritiesNoncurrent": {
        "description": "Equity securities categorized neither as held-to-maturity nor trading which are intended be sold more than one year from the balance sheet date or operating cycle, if longer."
    },
    "AvailableForSaleSecuritiesGrossRealizedGains": {
        "description": "This item represents the gross profit realized on the sale of debt or equity securities categorized neither as held-to-maturity nor trading securities."
    },
    "AvailableForSaleSecuritiesGrossRealizedGainsLossesSaleProceeds": {
        "description": "The total amount of proceeds received for the sale of securities, categorized neither as held-to-maturity nor trading securities, during the reporting period."
    },
    "AvailableForSaleSecuritiesGrossRealizedLosses": {
        "description": "This item represents the gross loss realized on the sale of debt or equity securities categorized neither as held-to-maturity nor trading securities."
    },
    "BusinessAcquisitionCostOfAcquiredEntityCashPaid": {
        "description": "Amount of cash paid to acquire the entity."
    },
    "BusinessAcquisitionCostOfAcquiredEntityPurchasePrice": {
        "description": "The total cost of the acquired entity including the cash paid to shareholders of acquired entities, fair value of debt and equity securities issued to shareholders of acquired entities, the fair value of the liabilities assumed, and direct costs of the acquisition."
    },
    "BusinessAcquisitionPercentageOfVotingInterestsAcquired": {
        "description": "Percentage of voting equity interests acquired at the acquisition date in the business combination."
    },
    "BusinessAcquisitionPurchasePriceAllocationAssetsAcquired": {
        "description": "The amount of acquisition cost of a business combination allocated to assets acquired."
    },
    "BusinessAcquisitionPurchasePriceAllocationAssetsAcquiredLiabilitiesAssumedNet": {
        "description": "The total purchase price of the acquired entity. This includes cash paid to equity interest holders of the acquired entity, fair value of debt and equity securities issued to equity holders of the acquired entity, and transaction costs paid to third parties to consummate the acquisition."
    },
    "BusinessAcquisitionPurchasePriceAllocationCurrentAssets": {
        "description": "The amount of acquisition cost of a business combination allocated to current assets."
    },
    "BusinessAcquisitionPurchasePriceAllocationCurrentLiabilities": {
        "description": "The amount of acquisition cost of a business combination allocated to current liabilities of the acquired entity."
    },
    "BusinessAcquisitionPurchasePriceAllocationGoodwillAmount": {
        "description": "Amount of goodwill arising from a business combination, which is the excess of the cost of the acquired entity over the amounts assigned to assets acquired and liabilities assumed."
    },
    "BusinessAcquisitionPurchasePriceAllocationLiabilitiesAssumed": {
        "description": "The amount of acquisition cost of a business combination allocated to liabilities assumed."
    },
    "BusinessAcquisitionPurchasePriceAllocationNoncurrentLiabilities": {
        "description": "The amount of acquisition cost of a business combination allocated to noncurrent liabilities of the acquired entity."
    },
    "BusinessAcquisitionPurchasePriceAllocationPropertyPlantAndEquipment": {
        "description": "The amount of acquisition cost of a business combination allocated to property, plant and equipment to be used in ongoing operations."
    },
    "BusinessCombinationConsiderationTransferred1": {
        "description": "Amount of consideration transferred, consisting of acquisition-date fair value of assets transferred by the acquirer, liabilities incurred by the acquirer, and equity interest issued by the acquirer."
    },
    "BusinessCombinationContingentConsiderationLiabilityNoncurrent": {
        "description": "Amount of liability recognized arising from contingent consideration in a business combination, expected to be settled beyond one year or the normal operating cycle, if longer."
    },
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedAssets": {
        "description": "Amount of assets acquired at the acquisition date."
    },
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedCurrentAssets": {
        "description": "Amount of assets that are expected to be realized or consumed within one year or the normal operating cycle, if longer, acquired at the acquisition date."
    },
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedCurrentLiabilities": {
        "description": "Amount of liabilities due within one year or within the normal operating cycle, if longer, assumed at the acquisition date."
    },
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedLiabilities": {
        "description": "Amount of liabilities assumed at the acquisition date."
    },
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredAndLiabilitiesAssumedNoncurrentLiabilities": {
        "description": "Amount of liabilities due after one year or the normal operating cycle, if longer, assumed at the acquisition date."
    },
    "BusinessCombinationRecognizedIdentifiableAssetsAcquiredGoodwillAndLiabilitiesAssumedNet": {
        "description": "Amount recognized for assets, including goodwill, in excess of (less than) the aggregate liabilities assumed."
    },
    "CapitalizedContractCostAmortization": {
        "description": "Amount of amortization expense for asset recognized from cost incurred to obtain or fulfill contract with customer."
    },
    "CapitalizedContractCostNet": {
        "description": "Amount, after accumulated amortization and accumulated impairment loss, of asset recognized from cost incurred to obtain or fulfill contract with customer."
    },
    "CapitalizedContractCostNetCurrent": {
        "description": "Amount, after accumulated amortization and accumulated impairment loss, of asset recognized from cost incurred to obtain or fulfill contract with customer; classified as current."
    },
    "CapitalizedContractCostNetNoncurrent": {
        "description": "Amount, after accumulated amortization and accumulated impairment loss, of asset recognized from cost incurred to obtain or fulfill contract with customer; classified as noncurrent."
    },
    "CapitalLeaseObligationsIncurred": {
        "description": "Amount of increase in lease obligation from new lease."
    },
    "CapitalLeasesFutureMinimumPaymentsDueCurrent": {
        "description": "Amount of minimum lease payments for capital leases due in the next fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "CapitalLeasesFutureMinimumPaymentsDueInFiveYears": {
        "description": "Amount of minimum lease payments for capital leases due in the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "CapitalLeasesFutureMinimumPaymentsDueInFourYears": {
        "description": "Amount of minimum lease payments for capital leases due in the fourth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "CapitalLeasesFutureMinimumPaymentsDueInThreeYears": {
        "description": "Amount of minimum lease payments for capital leases due in the third fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "CapitalLeasesFutureMinimumPaymentsDueInTwoYears": {
        "description": "Amount of minimum lease payments for capital leases due in the second fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "CapitalLeasesFutureMinimumPaymentsDueThereafter": {
        "description": "Amount of minimum lease payments for capital leases due after the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "CashAndCashEquivalentsAtCarryingValue": {
        "description": "Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal group and discontinued operation."
    },
    "CashAndCashEquivalentsFairValueDisclosure": {
        "description": "Fair value portion of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates."
    },
    "CashAndCashEquivalentsPeriodIncreaseDecrease": {
        "description": "Amount of increase (decrease) in cash and cash equivalents. Cash and cash equivalents are the amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Includes effect from exchange rate changes."
    },
    "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalents": {
        "description": "Amount of cash and cash equivalents, and cash and cash equivalents restricted to withdrawal or usage. Excludes amount for disposal group and discontinued operations. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates."
    },
    "CashCashEquivalentsRestrictedCashAndRestrictedCashEquivalentsPeriodIncreaseDecreaseIncludingExchangeRateEffect": {
        "description": "Amount of increase (decrease) in cash, cash equivalents, and cash and cash equivalents restricted to withdrawal or usage; including effect from exchange rate change. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates."
    },
    "CashProvidedByUsedInOperatingActivitiesDiscontinuedOperations": {
        "description": "Amount of cash inflow (outflow) of operating activities of discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."
    },
    "ChangeInUnrealizedGainLossOnHedgedItemInFairValueHedge": {
        "description": "The amount recognized in earnings related to the change in fair value during the period of the hedged item in a fair value hedge."
    },
    "ChangeInUnrealizedGainLossOnHedgedItemInFairValueHedge1": {
        "description": "Amount of the increase (decrease) in fair value of the hedged item in a fair value hedge recognized in the income statement."
    },
    "CollateralAlreadyPostedAggregateFairValue": {
        "description": "The aggregate fair value of assets that are already posted, at the end of the reporting period, as collateral for derivative instruments with credit-risk-related contingent features."
    },
    "CommercialPaper": {
        "description": "Carrying value as of the balance sheet date of short-term borrowings using unsecured obligations issued by banks, corporations and other borrowers to investors. The maturities of these money market securities generally do not exceed 270 days."
    },
    "CommonStockDividendsPerShareCashPaid": {
        "description": "Aggregate dividends paid during the period for each share of common stock outstanding."
    },
    "CommonStockDividendsPerShareDeclared": {
        "description": "Aggregate dividends declared during the period for each share of common stock outstanding."
    },
    "CommonStockIncludingAdditionalPaidInCapital": {
        "description": "Aggregate of par value plus amounts in excess of par value or issuance value (in cases of no-par value stock) for common stock held by shareholders. Aggregate value for common stock issued and outstanding."
    },
    "CommonStockParOrStatedValuePerShare": {
        "description": "Face amount or stated value per share of common stock."
    },
    "CommonStockSharesAuthorized": {
        "description": "The maximum number of common shares permitted to be issued by an entity's charter and bylaws."
    },
    "CommonStockSharesIssued": {
        "description": "Total number of common shares of an entity that have been sold or granted to shareholders (includes common shares that were issued, repurchased and remain in the treasury). These shares represent capital invested by the firm's shareholders and owners, and may be all or only a portion of the number of shares authorized. Shares issued include shares outstanding and shares held in the treasury."
    },
    "CommonStockSharesOutstanding": {
        "description": "Number of shares of common stock outstanding. Common stock represent the ownership interest in a corporation."
    },
    "CommonStocksIncludingAdditionalPaidInCapital": {
        "description": "Amount of par value plus amounts in excess of par value or issuance value for common stock issued."
    },
    "ComprehensiveIncomeNetOfTax": {
        "description": "Amount after tax of increase (decrease) in equity from transactions and other events and circumstances from net income and other comprehensive income, attributable to parent entity. Excludes changes in equity resulting from investments by owners and distributions to owners."
    },
    "ComprehensiveIncomeNetOfTaxIncludingPortionAttributableToNoncontrollingInterest": {
        "description": "Amount after tax of increase (decrease) in equity from transactions and other events and circumstances from net income and other comprehensive income. Excludes changes in equity resulting from investments by owners and distributions to owners."
    },
    "ContractWithCustomerAssetNet": {
        "description": "Amount, after allowance for credit loss, of right to consideration in exchange for good or service transferred to customer when right is conditioned on something other than passage of time."
    },
    "ContractWithCustomerAssetNetCurrent": {
        "description": "Amount, after allowance for credit loss, of right to consideration in exchange for good or service transferred to customer when right is conditioned on something other than passage of time, classified as current."
    },
    "ContractWithCustomerLiabilityCurrent": {
        "description": "Amount of obligation to transfer good or service to customer for which consideration has been received or is receivable, classified as current."
    },
    "ContractWithCustomerLiabilityNoncurrent": {
        "description": "Amount of obligation to transfer good or service to customer for which consideration has been received or is receivable, classified as noncurrent."
    },
    "ContractWithCustomerLiabilityRevenueRecognized": {
        "description": "Amount of revenue recognized that was previously included in balance of obligation to transfer good or service to customer for which consideration from customer has been received or is due."
    },
    "ContractWithCustomerPerformanceObligationSatisfiedInPreviousPeriod": {
        "description": "Amount of revenue recognized from performance obligation satisfied or partially satisfied in previous reporting periods. Includes, but is not limited to, change in transaction price."
    },
    "CostMethodInvestments": {
        "description": "Amount, after adjustment, of cost-method investment. Adjustments include, but are not limited to, dividends received in excess of earnings after date of investment that are considered a return of investment and other than temporary impairments."
    },
    "CostOfGoodsSold": {
        "description": "Total costs related to goods produced and sold during the reporting period."
    },
    "CostOfGoodsSoldSalesTypeLease": {
        "description": "Cost of goods sold for sales-type financing lease."
    },
    "CostOfRevenue": {
        "description": "The aggregate cost of goods produced and sold and services rendered during the reporting period."
    },
    "CostOfServices": {
        "description": "Total costs related to services rendered by an entity during the reporting period."
    },
    "CumulativeEffectOfInitialAdoptionOfFIN48": {
        "description": "Cumulative net-of-tax effect of initial adoption of FIN 48 - Accounting for Uncertainty in Income Taxes on the opening balance of retained earnings. The cumulative-effect adjustment does not include items that would not be recognized in earnings, such as the effect of adopting this Interpretation on tax positions related to business combinations. The amount of that cumulative-effect adjustment is the difference between the net amount of assets and liabilities recognized in the statement of financial position prior to the application of this Interpretation and the net amount of assets and liabilities recognized as a result of applying the provisions of this Interpretation."
    },
    "CumulativeEffectOfNewAccountingPrincipleInPeriodOfAdoption": {
        "description": "Amount after tax of increase (decrease) to equity or (increase) decrease to net assets, resulting from the cumulative effect adjustment of a new accounting principle applied in the period of adoption."
    },
    "CurrentFederalTaxExpenseBenefit": {
        "description": "Amount of current federal tax expense (benefit) pertaining to income (loss) from continuing operations."
    },
    "CurrentForeignTaxExpenseBenefit": {
        "description": "Amount of current foreign income tax expense (benefit) pertaining to income (loss) from continuing operations."
    },
    "CurrentStateAndLocalTaxExpenseBenefit": {
        "description": "Amount of current state and local tax expense (benefit) pertaining to income (loss) from continuing operations."
    },
    "DebtCurrent": {
        "description": "Amount of short-term debt and current maturity of long-term debt and capital lease obligations due within one year or the normal operating cycle, if longer."
    },
    "DebtInstrumentCarryingAmount": {
        "description": "Amount, before unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but is not limited to, notes payable, bonds payable, commercial loans, mortgage loans, convertible debt, subordinated debt and other types of debt."
    },
    "DebtInstrumentUnamortizedDiscount": {
        "description": "Amount, after accumulated amortization, of debt discount."
    },
    "DebtSecuritiesAvailableForSaleAllowanceForCreditLossPeriodIncreaseDecrease": {
        "description": "Amount of increase (decrease) in allowance for credit loss of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale)."
    },
    "DebtSecuritiesAvailableForSaleExcludingAccruedInterestCurrent": {
        "description": null
    },
    "DebtSecuritiesAvailableForSaleRealizedGain": {
        "description": "Amount of realized gain on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale)."
    },
    "DebtSecuritiesAvailableForSaleRealizedLoss": {
        "description": "Amount of realized loss on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale)."
    },
    "DecreaseInUnrecognizedTaxBenefitsIsReasonablyPossible": {
        "description": "Amount of decrease reasonably possible in the next twelve months for the unrecognized tax benefit."
    },
    "DeferredCompensationLiabilityCurrent": {
        "description": "Aggregate carrying value as of the balance sheet date of the liabilities for all deferred compensation arrangements payable within one year (or the operating cycle, if longer). Represents currently earned compensation under compensation arrangements that is not actually paid until a later date."
    },
    "DeferredFederalIncomeTaxExpenseBenefit": {
        "description": "Amount of deferred federal income tax expense (benefit) pertaining to income (loss) from continuing operations."
    },
    "DeferredFinanceCostsNet": {
        "description": "Amount, after accumulated amortization, of debt issuance costs. Includes, but is not limited to, legal, accounting, underwriting, printing, and registration costs."
    },
    "DeferredForeignIncomeTaxExpenseBenefit": {
        "description": "Amount of deferred foreign income tax expense (benefit) pertaining to income (loss) from continuing operations."
    },
    "DeferredGainLossOnDiscontinuationOfInterestRateFairValueHedge": {
        "description": "Amount as of the balance sheet date of the unamortized adjustment to the carrying value of an interest-bearing hedged item made under an effective interest rate fair value hedge that is amortized upon discontinuation of the interest rate fair value hedge."
    },
    "DeferredIncomeTaxAssetsNet": {
        "description": "Amount, after allocation of valuation allowances and deferred tax liability, of deferred tax asset attributable to deductible differences and carryforwards, with jurisdictional netting."
    },
    "DeferredIncomeTaxExpenseBenefit": {
        "description": "Amount of deferred income tax expense (benefit) pertaining to income (loss) from continuing operations."
    },
    "DeferredIncomeTaxLiabilities": {
        "description": "Amount of deferred tax liability attributable to taxable temporary differences."
    },
    "DeferredIncomeTaxLiabilitiesNet": {
        "description": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences with jurisdictional netting."
    },
    "DeferredRevenueCurrent": {
        "description": "Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable, classified as current."
    },
    "DeferredRevenueNoncurrent": {
        "description": "Amount of deferred income and obligation to transfer product and service to customer for which consideration has been received or is receivable, classified as noncurrent."
    },
    "DeferredSetUpCostsNoncurrent": {
        "description": "Deferred incremental direct costs incurred typically at a contract's inception so that the company may be in a position to fulfill all contractual obligations of an arrangement. The costs are directly related to specified activities under the arrangement and are deferred in order to match revenue that will be recognized after one year from the balance sheet date (or one operating cycle if longer). Excludes start-up costs (such as one-time activities related to opening a new facility, introducing a new product or service, establishing business with a new class of customers, preopening costs, and organization costs), which are expensed as incurred."
    },
    "DeferredStateAndLocalIncomeTaxExpenseBenefit": {
        "description": "Amount of deferred state and local tax expense (benefit) pertaining to income (loss) from continuing operations."
    },
    "DeferredTaxAssetsDeferredIncome": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from deferred income."
    },
    "DeferredTaxAssetsGoodwillAndIntangibleAssets": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from intangible assets including goodwill."
    },
    "DeferredTaxAssetsGross": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards."
    },
    "DeferredTaxAssetsHedgingTransactions": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from hedging transactions."
    },
    "DeferredTaxAssetsInProcessResearchAndDevelopment": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from in-process research and development costs expensed in connection with a business combination."
    },
    "DeferredTaxAssetsNet": {
        "description": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards."
    },
    "DeferredTaxAssetsNetCurrent": {
        "description": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards classified as current."
    },
    "DeferredTaxAssetsNetNoncurrent": {
        "description": "Amount after allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences and carryforwards classified as noncurrent."
    },
    "DeferredTaxAssetsOperatingLossCarryforwards": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible operating loss carryforwards."
    },
    "DeferredTaxAssetsOther": {
        "description": "Amount, before allocation of valuation allowance, of deferred tax asset attributable to deductible temporary differences, classified as other."
    },
    "DeferredTaxAssetsPropertyPlantAndEquipment": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from property, plant, and equipment."
    },
    "DeferredTaxAssetsTaxCreditCarryforwards": {
        "description": "Amount, before allocation of a valuation allowances, of deferred tax assets attributable to deductible tax credit carryforwards including, but not limited to, research, foreign, general business, alternative minimum tax, and other deductible tax credit carryforwards."
    },
    "DeferredTaxAssetsTaxDeferredExpenseCompensationAndBenefitsPostretirementBenefits": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from postretirement benefits."
    },
    "DeferredTaxAssetsTaxDeferredExpenseCompensationAndBenefitsShareBasedCompensationCost": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from share-based compensation."
    },
    "DeferredTaxAssetsTaxDeferredExpenseReservesAndAccruals": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from reserves and accruals."
    },
    "DeferredTaxAssetsTaxDeferredExpenseReservesAndAccrualsAccruedLiabilities": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from accrued liabilities."
    },
    "DeferredTaxAssetsTaxDeferredExpenseReservesAndAccrualsRestructuringCharges": {
        "description": "Amount before allocation of valuation allowances of deferred tax asset attributable to deductible temporary differences from restructuring reserve."
    },
    "DeferredTaxAssetsValuationAllowance": {
        "description": "Amount of deferred tax assets for which it is more likely than not that a tax benefit will not be realized."
    },
    "DeferredTaxLiabilities": {
        "description": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences without jurisdictional netting."
    },
    "DeferredTaxLiabilitiesDeferredExpenseCapitalizedSoftware": {
        "description": "Amount of deferred tax liability attributable to taxable temporary differences from capitalized software."
    },
    "DeferredTaxLiabilitiesGoodwillAndIntangibleAssets": {
        "description": "Amount of deferred tax liability attributable to taxable temporary differences from intangible assets including goodwill."
    },
    "DeferredTaxLiabilitiesLeasingArrangements": {
        "description": "Amount of deferred tax liability attributable to taxable temporary differences from leasing arrangements."
    },
    "DeferredTaxLiabilitiesNoncurrent": {
        "description": "Amount, after deferred tax asset, of deferred tax liability attributable to taxable differences, with jurisdictional netting and classified as noncurrent."
    },
    "DeferredTaxLiabilitiesOther": {
        "description": "Amount of deferred tax liability attributable to taxable temporary differences classified as other."
    },
    "DeferredTaxLiabilitiesPropertyPlantAndEquipment": {
        "description": "Amount of deferred tax liability attributable to taxable temporary differences from property, plant, and equipment."
    },
    "DeferredTaxLiabilitiesUndistributedForeignEarnings": {
        "description": "Amount of deferred tax liability attributable to taxable temporary differences from undistributed earnings of subsidiary and other recognized entity not within country of domicile. Includes, but is not limited to, other basis differences."
    },
    "DefinedBenefitPlanAssetsForPlanBenefitsNoncurrent": {
        "description": "Amount of asset, recognized in statement of financial position, for overfunded defined benefit pension and other postretirement plans."
    },
    "DefinedBenefitPlanContributionsByEmployer": {
        "description": "Amount of contribution received by defined benefit plan from employer which increases plan assets."
    },
    "DefinedBenefitPlanExpectedFutureBenefitPaymentsFiveFiscalYearsThereafter": {
        "description": "Amount of benefit for defined benefit plan expected to be paid in five fiscal years after fifth fiscal year following current fiscal year."
    },
    "DefinedBenefitPlanExpectedFutureBenefitPaymentsNextTwelveMonths": {
        "description": "Amount of benefit for defined benefit plan expected to be paid in next fiscal year following current fiscal year."
    },
    "DefinedBenefitPlanExpectedFutureBenefitPaymentsYearFive": {
        "description": "Amount of benefit for defined benefit plan expected to be paid in fifth fiscal year following current fiscal year."
    },
    "DefinedBenefitPlanExpectedFutureBenefitPaymentsYearFour": {
        "description": "Amount of benefit for defined benefit plan expected to be paid in fourth fiscal year following current fiscal year."
    },
    "DefinedBenefitPlanExpectedFutureBenefitPaymentsYearThree": {
        "description": "Amount of benefit for defined benefit plan expected to be paid in third fiscal year following current fiscal year."
    },
    "DefinedBenefitPlanExpectedFutureBenefitPaymentsYearTwo": {
        "description": "Amount of benefit for defined benefit plan expected to be paid in second fiscal year following current fiscal year."
    },
    "DefinedBenefitPlanGrossPrescriptionDrugSubsidyReceiptsReceived": {
        "description": "Amount of the period's gross receipts received from the prescription drug subsidy, which is to be used in the roll forward of the accumulated postretirement benefit obligation of an applicable postretirement benefit plan."
    },
    "DefinedBenefitPlanNetPeriodicBenefitCost": {
        "description": "Amount of net periodic benefit cost (credit) for defined benefit plan."
    },
    "DefinedBenefitPlanPlansWithBenefitObligationsInExcessOfPlanAssetsAggregateBenefitObligation": {
        "description": "Amount of benefit obligation for defined benefit plan with benefit obligation in excess of plan assets."
    },
    "DefinedBenefitPlanPlansWithBenefitObligationsInExcessOfPlanAssetsAggregateFairValueOfPlanAssets": {
        "description": "Fair value of plan assets for defined benefit plan with benefit obligation in excess of plan assets."
    },
    "DefinedContributionPlanCostRecognized": {
        "description": "Amount of cost for defined contribution plan."
    },
    "DefinedContributionPlanEmployerDiscretionaryContributionAmount": {
        "description": "Amount of discretionary contributions made by an employer to a defined contribution plan."
    },
    "DepositsAssetsNoncurrent": {
        "description": "Carrying value of amounts transferred to third parties for security purposes that are expected to be returned or applied towards payment after one year or beyond the operating cycle, if longer."
    },
    "Depreciation": {
        "description": "The amount of expense recognized in the current period that reflects the allocation of the cost of tangible assets over the assets' useful lives. Includes production and non-production related depreciation."
    },
    "DerivativeAssetDesignatedAsHedgingInstrumentFairValue": {
        "description": "Fair value of a derivative asset (or nonderivative instrument) that is designated and qualifies as a hedging instrument, presented on a gross basis even when the derivative instrument is subject to master netting arrangements and qualifies for net presentation in the statement of financial position."
    },
    "DerivativeAssetFairValueGrossAssetIncludingNotSubjectToMasterNettingArrangement": {
        "description": "Fair value, before effects of master netting arrangements, of a financial asset or other contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset. Includes assets not subject to a master netting arrangement and elected not to be offset."
    },
    "DerivativeAssetFairValueNet": {
        "description": "Fair value of the gross assets less the gross liabilities of a derivative asset or group of derivative assets."
    },
    "DerivativeAssetNotDesignatedAsHedgingInstrumentFairValue": {
        "description": "Fair value of a derivative asset that is not designated or qualifying as a hedging instrument, presented on a gross basis even when the derivative instrument is subject to master netting arrangements and qualifies for net presentation in the statement of financial position."
    },
    "DerivativeAssetNotOffsetPolicyElectionDeduction": {
        "description": "Fair value of financial asset or other contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset, elected not to be offset, deducted from derivative assets."
    },
    "DerivativeAssets": {
        "description": "Fair value, after the effects of master netting arrangements, of a financial asset or other contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset. Includes assets not subject to a master netting arrangement and not elected to be offset."
    },
    "DerivativeAssetsNoncurrent": {
        "description": "Fair value, after the effects of master netting arrangements, of a financial asset or other contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset, expected to be settled after one year or the normal operating cycle, if longer. Includes assets not subject to a master netting arrangement and not elected to be offset."
    },
    "DerivativeCollateralObligationToReturnCash": {
        "description": "Amount of obligation to return cash collateral under master netting arrangements that have not been offset against derivative assets."
    },
    "DerivativeCollateralObligationToReturnSecurities": {
        "description": "Amount of obligation to return securities collateral under master netting arrangements that have not been offset against derivative assets."
    },
    "DerivativeCollateralRightToReclaimCash": {
        "description": "Amount of right to receive cash collateral under master netting arrangements that have not been offset against derivative liabilities."
    },
    "DerivativeFairValueOfDerivativeAsset": {
        "description": "Fair value, before effects of master netting arrangements, of a financial asset or other contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset. Includes assets elected not to be offset. Excludes assets not subject to a master netting arrangement."
    },
    "DerivativeFairValueOfDerivativeAssetAmountNotOffsetAgainstCollateral": {
        "description": "Fair value, after offset of derivative liability, of financial asset or other contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset, before offset against an obligation to return collateral under a master netting arrangement. Includes assets elected not to be offset. Excludes assets not subject to a master netting arrangement."
    },
    "DerivativeFairValueOfDerivativeLiability": {
        "description": "Fair value, before effects of master netting arrangements, of a financial liability or contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset. Includes liabilities elected not to be offset. Excludes liabilities not subject to a master netting arrangement."
    },
    "DerivativeFairValueOfDerivativeLiabilityAmountNotOffsetAgainstCollateral": {
        "description": "Fair value, after offset of derivative asset, of financial liability or contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset, elected not to be and before offset against a right to receive collateral under a master netting arrangement. Includes liabilities elected not to be offset. Excludes liabilities not subject to a master netting arrangement."
    },
    "DerivativeGainLossOnDerivativeNet": {
        "description": "Amount of increase (decrease) in the fair value of derivatives recognized in the income statement."
    },
    "DerivativeInstrumentsGainLossReclassifiedFromAccumulatedOCIIntoIncomeEffectivePortionNet": {
        "description": "The effective portion of net gain (loss) reclassified from accumulated other comprehensive income into income on derivative instruments designated and qualifying as hedging instruments."
    },
    "DerivativeInstrumentsGainLossRecognizedInIncomeIneffectivePortionAndAmountExcludedFromEffectivenessTestingNet": {
        "description": "The portion of gains and losses (net) on derivative instruments designated and qualifying as hedging instruments representing (a) the amount of the hedge ineffectiveness and (b) the amount, if any, excluded from the assessment of hedge effectiveness."
    },
    "DerivativeInstrumentsGainLossRecognizedInIncomeNet": {
        "description": "The amount of net gains and losses recognized in income during the period on derivative instruments designated and qualifying as hedging instruments in fair value hedges and related hedged items designated and qualifying in fair value hedges, on derivative instruments designated and qualifying as hedging instruments in cash flow hedges, and on derivative instruments not designated as hedging instruments."
    },
    "DerivativeInstrumentsGainLossRecognizedInOtherComprehensiveIncomeEffectivePortionNet": {
        "description": "The effective portion of gains and losses (net) on derivative instruments designated and qualifying as hedging instruments that was recognized in other comprehensive income during the current period."
    },
    "DerivativeLiabilities": {
        "description": "Fair value, after the effects of master netting arrangements, of a financial liability or contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset. Includes liabilities not subject to a master netting arrangement and not elected to be offset."
    },
    "DerivativeLiabilitiesNoncurrent": {
        "description": "Fair value, after the effects of master netting arrangements, of a financial liability or contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset, expected to be settled after one year or the normal operating cycle, if longer. Includes assets not subject to a master netting arrangement and not elected to be offset."
    },
    "DerivativeLiabilityDesignatedAsHedgingInstrumentFairValue": {
        "description": "Fair value of a derivative liability (or nonderivative instrument) that is designated and qualifies as a hedging instrument, presented on a gross basis even when the derivative instrument is subject to master netting arrangements and qualifies for net presentation in the statement of financial position."
    },
    "DerivativeLiabilityFairValueGrossAsset": {
        "description": "Fair value of asset associated with financial liability or contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset."
    },
    "DerivativeLiabilityFairValueGrossLiabilityIncludingNotSubjectToMasterNettingArrangement": {
        "description": "Fair value, before effects of master netting arrangements, of a financial liability or contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset. Includes liabilities not subject to a master netting arrangement and elected not to be offset."
    },
    "DerivativeLiabilityFairValueNet1": {
        "description": "Fair value of the gross liabilities less the gross assets of a derivative liability or group of derivative liabilities."
    },
    "DerivativeLiabilityNotDesignatedAsHedgingInstrumentFairValue": {
        "description": "Fair value of a derivative liability that is not designated or qualifying as a hedging instrument, presented on a gross basis even when the derivative instrument is subject to master netting arrangements and qualifies for net presentation in the statement of financial position."
    },
    "DerivativeLiabilityNotOffsetPolicyElectionDeduction": {
        "description": "Fair value of financial liability or contract with one or more underlyings, notional amount or payment provision or both, and the contract can be net settled by means outside the contract or delivery of an asset, elected not to be offset, deducted from derivative liabilities."
    },
    "DerivativeNetLiabilityPositionAggregateFairValue": {
        "description": "The aggregate fair value amounts of derivative instruments that contain credit-risk-related contingent features that are in a net liability position at the end of the reporting period. For nonderivative instruments that are designated and qualify as hedging instruments, the fair value amounts are the carrying value of the nonderivative hedging instrument, including the adjustment for the foreign currency transaction gain (loss) on that instrument."
    },
    "DilutiveSecurities": {
        "description": "Amount of increase (decrease) to net income used for calculating diluted earnings per share (EPS), resulting from the assumed exercise stock options, restrictive stock units (RSUs), convertible preferred stock of an employee stock ownership plan (ESOP), and other dilutive convertible securities."
    },
    "DiscontinuedOperationGainLossOnDisposalOfDiscontinuedOperationNetOfTax": {
        "description": "Amount after tax of gain (loss) not previously recognized resulting from the disposal of a discontinued operation."
    },
    "DiscontinuedOperationTaxEffectOfDiscontinuedOperation": {
        "description": "Amount of tax expense (benefit) related to a discontinued operation. Includes, but is not limited to, tax expense (benefit) related to income (loss) from operations during the phase-out period, tax expense (benefit) related to gain (loss) on disposal, tax expense (benefit) related to gain (loss) for reversal of write-down (write-down) to fair value, less cost to sell, and tax expense (benefit) related to adjustments of a prior period gain (loss) on disposal."
    },
    "DisposalGroupIncludingDiscontinuedOperationOperatingIncomeLoss": {
        "description": "Amount of operating income (loss) attributable to disposal group, including, but not limited to, discontinued operation."
    },
    "DividendsCommonStockCash": {
        "description": "Amount of paid and unpaid common stock dividends declared with the form of settlement in cash."
    },
    "EarningsPerShareBasic": {
        "description": "The amount of net income (loss) for the period per each share of common stock or unit outstanding during the reporting period."
    },
    "EarningsPerShareDiluted": {
        "description": "The amount of net income (loss) for the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period."
    },
    "EffectiveIncomeTaxRateContinuingOperations": {
        "description": "Percentage of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations."
    },
    "EffectiveIncomeTaxRateReconciliationAtFederalStatutoryIncomeTaxRate": {
        "description": "Percentage of domestic federal statutory tax rate applicable to pretax income (loss)."
    },
    "EffectiveIncomeTaxRateReconciliationChangeInDeferredTaxAssetsValuationAllowance": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to changes in the valuation allowance for deferred tax assets."
    },
    "EffectiveIncomeTaxRateReconciliationChangeInEnactedTaxRate": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to changes in the income tax rates."
    },
    "EffectiveIncomeTaxRateReconciliationDispositionOfAssets": {
        "description": "Percentage of difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying domestic federal statutory income tax rate to pretax income (loss) from continuing operations, attributable to disposition of asset. Includes, but is not limited to, intra-entity transfer of asset other than inventory."
    },
    "EffectiveIncomeTaxRateReconciliationDispositionOfBusiness": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to disposition of a business not qualifying as a discontinued operation."
    },
    "EffectiveIncomeTaxRateReconciliationForeignIncomeTaxRateDifferential": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations applicable to statutory income tax expense (benefit) outside of the country of domicile."
    },
    "EffectiveIncomeTaxRateReconciliationOtherAdjustments": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to other adjustments."
    },
    "EffectiveIncomeTaxRateReconciliationStateAndLocalIncomeTaxes": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations applicable to state and local income tax expense (benefit), net of federal tax expense (benefit)."
    },
    "EffectiveIncomeTaxRateReconciliationTaxCreditsForeign": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to foreign tax credit."
    },
    "EffectiveIncomeTaxRateReconciliationTaxCreditsOther": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to other tax credits."
    },
    "EffectiveIncomeTaxRateReconciliationTaxSettlementsDomestic": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to domestic income tax settlement."
    },
    "EffectiveIncomeTaxRateReconciliationTaxSettlementsForeign": {
        "description": "Percentage of the difference between reported income tax expense (benefit) and expected income tax expense (benefit) computed by applying the domestic federal statutory income tax rates to pretax income (loss) from continuing operations attributable to foreign income tax settlement."
    },
    "EffectOfExchangeRateOnCashAndCashEquivalents": {
        "description": "Amount of increase (decrease) from the effect of exchange rate changes on cash and cash equivalent balances held in foreign currencies."
    },
    "EffectOfExchangeRateOnCashAndCashEquivalentsContinuingOperations": {
        "description": "The effect of exchange rate changes on cash balances in continuing operations held in foreign currencies."
    },
    "EffectOfExchangeRateOnCashCashEquivalentsRestrictedCashAndRestrictedCashEquivalents": {
        "description": "Amount of increase (decrease) from effect of exchange rate changes on cash and cash equivalents, and cash and cash equivalents restricted to withdrawal or usage; held in foreign currencies. Excludes amounts for disposal group and discontinued operations. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits. Cash equivalents include, but are not limited to, short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates."
    },
    "EmployeeRelatedLiabilitiesCurrent": {
        "description": "Total of the carrying values as of the balance sheet date of obligations incurred through that date and payable for obligations related to services received from employees, such as accrued salaries and bonuses, payroll taxes and fringe benefits. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."
    },
    "EmployeeServiceShareBasedCompensationAllocationOfRecognizedPeriodCostsCapitalizedAmount": {
        "description": "Amount of cost capitalized for award under share-based payment arrangement."
    },
    "EmployeeServiceShareBasedCompensationCashReceivedFromExerciseOfStockOptions": {
        "description": "Aggregate proceeds received by the entity during the annual period from exercises of stock or unit options and conversion of similar instruments granted under equity-based payment arrangements."
    },
    "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognized": {
        "description": "Amount of cost not yet recognized for nonvested award under share-based payment arrangement."
    },
    "EmployeeServiceShareBasedCompensationNonvestedAwardsTotalCompensationCostNotYetRecognizedPeriodForRecognition": {
        "description": "The weighted average period over which unrecognized compensation is expected to be recognized for equity-based compensation plans, using a decimal to express in number of years."
    },
    "EmployeeServiceShareBasedCompensationTaxBenefitFromCompensationExpense": {
        "description": "Amount of tax benefit for recognition of expense of award under share-based payment arrangement."
    },
    "EmployeeServiceShareBasedCompensationTaxBenefitRealizedFromExerciseOfStockOptions": {
        "description": "Disclosure of the aggregate tax benefit realized from the exercise of stock options and the conversion of similar instruments during the annual period."
    },
    "EmployeeServiceShareBasedCompensationUnrecognizedCompensationCostsOnNonvestedAwards": {
        "description": "As of the latest balance sheet date presented, the total compensation cost related to outstanding, nonvested equity-based compensation awards not yet recognized (will be charged against earnings as services are performed or other vesting criteria are met)."
    },
    "EmployeeServiceShareBasedCompensationUnrecognizedCompensationCostsOnNonvestedAwardsWeightedAveragePeriodOfRecognition": {
        "description": "The weighted average period over which unrecognized equity-based compensation costs are expected to be reported."
    },
    "EquityMethodInvestmentOtherThanTemporaryImpairment": {
        "description": "This item represents an other than temporary decline in value that has been recognized against an investment accounted for under the equity method of accounting. The excess of the carrying amount over the fair value of the investment represents the amount of the write down which is or was reflected in earnings. The written down value is a new cost basis with the adjusted value of the investment becoming its new carrying value subject to the equity accounting method. Evidence of a loss in value might include, but would not necessarily be limited to, absence of an ability to recover the carrying amount of the investment or inability of the investee to sustain an earnings capacity which would justify the carrying amount of the investment."
    },
    "EquityMethodInvestments": {
        "description": "This item represents the carrying amount on the entity's balance sheet of its investment in common stock of an equity method investee. This is not an indicator of the fair value of the investment, rather it is the initial cost adjusted for the entity's share of earnings and losses of the investee, adjusted for any distributions (dividends) and other than temporary impairment (OTTI) losses recognized."
    },
    "EquitySecuritiesWithoutReadilyDeterminableFairValueAmount": {
        "description": "Amount of investment in equity security without readily determinable fair value."
    },
    "FairValueAssetsLevel1ToLevel2TransfersAmount": {
        "description": "Amount of transfers of assets measured on a recurring basis out of Level 1 of the fair value hierarchy into Level 2."
    },
    "FairValueAssetsLevel2ToLevel1TransfersAmount": {
        "description": "Amount of transfers of assets measured on a recurring basis out of Level 2 of the fair value hierarchy into Level 1."
    },
    "FairValueAssetsMeasuredOnRecurringBasisCashAndCashEquivalents": {
        "description": "This element represents a certain statement of financial position asset caption which represents a class of assets, or which may include an individual asset, measured at fair value on a recurring basis."
    },
    "FairValueLiabilitiesLevel1ToLevel2TransfersAmount": {
        "description": "Amount of transfers of liabilities measured on a recurring basis out of Level 1 of the fair value hierarchy into Level 2."
    },
    "FairValueLiabilitiesLevel2ToLevel1TransfersAmount": {
        "description": "Amount of transfers of liabilities measured on a recurring basis out of Level 2 of the fair value hierarchy into Level 1."
    },
    "FederalIncomeTaxExpenseBenefitContinuingOperations": {
        "description": "Amount of current and deferred federal income tax expense (benefit) attributable to income (loss) from continuing operations."
    },
    "FinanceLeaseInterestExpense": {
        "description": "Amount of interest expense on finance lease liability."
    },
    "FinanceLeaseInterestPaymentOnLiability": {
        "description": "Amount of interest paid on finance lease liability."
    },
    "FinanceLeaseLiability": {
        "description": "Present value of lessee's discounted obligation for lease payments from finance lease."
    },
    "FinanceLeaseLiabilityPaymentsDueAfterYearFive": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FinanceLeaseLiabilityPaymentsDueNextTwelveMonths": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FinanceLeaseLiabilityPaymentsDueYearFive": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FinanceLeaseLiabilityPaymentsDueYearFour": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FinanceLeaseLiabilityPaymentsDueYearThree": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FinanceLeaseLiabilityPaymentsDueYearTwo": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FinanceLeaseLiabilityPaymentsRemainderOfFiscalYear": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for finance lease to be paid in remainder of current fiscal year."
    },
    "FinanceLeaseLiabilityUndiscountedExcessAmount": {
        "description": "Amount of lessee's undiscounted obligation for lease payments in excess of discounted obligation for lease payments for finance lease."
    },
    "FinanceLeasePrincipalPayments": {
        "description": "Amount of cash outflow for principal payment on finance lease."
    },
    "FinanceLeaseRightOfUseAsset": {
        "description": "Amount, after accumulated amortization, of right-of-use asset from finance lease."
    },
    "FinanceLeaseRightOfUseAssetAmortization": {
        "description": "Amount of amortization expense attributable to right-of-use asset from finance lease."
    },
    "FinanceLeaseWeightedAverageDiscountRatePercent": {
        "description": "Weighted average discount rate for finance lease calculated at point in time."
    },
    "FinancialLiabilitiesFairValueDisclosure": {
        "description": "Fair value of financial obligations, including, but not limited to, debt instruments, derivative liabilities, federal funds purchased and sold under agreements to repurchase, securities loaned or sold under agreements to repurchase, financial instruments sold not yet purchased, guarantees, line of credit, loans and notes payable, servicing liability, and trading liabilities."
    },
    "FinancialServicesCosts": {
        "description": "The aggregate costs incurred during the reporting period related to financial services rendered by an entity."
    },
    "FinancialServicesRevenue": {
        "description": "The aggregate financial services revenue and operating interest income earned during the reporting period."
    },
    "FinancingReceivableAllowanceForCreditLosses": {
        "description": "Amount of allowance for credit loss on financing receivable. Excludes allowance for financing receivable covered under loss sharing agreement."
    },
    "FinancingReceivableAllowanceForCreditLossesCollectivelyEvaluatedForImpairment": {
        "description": "The valuation allowance for financing receivables that are expected to be uncollectible that were collectively evaluated for impairment."
    },
    "FinancingReceivableAllowanceForCreditLossesIndividuallyEvaluatedForImpairment": {
        "description": "The valuation allowance for financing receivables that are expected to be uncollectible that were individually evaluated for impairment."
    },
    "FinancingReceivableAllowanceForCreditLossesIndividuallyEvaluatedForImpairment1": {
        "description": "Amount of valuation allowance for financing receivables that are expected to be uncollectible that were individually evaluated for impairment."
    },
    "FinancingReceivableAllowanceForCreditLossesProvisions": {
        "description": "Charge to expense for financing receivables that are expected to be uncollectible."
    },
    "FinancingReceivableAllowanceForCreditLossesWriteOffs": {
        "description": "Amount of writeoff of financing receivable, charged against allowance for credit loss."
    },
    "FinancingReceivableCollectivelyEvaluatedForImpairment": {
        "description": "The balance of financing receivables that were collectively evaluated for impairment."
    },
    "FinancingReceivableIndividuallyEvaluatedForImpairment": {
        "description": "The balance of financing receivables that were individually evaluated for impairment."
    },
    "FinancingReceivableModificationsRecordedInvestment": {
        "description": "Amount of financing receivable modified as troubled debt restructuring."
    },
    "FinancingReceivableRecordedInvestment90DaysPastDueAndStillAccruing": {
        "description": "Amount of financing receivable 90 days or more past due and still accruing."
    },
    "FinancingReceivableRecordedInvestmentCurrent": {
        "description": "Amount of financing receivable not past due."
    },
    "FinancingReceivableRecordedInvestmentEqualToGreaterThan90DaysPastDue": {
        "description": "Financing receivables that are equal to or greater than 90 days past due."
    },
    "FinancingReceivableRecordedInvestmentNonaccrualStatus": {
        "description": "Amount of financing receivable on nonaccrual status."
    },
    "FinancingReceivableSignificantSales": {
        "description": "Amount of decrease from sale and reclassification to held-for-sale of financing receivable."
    },
    "FiniteLivedIntangibleAssetsAccumulatedAmortization": {
        "description": "Accumulated amount of amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpense": {
        "description": "Aggregate amount of intangible asset amortization recognized as expense during the period."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpenseAfterYearFive": {
        "description": "Amount of amortization for asset, excluding financial asset and goodwill, lacking physical substance with finite life expected to be recognized after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpenseNextTwelveMonths": {
        "description": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpenseRemainderOfFiscalYear": {
        "description": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in remainder of current fiscal year."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearFive": {
        "description": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearFour": {
        "description": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearThree": {
        "description": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FiniteLivedIntangibleAssetsAmortizationExpenseYearTwo": {
        "description": "Amount of amortization for assets, excluding financial assets and goodwill, lacking physical substance with finite life expected to be recognized in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "FiniteLivedIntangibleAssetsForeignCurrencyTranslationGainLoss": {
        "description": "Amount of foreign currency translation gain (loss) which increases (decreases) assets, excluding financial assets and goodwill, lacking physical substance with a finite life."
    },
    "FiniteLivedIntangibleAssetsGross": {
        "description": "Amount before amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life."
    },
    "FiniteLivedIntangibleAssetsNet": {
        "description": "Amount after amortization of assets, excluding financial assets and goodwill, lacking physical substance with a finite life."
    },
    "FiniteLivedIntangibleAssetsPeriodIncreaseDecrease": {
        "description": "Amount of increase (decrease) in carrying value of assets, excluding financial assets and goodwill, lacking physical substance with a finite life."
    },
    "ForeignIncomeTaxExpenseBenefitContinuingOperations": {
        "description": "Amount of current and deferred foreign income tax expense (benefit) attributable to income (loss) from continuing operations."
    },
    "FutureAmortizationExpenseRemainderOfFiscalYear": {
        "description": "The amount of amortization expense expected to be recognized during the remainder of the current fiscal year."
    },
    "FutureAmortizationExpenseYearFive": {
        "description": "The amount of amortization expense expected to be recognized during year five of the five succeeding fiscal years."
    },
    "FutureAmortizationExpenseYearFour": {
        "description": "The amount of amortization expense expected to be recognized during year four of the five succeeding fiscal years."
    },
    "FutureAmortizationExpenseYearOne": {
        "description": "The amount of amortization expense expected to be recognized during year one of the five succeeding fiscal years."
    },
    "FutureAmortizationExpenseYearThree": {
        "description": "The amount of amortization expense expected to be recognized during year three of the five succeeding fiscal years."
    },
    "FutureAmortizationExpenseYearTwo": {
        "description": "The amount of amortization expense expected to be recognized during year two of the five succeeding fiscal years."
    },
    "FutureMinimumSubleaseRentalsSaleLeasebackTransactionsThereafter": {
        "description": "Amount of minimum sublease rentals for sale-leaseback transactions accounted for using the deposit method or as a financing to be received by the seller-lessee after the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "FutureMinimumSubleaseRentalsSaleLeasebackTransactionsWithinFiveYears": {
        "description": "Amount of minimum sublease rentals for sale-leaseback transactions accounted for using the deposit method or as a financing to be received by the seller-lessee in the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "FutureMinimumSubleaseRentalsSaleLeasebackTransactionsWithinFourYears": {
        "description": "Amount of minimum sublease rentals for sale-leaseback transactions accounted for using the deposit method or as a financing to be received by the seller-lessee in the fourth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "FutureMinimumSubleaseRentalsSaleLeasebackTransactionsWithinOneYear": {
        "description": "Amount of minimum sublease rentals for sale-leaseback transactions accounted for using the deposit method or as a financing to be received by the seller-lessee in the next fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "FutureMinimumSubleaseRentalsSaleLeasebackTransactionsWithinThreeYears": {
        "description": "Amount of minimum sublease rentals for sale-leaseback transactions accounted for using the deposit method or as a financing to be received by the seller-lessee in the third fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "FutureMinimumSubleaseRentalsSaleLeasebackTransactionsWithinTwoYears": {
        "description": "Amount of minimum sublease rentals for sale-leaseback transactions accounted for using the deposit method or as a financing to be received by the seller-lessee in the second fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "GainLossFromComponentsExcludedFromAssessmentOfFairValueHedgeEffectivenessNet": {
        "description": "Net gain (loss) relating to components of the gain (loss) on the fair value hedging instrument excluded from the assessment of fair value hedge effectiveness. Recognized in earnings."
    },
    "GainLossOnDerivativeInstrumentsNetPretax": {
        "description": "Aggregate net gain (loss) on all derivative instruments recognized in earnings during the period, before tax effects."
    },
    "GainLossOnDiscontinuationOfCashFlowHedgeDueToForecastedTransactionProbableOfNotOccurringNet": {
        "description": "The amount of net gain (loss) reclassified into earnings in the period when cash flow hedge is discontinued because it is probable that the original forecasted transactions will not occur by the end of the original period or an additional two month time period."
    },
    "GainLossOnFairValueHedgeIneffectivenessNet": {
        "description": "Amount of gain (loss)recognized in the income statement from the hedging ineffectiveness of a fair value hedge."
    },
    "GainLossOnSaleOfBusiness": {
        "description": "Amount of gain (loss) from sale and disposal of integrated set of activities and assets capable of being conducted and managed for purpose of providing return in form of dividend, lower cost, or other economic benefit to investor, owner, member and participant."
    },
    "GainLossOnSaleOfOtherAssets": {
        "description": "Amount of gain (loss) on sale or disposal of other assets."
    },
    "GainOnFairValueHedgeIneffectiveness": {
        "description": "Amount of gain recognized in the income statement from the hedging ineffectiveness of a fair value hedge."
    },
    "Goodwill": {
        "description": "Amount after accumulated impairment loss of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GoodwillAcquiredDuringPeriod": {
        "description": "Amount of increase in asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized resulting from a business combination."
    },
    "GoodwillAllocationAdjustment": {
        "description": "Purchase price allocation adjustment for allocation not yet complete at the prior year end."
    },
    "GoodwillForeignCurrencyTranslationGainLoss": {
        "description": "Amount of foreign currency translation gain (loss) which increases (decreases) an asset representing future economic benefits from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GoodwillImpairedAccumulatedImpairmentLoss": {
        "description": "Amount of accumulated impairment loss for an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GoodwillImpairmentLoss": {
        "description": "Amount of loss from the write-down of an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GoodwillPurchaseAccountingAdjustments": {
        "description": "Amount of increase (decrease) from adjustments after acquisition date under purchase accounting of an asset representing the future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GoodwillTranslationAdjustments": {
        "description": "Amount of increase (decrease) from foreign currency translation adjustments of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GoodwillTranslationAndPurchaseAccountingAdjustments": {
        "description": "Amount of increase (decrease) from foreign currency translation adjustments and purchase accounting adjustments of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GoodwillWrittenOffRelatedToSaleOfBusinessUnit": {
        "description": "Amount of divestiture of an asset representing future economic benefits arising from other assets acquired in a business combination that are not individually identified and separately recognized."
    },
    "GrossProfit": {
        "description": "Aggregate revenue less cost of goods and services sold or operating expenses directly attributable to the revenue generation activity."
    },
    "ImpairedFinancingReceivableAverageRecordedInvestment": {
        "description": "Average amount of investment of impaired financing receivables with related allowance for credit losses and without a related allowance for credit losses."
    },
    "ImpairedFinancingReceivableInterestIncomeAccrualMethod": {
        "description": "Amount of interest income recognized that the financing receivables (with related allowance for credit losses and without a related allowance for credit losses) were impaired."
    },
    "ImpairedFinancingReceivableInterestIncomeCashBasisMethod": {
        "description": "Amount of interest income recognized on a cash-basis method of accounting that the financing receivables (with related allowance for credit losses and without a related allowance for credit losses) were impaired."
    },
    "ImpairedFinancingReceivableRecordedInvestment": {
        "description": "Amount of investment of impaired financing receivables with related allowance for credit losses and without a related allowance for credit losses."
    },
    "ImpairedFinancingReceivableRelatedAllowance": {
        "description": "Amount of allowance for credit losses related to recorded investment."
    },
    "ImpairmentOfIntangibleAssetsExcludingGoodwill": {
        "description": "The amount of impairment loss recognized in the period resulting from the write-down of the carrying amount of an intangible asset (excluding goodwill) to fair value."
    },
    "ImpairmentOfIntangibleAssetsFinitelived": {
        "description": "The amount of impairment loss recognized in the period resulting from the write-down of the carrying amount of a finite-lived intangible asset to fair value."
    },
    "ImpairmentOfLongLivedAssetsHeldForUse": {
        "description": "The aggregate amount of write-downs for impairments recognized during the period for long lived assets held for use (including those held for disposal by means other than sale)."
    },
    "IncomeLossFromContinuingOperations": {
        "description": "Amount after tax of income (loss) from continuing operations attributable to the parent."
    },
    "IncomeLossFromContinuingOperationsBeforeIncomeTaxesDomestic": {
        "description": "The portion of earnings or loss from continuing operations before income taxes that is attributable to domestic operations."
    },
    "IncomeLossFromContinuingOperationsBeforeIncomeTaxesExtraordinaryItemsNoncontrollingInterest": {
        "description": "Amount of income (loss) from continuing operations, including income (loss) from equity method investments, before deduction of income tax expense (benefit), and income (loss) attributable to noncontrolling interest."
    },
    "IncomeLossFromContinuingOperationsBeforeIncomeTaxesForeign": {
        "description": "The portion of earnings or loss from continuing operations before income taxes that is attributable to foreign operations, which is defined as Income or Loss generated from operations located outside the entity's country of domicile."
    },
    "IncomeLossFromContinuingOperationsBeforeIncomeTaxesMinorityInterestAndIncomeLossFromEquityMethodInvestments": {
        "description": "Amount of income (loss) from continuing operations before deduction of income tax expense (benefit) and income (loss) attributable to noncontrolling interest, and addition of income (loss) from equity method investments."
    },
    "IncomeLossFromContinuingOperationsIncludingPortionAttributableToNoncontrollingInterest": {
        "description": "Amount after tax of income (loss) from continuing operations including portion attributable to the noncontrolling interest."
    },
    "IncomeLossFromContinuingOperationsPerBasicShare": {
        "description": "The amount of net income (loss) from continuing operations per each share of common stock or unit outstanding during the reporting period."
    },
    "IncomeLossFromContinuingOperationsPerDilutedShare": {
        "description": "The amount of net income (loss) derived from continuing operations during the period available to each share of common stock or common unit outstanding during the reporting period and to each share or unit that would have been outstanding assuming the issuance of common shares or units for all dilutive potential common shares or units outstanding during the reporting period."
    },
    "IncomeLossFromDiscontinuedOperationsNetOfTax": {
        "description": "Amount after tax of income (loss) from a discontinued operation including the portion attributable to the noncontrolling interest. Includes, but is not limited to, the income (loss) from operations during the phase-out period, gain (loss) on disposal, gain (loss) for reversal of write-down (write-down) to fair value, less cost to sell, and adjustments to a prior period gain (loss) on disposal."
    },
    "IncomeLossFromDiscontinuedOperationsNetOfTaxAttributableToReportingEntity": {
        "description": "Amount after tax of income (loss) from a discontinued operation attributable to the parent. Includes, but is not limited to, the income (loss) from operations during the phase-out period, gain (loss) on disposal, gain (loss) for reversal of write-down (write-down) to fair value, less cost to sell, and adjustments to a prior period gain (loss) on disposal."
    },
    "IncomeLossFromDiscontinuedOperationsNetOfTaxPerBasicShare": {
        "description": "Per basic share amount, after tax, of income (loss) from the day-to-day business activities of the discontinued operation and gain (loss) from the disposal of the discontinued operation."
    },
    "IncomeLossFromDiscontinuedOperationsNetOfTaxPerDilutedShare": {
        "description": "Per diluted share amount, after tax, of income (loss) from the day-to-day business activities of the discontinued operation and gain (loss) from the disposal of the discontinued operation."
    },
    "IncomeTaxEffectsAllocatedDirectlyToEquityCumulativeEffectOfChangeInAccountingPrinciple": {
        "description": "Amount of cumulative tax effect on beginning retained earnings from change in accounting principle."
    },
    "IncomeTaxExaminationRangeOfPossibleLosses": {
        "description": "The estimated range of reasonably possible losses resulting from an adverse position taken by a taxing authority."
    },
    "IncomeTaxExpenseBenefit": {
        "description": "Amount of current income tax expense (benefit) and deferred income tax expense (benefit) pertaining to continuing operations."
    },
    "IncomeTaxesPaidNet": {
        "description": "The amount of cash paid during the current period to foreign, federal, state, and local authorities as taxes on income, net of any cash received during the current period as refunds for the overpayment of taxes."
    },
    "IncomeTaxesReceivableNoncurrent": {
        "description": "Carrying amount due after one year of the balance sheet date (or one operating cycle, if longer) from tax authorities as of the balance sheet date representing refunds of overpayments or recoveries based on agreed-upon resolutions of disputes."
    },
    "IncreaseDecreaseInAccountsPayable": {
        "description": "The increase (decrease) during the reporting period in the aggregate amount of liabilities incurred (and for which invoices have typically been received) and payable to vendors for goods and services received that are used in an entity's business."
    },
    "IncreaseDecreaseInInventories": {
        "description": "The increase (decrease) during the reporting period in the aggregate value of all inventory held by the reporting entity, associated with underlying transactions that are classified as operating activities."
    },
    "IncreaseDecreaseInOperatingCapital": {
        "description": "The increase (decrease) during the reporting period of all assets and liabilities used in operating activities."
    },
    "IncreaseDecreaseInOtherOperatingCapitalNet": {
        "description": "Amount of increase (decrease) in operating assets after deduction of operating liabilities classified as other."
    },
    "IncreaseDecreaseInReceivables": {
        "description": "The increase (decrease) during the reporting period in the total amount due within one year (or one operating cycle) from all parties, associated with underlying transactions that are classified as operating activities."
    },
    "IncrementalCommonSharesAttributableToContingentlyIssuableShares": {
        "description": "Additional shares included in the calculation of diluted EPS as a result of the potentially dilutive effect of contingently issuable shares. Contingently issuable shares are those shares that are issuable for little or no cash contingent on certain conditions being met."
    },
    "IncrementalCommonSharesAttributableToShareBasedPaymentArrangements": {
        "description": "Additional shares included in the calculation of diluted EPS as a result of the potentially dilutive effect of share based payment arrangements using the treasury stock method."
    },
    "IntangibleAssetsNetExcludingGoodwill": {
        "description": "Sum of the carrying amounts of all intangible assets, excluding goodwill, as of the balance sheet date, net of accumulated amortization and impairment charges."
    },
    "InterestCostsCapitalized": {
        "description": "Amount of interest capitalized during the period."
    },
    "InterestCostsCapitalizedAdjustment": {
        "description": "Amount of interest costs capitalized disclosed as an adjusting item to interest costs incurred."
    },
    "InterestCostsIncurred": {
        "description": "Total interest costs incurred during the period and either capitalized or charged against earnings."
    },
    "InterestExpense": {
        "description": "Amount of the cost of borrowed funds accounted for as interest expense."
    },
    "InterestExpenseDebtExcludingAmortization": {
        "description": "Represents the portion of interest incurred in the period on debt arrangements that was charged against earnings, excluding amortization of debt discount (premium) and financing costs."
    },
    "InterestPaidNet": {
        "description": "Amount of cash paid for interest, excluding capitalized interest, classified as operating activity. Includes, but is not limited to, payment to settle zero-coupon bond for accreted interest of debt discount and debt instrument with insignificant coupon interest rate in relation to effective interest rate of borrowing attributable to accreted interest of debt discount."
    },
    "InventoryFinishedGoods": {
        "description": "Amount before valuation and LIFO reserves of completed merchandise or goods expected to be sold within one year or operating cycle, if longer."
    },
    "InventoryFinishedGoodsNetOfReserves": {
        "description": "Carrying amount, net of valuation reserves and adjustments, as of the balance sheet date of merchandise or goods held by the company that are readily available for sale."
    },
    "InventoryNet": {
        "description": "Amount after valuation and LIFO reserves of inventory expected to be sold, or consumed within one year or operating cycle, if longer."
    },
    "InventoryWorkInProcessAndRawMaterials": {
        "description": "The aggregate carrying amount as of the balance sheet date of items held by the entity which are partially completed at the time of measurement and unprocessed items that will go through the production process and become part of the final product. Includes supplies used directly or indirectly in the manufacturing or production process. This element may be used when the reporting entity combines work in process and raw materials into an aggregate amount."
    },
    "InventoryWorkInProcessAndRawMaterialsNetOfReserves": {
        "description": "The aggregate carrying amount, net of valuation reserves and adjustments, as of the balance sheet date of items which are partially completed at the time of measurement and unprocessed items that will go through the production process and become part of the final product. This element may be used when the reporting entity combines work in process and raw materials into an aggregate amount."
    },
    "InvestmentsAndOtherNoncurrentAssets": {
        "description": "Amount of investments, and noncurrent assets classified as other."
    },
    "LeaseCost": {
        "description": "Amount of lease cost recognized by lessee for lease contract."
    },
    "LeaseIncome": {
        "description": "Amount of lease income from operating, direct financing, and sales-type leases. Includes, but is not limited to, variable lease payments, interest income, profit (loss) recognized at commencement, and lease payments paid and payable to lessor."
    },
    "LesseeOperatingLeaseLiabilityPaymentsDueAfterYearFive": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for operating lease due after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LesseeOperatingLeaseLiabilityPaymentsDueNextTwelveMonths": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LesseeOperatingLeaseLiabilityPaymentsDueYearFive": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LesseeOperatingLeaseLiabilityPaymentsDueYearFour": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LesseeOperatingLeaseLiabilityPaymentsDueYearThree": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LesseeOperatingLeaseLiabilityPaymentsDueYearTwo": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for operating lease to be paid in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LesseeOperatingLeaseLiabilityPaymentsRemainderOfFiscalYear": {
        "description": "Amount of lessee's undiscounted obligation for lease payment for operating lease having initial or remaining lease term in excess of one year to be paid in remainder of current fiscal year."
    },
    "LesseeOperatingLeaseLiabilityUndiscountedExcessAmount": {
        "description": "Amount of lessee's undiscounted obligation for lease payments in excess of discounted obligation for lease payments for operating lease."
    },
    "LessorOperatingLeasePaymentsToBeReceived": {
        "description": "Amount of lease payments to be received by lessor for operating lease."
    },
    "LessorOperatingLeasePaymentsToBeReceivedFiveYears": {
        "description": "Amount of lease payment to be received by lessor for operating lease in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LessorOperatingLeasePaymentsToBeReceivedFourYears": {
        "description": "Amount of lease payment to be received by lessor for operating lease in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LessorOperatingLeasePaymentsToBeReceivedNextTwelveMonths": {
        "description": "Amount of lease payment to be received by lessor for operating lease in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LessorOperatingLeasePaymentsToBeReceivedRemainderOfFiscalYear": {
        "description": "Amount of lease payment to be received by lessor for operating lease in remainder of current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LessorOperatingLeasePaymentsToBeReceivedThereafter": {
        "description": "Amount of lease payment to be received by lessor for operating lease after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LessorOperatingLeasePaymentsToBeReceivedThreeYears": {
        "description": "Amount of lease payment to be received by lessor for operating lease in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LessorOperatingLeasePaymentsToBeReceivedTwoYears": {
        "description": "Amount of lease payment to be received by lessor for operating lease in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "Liabilities": {
        "description": "Sum of the carrying amounts as of the balance sheet date of all liabilities that are recognized. Liabilities are probable future sacrifices of economic benefits arising from present obligations of an entity to transfer assets or provide services to other entities in the future."
    },
    "LiabilitiesAndStockholdersEquity": {
        "description": "Amount of liabilities and equity items, including the portion of equity attributable to noncontrolling interests, if any."
    },
    "LiabilitiesCurrent": {
        "description": "Total obligations incurred as part of normal operations that are expected to be paid during the following twelve months or within one business cycle, if longer."
    },
    "LiabilitiesOfDisposalGroupIncludingDiscontinuedOperationNoncurrent": {
        "description": "Amount classified as liabilities attributable to disposal group held for sale or disposed of, expected to be disposed of beyond one year or the normal operating cycle, if longer."
    },
    "LiabilityForUncertainTaxPositionsNoncurrent": {
        "description": "Amount recognized for uncertainty in income taxes classified as noncurrent."
    },
    "LineOfCreditFacilityRemainingBorrowingCapacity": {
        "description": "Amount of borrowing capacity currently available under the credit facility (current borrowing capacity less the amount of borrowings outstanding)."
    },
    "LoansAndLeasesReceivableCollateralForSecuredBorrowings": {
        "description": "Reflects the aggregate value of loans, trade receivables, securities and financial instruments that serve as collateral for obligations arising from a transfer of financial assets recorded as a secured borrowing."
    },
    "LoansAndLeasesReceivableDeferredIncome": {
        "description": "Amount of deferred interest and fee income, unamortized costs incurred to originate loans and leases, unamortized loan commitments and loan syndication fees, and premiums over or discounts from face amounts of acquired loans. Excludes amounts for loans and leases covered under loss sharing agreements."
    },
    "LoansAndLeasesReceivableGrossCarryingAmount": {
        "description": "Amount before allowance of loans and leases held in portfolio, including but not limited to, commercial and consumer loans. Includes deferred interest and fees, undisbursed portion of loan balance, unamortized costs and premiums and discounts from face amounts. Excludes loans and leases covered under loss sharing agreements."
    },
    "LoansAndLeasesReceivableNetOfDeferredIncome": {
        "description": "Amount before allowance and after deduction of deferred interest and fees, unamortized costs and premiums and discounts from face amounts, of loans and leases held in portfolio, including but not limited to, commercial and consumer loans. Excludes loans and leases covered under loss sharing agreements."
    },
    "LongTermDebt": {
        "description": "Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."
    },
    "LongTermDebtAndCapitalLeaseObligations": {
        "description": "Amount of long-term debt and lease obligation, classified as noncurrent."
    },
    "LongTermDebtAndCapitalLeaseObligationsCurrent": {
        "description": "Amount of long-term debt and lease obligation, classified as current."
    },
    "LongTermDebtAndCapitalLeaseObligationsIncludingCurrentMaturities": {
        "description": "Amount of long-term debt and lease obligation, including portion classified as current."
    },
    "LongTermDebtCurrent": {
        "description": "Amount, after unamortized (discount) premium and debt issuance costs, of long-term debt, classified as current. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."
    },
    "LongTermDebtFairValue": {
        "description": "The fair value amount of long-term debt whether such amount is presented as a separate caption or as a parenthetical disclosure. Additionally, this element may be used in connection with the fair value disclosures required in the footnote disclosures to the financial statements. The element may be used in both the balance sheet and disclosure in the same submission."
    },
    "LongTermDebtMaturitiesRepaymentsOfPrincipalAfterYearFive": {
        "description": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInNextTwelveMonths": {
        "description": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFive": {
        "description": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearFour": {
        "description": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearThree": {
        "description": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LongTermDebtMaturitiesRepaymentsOfPrincipalInYearTwo": {
        "description": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "LongTermDebtMaturitiesRepaymentsOfPrincipalRemainderOfFiscalYear": {
        "description": "Amount of long-term debt payable, sinking fund requirement, and other securities issued that are redeemable by holder at fixed or determinable price and date, maturing in remainder of current fiscal year."
    },
    "LongTermDebtNoncurrent": {
        "description": "Amount after unamortized (discount) premium and debt issuance costs of long-term debt classified as noncurrent and excluding amounts to be repaid within one year or the normal operating cycle, if longer. Includes, but not limited to, notes payable, bonds payable, debentures, mortgage loans and commercial paper. Excludes capital lease obligations."
    },
    "LongTermDebtPercentageBearingFixedInterestRate": {
        "description": "The interest rate applicable to the portion of the carrying amount of long-term borrowings outstanding as of the balance sheet date, including current maturities, which accrues interest at a set, unchanging rate."
    },
    "LongTermDebtPercentageBearingVariableInterestRate": {
        "description": "The interest rate applicable to the portion of the carrying amount of long-term borrowings outstanding as of the balance sheet date, including current maturities, which accrues interest at a rate subject to change from time to time."
    },
    "LongtermDebtPercentageBearingFixedInterestAmount": {
        "description": "The portion of the carrying amount of long-term borrowings outstanding as of the balance sheet date, including current maturities, which accrues interest at a set, unchanging rate."
    },
    "LongtermDebtPercentageBearingVariableInterestAmount": {
        "description": "The portion of the carrying amount of long-term borrowings outstanding as of the balance sheet date, including current maturities, which accrues interest at a rate subject to change from time to time."
    },
    "LossContingencyEstimateOfPossibleLoss": {
        "description": "Reflects the estimated amount of loss from the specified contingency as of the balance sheet date."
    },
    "MarketableSecuritiesCurrent": {
        "description": "Amount of investment in marketable security, classified as current."
    },
    "MarketingAndAdvertisingExpense": {
        "description": "The total expense recognized in the period for promotion, public relations, and brand or product advertising."
    },
    "MinorityInterest": {
        "description": "Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which is directly or indirectly attributable to that ownership interest in subsidiary equity which is not attributable to the parent (that is, noncontrolling interest, previously referred to as minority interest)."
    },
    "MinorityInterestPeriodIncreaseDecrease": {
        "description": "Net Increase or Decrease in balance of noncontrolling interest in the subsidiary during the reporting period."
    },
    "MultiemployerPlanPeriodContributions": {
        "description": "Amount of contributions made to multiemployer plans by the employer. A multiemployer plan is a pension or postretirement benefit plan to which two or more unrelated employers contribute where assets contributed by one participating employer may be used to provide benefits to employees of other participating employers."
    },
    "NetCashProvidedByUsedInContinuingOperations": {
        "description": "The increase (decrease) in cash associated with the entity's continuing operating, investing, and financing activities. While for technical reasons this element has no balance attribute, the default assumption is a debit balance consistent with its label."
    },
    "NetCashProvidedByUsedInFinancingActivities": {
        "description": "Amount of cash inflow (outflow) from financing activities, including discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."
    },
    "NetCashProvidedByUsedInFinancingActivitiesContinuingOperations": {
        "description": "Amount of cash inflow (outflow) of financing activities, excluding discontinued operations. Financing activity cash flows include obtaining resources from owners and providing them with a return on, and a return of, their investment; borrowing money and repaying amounts borrowed, or settling the obligation; and obtaining and paying for other resources obtained from creditors on long-term credit."
    },
    "NetCashProvidedByUsedInInvestingActivities": {
        "description": "Amount of cash inflow (outflow) from investing activities, including discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."
    },
    "NetCashProvidedByUsedInInvestingActivitiesContinuingOperations": {
        "description": "Amount of cash inflow (outflow) of investing activities, excluding discontinued operations. Investing activity cash flows include making and collecting loans and acquiring and disposing of debt or equity instruments and property, plant, and equipment and other productive assets."
    },
    "NetCashProvidedByUsedInOperatingActivities": {
        "description": "Amount of cash inflow (outflow) from operating activities, including discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."
    },
    "NetCashProvidedByUsedInOperatingActivitiesContinuingOperations": {
        "description": "Amount of cash inflow (outflow) from operating activities, excluding discontinued operations. Operating activity cash flows include transactions, adjustments, and changes in value not defined as investing or financing activities."
    },
    "NetIncomeLoss": {
        "description": "The portion of profit or loss for the period, net of income taxes, which is attributable to the parent."
    },
    "NetIncomeLossAttributableToNoncontrollingInterest": {
        "description": "Amount of Net Income (Loss) attributable to noncontrolling interest."
    },
    "NetIncomeLossAvailableToCommonStockholdersBasic": {
        "description": "Amount, after deduction of tax, noncontrolling interests, dividends on preferred stock and participating securities; of income (loss) available to common shareholders."
    },
    "NetIncomeLossAvailableToCommonStockholdersDiluted": {
        "description": "Amount, after deduction of tax, noncontrolling interests, dividends on preferred stock and participating securities, and addition from assumption of issuance of common shares for dilutive potential common shares; of income (loss) available to common shareholders."
    },
    "NetIncomeLossFromContinuingOperationsAvailableToCommonShareholdersBasic": {
        "description": "Amount, after deduction of tax, noncontrolling interests, dividends on preferred stock and participating securities; of income (loss) from continuing operations available to common shareholders."
    },
    "NetIncomeLossFromContinuingOperationsAvailableToCommonShareholdersDiluted": {
        "description": "Amount, after deduction of tax, noncontrolling interests, dividends on preferred stock and participating securities, and addition from assumption of issuance of common shares for dilutive potential common shares; of income (loss) from continuing operations available to common shareholders."
    },
    "NetIncomeLossFromDiscontinuedOperationsAvailableToCommonShareholdersBasic": {
        "description": "Amount, after deduction of tax, noncontrolling interests, dividends on preferred stock and participating securities; of income (loss) from discontinued operations available to common shareholders."
    },
    "NetIncomeLossFromDiscontinuedOperationsAvailableToCommonShareholdersDiluted": {
        "description": "Amount, after deduction of tax, noncontrolling interests, dividends on preferred stock and participating securities, and addition from assumption of issuance of common shares for dilutive potential common shares; of income (loss) from discontinued operations available to common shareholders."
    },
    "NotesAndLoansReceivableNetCurrent": {
        "description": "Amount, after allowance for credit loss, of financing receivable, classified as current. Includes, but is not limited to, notes and loan receivable."
    },
    "NotesAndLoansReceivableNetNoncurrent": {
        "description": "Amount, after allowance for credit loss, of financing receivable, classified as noncurrent."
    },
    "NotesReceivableNet": {
        "description": "Amount, after allowance for credit loss, of financing receivable. Excludes financing receivable covered under loss sharing agreement."
    },
    "NotionalAmountOfDerivativeInstrumentsDesignatedAsNetInvestmentHedges": {
        "description": "Aggregate notional amount of all derivatives designated as a hedge of a net investment in a foreign operation. The notional amount relates to a number of currency units, shares, bushels, pounds, or other units specified in a derivative instrument."
    },
    "NotionalAmountOfForeignCurrencyDerivativeInstrumentsNotDesignatedAsHedgingInstruments": {
        "description": "Aggregate notional amount of all foreign currency derivatives not designated as hedging instruments. Notional amount refers to the number of currency units specified in the foreign currency derivative contract."
    },
    "NotionalAmountOfInterestRateDerivatives": {
        "description": "Aggregate notional amount of interest rate derivatives, which relates to the currency amount specified in the interest rate derivative instruments."
    },
    "NotionalAmountOfInterestRateFairValueHedgeDerivatives": {
        "description": "Aggregate notional amount of all interest rate derivatives designated as hedging instruments in fair value hedges. Notional amount refers to the monetary amount specified in the interest rate derivative contract."
    },
    "NotionalAmountOfPriceRiskDerivatives": {
        "description": "Aggregate notional amount of price risk derivatives, which relates to the monetary amount specified in the price risk derivative instruments. Excludes notional amounts on derivatives expressed in nonmonetary units."
    },
    "NumberOfBusinessesAcquired": {
        "description": "The number of businesses acquired by the entity during the period."
    },
    "NumberOfCountriesInWhichEntityOperates": {
        "description": "The number of countries in which the entity operates as of balance sheet date."
    },
    "NumberOfReportableSegments": {
        "description": "Number of segments reported by the entity. A reportable segment is a component of an entity for which there is an accounting requirement to report separate financial information on that component in the entity's financial statements."
    },
    "OperatingLeaseCost": {
        "description": "Amount of single lease cost, calculated by allocation of remaining cost of lease over remaining lease term. Includes, but is not limited to, single lease cost, after impairment of right-of-use asset, calculated by amortization of remaining right-of-use asset and accretion of lease liability."
    },
    "OperatingLeaseLeaseIncome": {
        "description": "Amount of operating lease income from lease payments and variable lease payments paid and payable to lessor. Includes, but is not limited to, variable lease payments not included in measurement of lease receivable."
    },
    "OperatingLeaseLiability": {
        "description": "Present value of lessee's discounted obligation for lease payments from operating lease."
    },
    "OperatingLeaseLiabilityCurrent": {
        "description": "Present value of lessee's discounted obligation for lease payments from operating lease, classified as current."
    },
    "OperatingLeaseLiabilityNoncurrent": {
        "description": "Present value of lessee's discounted obligation for lease payments from operating lease, classified as noncurrent."
    },
    "OperatingLeasePayments": {
        "description": "Amount of cash outflow from operating lease, excluding payments to bring another asset to condition and location necessary for its intended use."
    },
    "OperatingLeaseRightOfUseAsset": {
        "description": "Amount of lessee's right to use underlying asset under operating lease."
    },
    "OperatingLeasesFutureMinimumPaymentsDue": {
        "description": "Amount of required minimum rental payments for leases having an initial or remaining non-cancelable letter-terms in excess of one year."
    },
    "OperatingLeasesFutureMinimumPaymentsDueCurrent": {
        "description": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the next fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "OperatingLeasesFutureMinimumPaymentsDueInFiveYears": {
        "description": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "OperatingLeasesFutureMinimumPaymentsDueInFourYears": {
        "description": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the fourth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "OperatingLeasesFutureMinimumPaymentsDueInThreeYears": {
        "description": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the third fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "OperatingLeasesFutureMinimumPaymentsDueInTwoYears": {
        "description": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due in the second fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "OperatingLeasesFutureMinimumPaymentsDueThereafter": {
        "description": "Amount of required minimum rental payments for operating leases having an initial or remaining non-cancelable lease term in excess of one year due after the fifth fiscal year following the latest fiscal year. Excludes interim and annual periods when interim periods are reported on a rolling approach, from latest balance sheet date."
    },
    "OperatingLeaseWeightedAverageDiscountRatePercent": {
        "description": "Weighted average discount rate for operating lease calculated at point in time."
    },
    "OtherAssetsMiscellaneousNoncurrent": {
        "description": "Amount of other miscellaneous assets expected to be realized or consumed after one year or normal operating cycle, if longer."
    },
    "OtherAssetsNoncurrent": {
        "description": "Amount of noncurrent assets classified as other."
    },
    "OtherComprehensiveIncomeAmortizationOfDefinedBenefitPlanNetPriorServiceCostCreditRecognizedInNetPeriodicBenefitCostBeforeTax": {
        "description": "The change in other comprehensive income due to the amortization of the net prior service costs (credit) into net periodic pension costs."
    },
    "OtherComprehensiveIncomeAmortizationOfDefinedBenefitPlanNetPriorServiceCostRecognizedInNetPeriodicPensionCostNetOfTax": {
        "description": "The adjustment out of other comprehensive income for prior service costs recognized as a component of net period benefit cost during the period, after tax."
    },
    "OtherComprehensiveIncomeAmortizationOfDefinedBenefitPlanNetPriorServiceCostRecognizedInNetPeriodicPensionCostTax": {
        "description": "Tax effect of the income statement impact of the reclassification adjustment for prior service costs recognized as a component of net period benefit cost."
    },
    "OtherComprehensiveIncomeAvailableForSaleSecuritiesAdjustmentBeforeTaxPeriodIncreaseDecrease": {
        "description": "Gross appreciation or the gross loss in value of the total of unsold available-for-sale securities (except when designated as a fair value hedge or which had been determined to have had an other than temporary decline in fair value below its amortized cost basis). While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeAvailableForSaleSecuritiesAdjustmentNetOfTaxPeriodIncreaseDecrease": {
        "description": "Gross appreciation or the gross loss in value of the total unsold securities. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeAvailableForSaleSecuritiesTax": {
        "description": "Tax effect of the gross appreciation or the gross loss, net of reclassification adjustment, in the value of the total unsold available-for-sale securities at the end of an accounting period."
    },
    "OtherComprehensiveIncomeAvailableforsaleSecuritiesAdjustmentBeforeTaxPortionAttributableToParent": {
        "description": "Amount before tax, after reclassification adjustments, of appreciation (loss) in value of unsold available-for-sale securities, attributable to parent entity. Excludes amounts related to other than temporary impairment (OTTI) loss."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlanNetPriorServiceCostCreditArisingDuringPeriodBeforeTax": {
        "description": "Amount, before tax, of cost (credit) of benefit change attributable to participants' prior service from plan amendment or plan initiation of defined benefit plan, that has not been recognized in net periodic benefit cost (credit)."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlanNetPriorServiceCostsArisingDuringPeriodTax": {
        "description": "Tax effect on the cost of benefit improvement resulting from a plan amendment that occurred during the period. The cost has not been recognized in net periodic benefit cost pursuant. A plan amendment includes provisions that grant increased benefits based on service rendered in prior periods."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlanNetPriorServiceCostsCreditArisingDuringPeriodNetOfTax": {
        "description": "Amount, after tax, of cost (credit) of benefit change attributable to participants' prior service from plan amendment or plan initiation of defined benefit plan, that has not been recognized in net periodic benefit cost (credit)."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlansAdjustmentBeforeTaxPeriodIncreaseDecrease": {
        "description": "Amounts recognized in other comprehensive income (but not yet recognized in net periodic benefit cost), including the net gain (loss) and net prior service cost (credit) arising during the period. Also includes reclassification adjustments out of other comprehensive income as a result of being recognized as components of net periodic benefit cost for the period. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlansAdjustmentBeforeTaxPortionAttributableToParent": {
        "description": "Amount, before tax, after reclassification adjustment, of (increase) decrease in accumulated other comprehensive (income) loss for defined benefit plan, attributable to parent entity."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlansAdjustmentNetOfTaxPeriodIncreaseDecrease": {
        "description": "The increase (decrease) in accumulated comprehensive income during the period related to pension and other postretirement benefit plans, after tax. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlansNetUnamortizedGainLossArisingDuringPeriodBeforeTax": {
        "description": "Pretax change in the value of either the benefit obligation or the plan assets resulting from experience different from that assumed or from a change in an actuarial assumption, or the consequence of a decision to temporarily deviate from the substantive plan, that has not been recognized in net periodic benefit cost."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlansNetUnamortizedGainLossArisingDuringPeriodNetOfTax": {
        "description": "Amount, after tax, of gain (loss) for (increase) decrease in value of benefit obligation for change in actuarial assumptions and increase (decrease) in value of plan assets from experience different from that assumed of defined benefit plan, that has not been recognized in net periodic benefit (cost) credit."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlansNetUnamortizedGainLossArisingDuringPeriodTax": {
        "description": "Amount of tax expense (benefit) for (increase) decrease in value of benefit obligation for change in actuarial assumptions and increase (decrease) in value of plan assets from experience different from that assumed of defined benefit plan, that has not been recognized in net periodic benefit (cost) credit."
    },
    "OtherComprehensiveIncomeDefinedBenefitPlansTax": {
        "description": "Tax effects of the increase (decrease) to accumulated comprehensive income during the period related to benefit plans. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeDerivativesQualifyingAsHedgesBeforeTaxPeriodIncreaseDecrease": {
        "description": "Pre tax change in accumulated gains and losses from derivative instruments designated and qualifying as the effective portion of cash flow hedges, net of reclassifications into earnings during the period. A cash flow hedge is a hedge of the exposure to variability in the cash flows of a recognized asset or liability or a forecasted transaction that is attributable to a particular risk. Includes an entity's share of an equity investee's increase or decrease in deferred hedging gains or losses. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeDerivativesQualifyingAsHedgesBeforeTaxPortionAttributableToParent": {
        "description": "Amount before tax, after reclassification adjustments, of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss), attributable to parent entity."
    },
    "OtherComprehensiveIncomeDerivativesQualifyingAsHedgesNetOfTaxPeriodIncreaseDecrease": {
        "description": "Net of tax effect change in accumulated gains and losses from derivative instruments designated and qualifying as the effective portion of cash flow hedges after taxes. A cash flow hedge is a hedge of the exposure to variability in the cash flows of a recognized asset or liability or a forecasted transaction that is attributable to a particular risk. The change includes an entity's share of an equity investee's increase or decrease in deferred hedging gains or losses. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeDerivativesQualifyingAsHedgesTaxEffectPeriodIncreaseDecrease": {
        "description": "Total tax effect of the change in accumulated gains and losses from derivative instruments designated and qualifying as the effective portion of cash flow hedges. The change includes an entity's share of an equity investee's increase or decrease in deferred hedging gains or losses. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeFinalizationOfPensionAndNonPensionPostretirementPlanValuationBeforeTax": {
        "description": "Pre-tax gain (loss) adjustment to other comprehensive income resulting from the settlement or curtailment of the entity's defined benefit pension and other postretirement plans. A settlement is defined as a transaction that (a) is an irrevocable action, (b) relieves the employer or plan of a primary responsibility for a pension benefit obligation, and (c) eliminates significant risks related to the obligations and the assets used to effect the settlement. A curtailment is an event that significantly reduces the expected years of future service of present employees or eliminates for a significant number of employees the accrual of defined benefits for some or all of their future services."
    },
    "OtherComprehensiveIncomeFinalizationOfPensionAndNonPensionPostretirementPlanValuationNetOfTax": {
        "description": "After tax gain (loss) adjustment to other comprehensive income resulting from the settlement or curtailment of the entity's defined benefit pension and other postretirement plans. A settlement is defined as a transaction that (a) is an irrevocable action, (b) relieves the employer or plan of a primary responsibility for a pension benefit obligation, and (c) eliminates significant risks related to the obligations and the assets used to effect the settlement. A curtailment is an event that significantly reduces the expected years of future service of present employees or eliminates for a significant number of employees the accrual of defined benefits for some or all of their future services."
    },
    "OtherComprehensiveIncomeFinalizationOfPensionAndNonPensionPostretirementPlanValuationTax": {
        "description": "Amount of tax expense (benefit) for increase (decrease) to other comprehensive income from settlement and curtailment gain (loss) of defined benefit plan."
    },
    "OtherComprehensiveIncomeForeignCurrencyTransactionAndTranslationAdjustmentBeforeTaxPeriodIncreaseDecrease": {
        "description": "Pre tax adjustment that results from the process of translating subsidiary financial statements and foreign equity investments into functional currency of the reporting entity, net of reclassification of realized foreign currency translation gains (losses). Includes gain (loss) on foreign currency forward exchange contracts. Includes foreign currency transactions designated as hedges of net investment in a foreign entity and intercompany foreign currency transactions that are of a long-term nature, when the entities to the transaction are consolidated, combined, or accounted for by the equity method in the reporting enterprise's financial statements. Includes the gain (loss) on a derivative instrument or nonderivative financial instrument that may give rise to a foreign currency transaction gain (loss) that has been designated and qualified as a hedging instrument for hedging of the foreign currency exposure of a net investment in a foreign operation."
    },
    "OtherComprehensiveIncomeForeignCurrencyTransactionAndTranslationAdjustmentBeforeTaxPortionAttributableToParent": {
        "description": "Amount before tax, after reclassification adjustments of gain (loss) on foreign currency translation adjustments, on foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature, attributable to parent entity."
    },
    "OtherComprehensiveIncomeForeignCurrencyTransactionAndTranslationAdjustmentNetOfTaxPeriodIncreaseDecrease": {
        "description": "Adjustment that results from the process of translating subsidiary financial statements and foreign equity investments into the reporting currency of the reporting entity, net of tax."
    },
    "OtherComprehensiveIncomeForeignCurrencyTranslationAdjustmentTax": {
        "description": "Tax effect of the adjustment that results from the process of translating subsidiary financial statements and foreign equity investments into functional currency of the reporting entity. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeLossAmortizationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansForNetPriorServiceCostCreditBeforeTax": {
        "description": "Amount, before tax, of reclassification adjustment from accumulated other comprehensive (income) loss for prior service cost (credit) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossAmortizationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansForNetPriorServiceCostCreditNetOfTax": {
        "description": "Amount, after tax, of reclassification adjustment from accumulated other comprehensive (income) loss for prior service cost (credit) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossAmortizationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansForNetPriorServiceCostCreditTax": {
        "description": "Amount of tax (expense) benefit of reclassification adjustment from accumulated other comprehensive (income) loss for prior service cost (credit) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossAmortizationPensionAndOtherPostretirementBenefitPlansNetPriorServiceCostRecognizedInNetPeriodicBenefitCostBeforeTax": {
        "description": "Before tax amount of the income statement impact of the reclassification adjustment for prior service costs recognized as a component of net period benefit cost."
    },
    "OtherComprehensiveIncomeLossAmortizationPensionAndOtherPostretirementBenefitPlansNetPriorServiceCostRecognizedInNetPeriodicPensionCostNetOfTax": {
        "description": "Net of tax amount of the income statement impact of the reclassification adjustment for prior service costs recognized as a component of net period benefit cost."
    },
    "OtherComprehensiveIncomeLossAmortizationPensionAndOtherPostretirementBenefitPlansNetPriorServiceCostRecognizedInNetPeriodicPensionCostTaxEffect": {
        "description": "Tax effect on adjustment out of other comprehensive income for prior service costs recognized as a component of net period benefit cost during the period."
    },
    "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentBeforeTax": {
        "description": "Amount, before tax and after adjustment, of unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale) and unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale."
    },
    "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesAdjustmentNetOfTax": {
        "description": "Amount, after tax and adjustment, of unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale) and unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale."
    },
    "OtherComprehensiveIncomeLossAvailableForSaleSecuritiesTax": {
        "description": "Amount, after adjustment, of tax expense (benefit) for unrealized gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale) and tax expense (benefit) for unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale."
    },
    "OtherComprehensiveIncomeLossBeforeReclassificationsNetOfTax": {
        "description": "Amount after tax, before reclassification adjustments of other comprehensive income (loss)."
    },
    "OtherComprehensiveIncomeLossBeforeTax": {
        "description": "Amount before tax, after reclassification adjustments of other comprehensive income (loss)."
    },
    "OtherComprehensiveIncomeLossBeforeTaxPeriodIncreaseDecrease": {
        "description": "This element represents Other Comprehensive Income or Loss, Before Tax, for the period. The pretax revenues, expenses, gains, and losses that under generally accepted accounting principles are included in comprehensive income, but excluded from net income. Includes the entity's proportionate share of an investee's equity adjustments for other comprehensive income. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeLossBeforeTaxPortionAttributableToParent": {
        "description": "Amount before tax of other comprehensive income (loss) attributable to parent entity."
    },
    "OtherComprehensiveIncomeLossCashFlowHedgeGainLossAfterReclassificationBeforeTaxParent": {
        "description": "Amount, before tax and after reclassification, of gain (loss) from derivative instrument designated and qualifying cash flow hedge included in assessment of hedge effectiveness, attributable to parent."
    },
    "OtherComprehensiveIncomeLossCashFlowHedgeGainLossBeforeReclassificationAndTax": {
        "description": "Amount, before tax and reclassification, of gain (loss) from derivative instrument designated and qualifying cash flow hedge included in assessment of hedge effectiveness."
    },
    "OtherComprehensiveIncomeLossCashFlowHedgeGainLossReclassificationBeforeTax": {
        "description": "Amount, before tax, of reclassification of gain (loss) from accumulated other comprehensive income (AOCI) for derivative instrument designated and qualifying as cash flow hedge included in assessment of hedge effectiveness."
    },
    "OtherComprehensiveIncomeLossDerivativesQualifyingAsHedgesBeforeTax": {
        "description": "Amount before tax, after reclassification adjustments, of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss)."
    },
    "OtherComprehensiveIncomeLossDerivativesQualifyingAsHedgesNetOfTax": {
        "description": "Amount after tax and reclassification adjustments, of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss)."
    },
    "OtherComprehensiveIncomeLossDerivativesQualifyingAsHedgesTax": {
        "description": "Amount of tax expense (benefit), after reclassification adjustments, of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss)."
    },
    "OtherComprehensiveIncomeLossFinalizationOfPensionAndNonPensionPostretirementPlanValuationBeforeTax": {
        "description": "Amount, before tax, of increase (decrease) to other comprehensive income from settlement and curtailment gain (loss) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossFinalizationOfPensionAndNonPensionPostretirementPlanValuationNetOfTax": {
        "description": "Amount, after tax, of increase (decrease) to other comprehensive income from settlement and curtailment gain (loss) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossForeignCurrencyTransactionAndTranslationAdjustmentBeforeTax": {
        "description": "Amount before tax, after reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature."
    },
    "OtherComprehensiveIncomeLossForeignCurrencyTransactionAndTranslationAdjustmentNetOfTax": {
        "description": "Amount after tax and reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature."
    },
    "OtherComprehensiveIncomeLossForeignCurrencyTranslationAdjustmentTax": {
        "description": "Amount of tax expense (benefit), after reclassification adjustments of gain (loss) on foreign currency translation adjustments, foreign currency transactions designated and effective as economic hedges of a net investment in a foreign entity and intra-entity foreign currency transactions that are of a long-term-investment nature."
    },
    "OtherComprehensiveIncomeLossNetOfTax": {
        "description": "Amount after tax and reclassification adjustments of other comprehensive income (loss)."
    },
    "OtherComprehensiveIncomeLossNetOfTaxPeriodIncreaseDecrease": {
        "description": "This element represents Other Comprehensive Income or Loss, Net of Tax, for the period. Includes deferred gains or losses on qualifying hedges, unrealized holding gains or losses on available-for-sale securities, minimum pension liability, and cumulative translation adjustment. While for technical reasons this element has no balance attribute, the default assumption is a credit balance consistent with its label."
    },
    "OtherComprehensiveIncomeLossNetOfTaxPortionAttributableToParent": {
        "description": "Amount after tax of other comprehensive income (loss) attributable to parent entity."
    },
    "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansAdjustmentBeforeTax": {
        "description": "Amount, before tax, after reclassification adjustment, of (increase) decrease in accumulated other comprehensive income for defined benefit plan."
    },
    "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansAdjustmentNetOfTax": {
        "description": "Amount, after tax and reclassification adjustment, of (increase) decrease in accumulated other comprehensive income for defined benefit plan."
    },
    "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansBenefitPlanImprovementTaxEffect": {
        "description": "Amount of tax (expense) benefit for cost (credit) of benefit change attributable to participants' prior service from plan amendment or plan initiation of defined benefit plan, that has not been recognized in net periodic benefit cost (credit)."
    },
    "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansNetUnamortizedGainLossArisingDuringPeriodBeforeTax": {
        "description": "Amount, before tax, of gain (loss) for (increase) decrease in value of benefit obligation for change in actuarial assumptions and increase (decrease) in value of plan assets from experience different from that assumed of defined benefit plan, that has not been recognized in net periodic benefit (cost) credit."
    },
    "OtherComprehensiveIncomeLossPensionAndOtherPostretirementBenefitPlansTax": {
        "description": "Amount, after reclassification adjustment, of tax (expense) benefit for (increase) decrease in accumulated other comprehensive income of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeBeforeTax": {
        "description": "Before tax amount of the income statement impact of the reclassification adjustment for unrealized gain (loss) realized upon the sale of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeNetOfTax": {
        "description": "Net of tax amount of the income statement impact of the reclassification adjustment for unrealized gain (loss) realized upon the sale of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeTax": {
        "description": "Tax effect of the income statement impact of the reclassification adjustment for unrealized gain (loss) realized upon the sale of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentForWritedownOfSecuritiesIncludedInNetIncomeNetOfTax": {
        "description": "Net of tax amount of the income statement impact of the reclassification adjustment for unrealized (losses) realized upon the write-down of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesBeforeTax": {
        "description": "Amount before tax of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesNetOfTax": {
        "description": "Amount after tax of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForSaleOfSecuritiesTax": {
        "description": "Amount of tax expense (benefit) of reclassification adjustment from accumulated other comprehensive income for unrealized gain (loss) realized upon the sale of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForWritedownOfSecuritiesBeforeTax": {
        "description": "Amount before tax of reclassification adjustment from accumulated other comprehensive income for unrealized loss realized upon the write-down of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIForWritedownOfSecuritiesNetOfTax": {
        "description": "Amount after tax of reclassification adjustment from accumulated other comprehensive income for unrealized loss realized upon the write-down of available-for-sale securities."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIOnDerivativesBeforeTax": {
        "description": "Amount before tax of reclassification adjustment from accumulated other comprehensive income of accumulated gain (loss) realized from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's deferred hedging gain (loss)."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansForNetGainLossBeforeTax": {
        "description": "Amount, before tax, of reclassification adjustment from accumulated other comprehensive income (loss) for gain (loss) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansForNetGainLossNetOfTax": {
        "description": "Amount, after tax, of reclassification adjustment from accumulated other comprehensive income (loss) for gain (loss) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentFromAOCIPensionAndOtherPostretirementBenefitPlansForNetGainLossTax": {
        "description": "Amount of tax expense (benefit) of reclassification adjustment from accumulated other comprehensive income (loss) for gain (loss) of defined benefit plan."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentOnDerivativesIncludedInNetIncomeBeforeTax": {
        "description": "Before tax amount of the income statement impact of the reclassification adjustment of accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges realized in net income. Also includes reclassification adjustments of an entity's share of an equity investee's deferred hedging gain (loss) realized in net income."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentOnDerivativesIncludedInNetIncomeNetOfTax": {
        "description": "Net of tax amount of the income statement impact of the reclassification adjustment of accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges realized in net income. Also includes reclassification adjustments of an entity's share of an equity investee's deferred hedging gain (loss) realized in net income."
    },
    "OtherComprehensiveIncomeLossReclassificationAdjustmentOnDerivativesIncludedInNetIncomeTax": {
        "description": "Tax effect of the income statement impact of the reclassification adjustment of accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges realized in net income. Also includes reclassification adjustments of an entity's share of an equity investee's deferred hedging gain (loss) realized in net income."
    },
    "OtherComprehensiveIncomeLossReclassificationPensionAndOtherPostretirementBenefitPlansNetGainLossRecognizedInNetPeriodicBenefitCostTax": {
        "description": "Tax effect of the income statement impact of the reclassification adjustment for actuarial gain (loss) recognized as a component of net periodic benefit cost."
    },
    "OtherComprehensiveIncomeLossTax": {
        "description": "Amount of tax expense (benefit) allocated to other comprehensive income (loss)."
    },
    "OtherComprehensiveIncomeLossTaxPortionAttributableToParent1": {
        "description": "Amount of tax expense (benefit) allocated to other comprehensive income (loss) attributable to parent entity."
    },
    "OtherComprehensiveIncomeReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeBeforeTax": {
        "description": "Pre tax reclassification adjustment for gains or losses realized upon the sale of securities."
    },
    "OtherComprehensiveIncomeReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeNetOfTax": {
        "description": "Reclassification adjustment for unrealized gains or losses realized upon the sale of securities, after tax."
    },
    "OtherComprehensiveIncomeReclassificationAdjustmentForSaleOfSecuritiesIncludedInNetIncomeTax": {
        "description": "Tax effect on the reclassification adjustment for gains or losses realized upon the sale of securities during the period."
    },
    "OtherComprehensiveIncomeReclassificationAdjustmentForWriteDownOfSecuritiesIncludedInNetIncomeNetOfTax": {
        "description": "Reclassification adjustment for unrealized gains or losses realized upon the write-down of securities, after tax."
    },
    "OtherComprehensiveIncomeReclassificationAdjustmentOnDerivativesIncludedInNetIncomeBeforeTax": {
        "description": "Pre tax reclassification adjustment for accumulated gains and losses from derivative instrument designated and qualifying as the effective portion of cash flow hedges included in accumulated comprehensive income that was realized in net income during the period. A cash flow hedge is a hedge of the exposure to variability in the cash flows of a recognized asset or liability or a forecasted transaction that is attributable to a particular risk."
    },
    "OtherComprehensiveIncomeReclassificationAdjustmentOnDerivativesIncludedInNetIncomeNetOfTax": {
        "description": "Net of tax effect of the reclassification adjustment for accumulated gains and losses from derivative instrument designated and qualifying as the effective portion of cash flow hedges included in accumulated comprehensive income that was realized in net income during the period."
    },
    "OtherComprehensiveIncomeReclassificationAdjustmentOnDerivativesIncludedInNetIncomeTax": {
        "description": "Tax effect on reclassification adjustment for accumulated gains and losses from derivative instrument designated and qualifying as the effective portion of cash flow hedges included in accumulated comprehensive income that was realized in net income during the period."
    },
    "OtherComprehensiveIncomeReclassificationOfDefinedBenefitPlanNetTransitionAssetObligationRecognizedInNetPeriodicBenefitCostBeforeTax": {
        "description": "Before tax amount of the income statement impact of the reclassification adjustment for the net transition asset (obligation) recognized as a component of net periodic benefit cost."
    },
    "OtherComprehensiveIncomeReclassificationOfDefinedBenefitPlanNetTransitionAssetObligationRecognizedInNetPeriodicBenefitCostNetOfTax": {
        "description": "Net of tax amount of the income statement impact of the reclassification adjustment for the net transition (asset) obligation recognized as a component of net periodic benefit cost."
    },
    "OtherComprehensiveIncomeReclassificationOfDefinedBenefitPlansNetGainLossRecognizedInNetPeriodicBenefitCostBeforeTax": {
        "description": "Before tax amount of the income statement impact of the reclassification adjustment for actuarial gain (loss) recognized as a component of net periodic benefit cost."
    },
    "OtherComprehensiveIncomeReclassificationOfDefinedBenefitPlansNetGainLossRecognizedInNetPeriodicBenefitCostNetOfTax": {
        "description": "Net of tax amount of the income statement impact of the reclassification adjustment for actuarial (gains) losses recognized as a component of net periodic benefit cost."
    },
    "OtherComprehensiveIncomeReclassificationOfDefinedBenefitPlansNetGainLossRecognizedInNetPeriodicBenefitCostTax": {
        "description": "For each annual statement of income presented, the tax effect of the net gain (loss) recognized in other comprehensive income that is a reclassification adjustment of other comprehensive income as a result of being recognized as a component of net periodic benefit cost for the period."
    },
    "OtherComprehensiveIncomeReclassificationOfDefinedBenefitPlantNetTransitionAssetObligationRecognizedInNetPeriodicBenefitCostTax": {
        "description": "For each annual statement of income presented, the tax effect of the net transition asset or obligation recognized as a reclassification adjustment of other comprehensive income as a result of being recognized as a component of net periodic benefit cost for the period."
    },
    "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodBeforeTax": {
        "description": "Amount before tax of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss)."
    },
    "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodNetOfTax": {
        "description": "Amount after tax of increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss)."
    },
    "OtherComprehensiveIncomeUnrealizedGainLossOnDerivativesArisingDuringPeriodTax": {
        "description": "Amount of tax expense (benefit), before reclassification adjustments, related to increase (decrease) in accumulated gain (loss) from derivative instruments designated and qualifying as the effective portion of cash flow hedges and an entity's share of an equity investee's increase (decrease) in deferred hedging gain (loss)."
    },
    "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodBeforeTax": {
        "description": "Amount, before tax and adjustment, of unrealized holding gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale). Excludes unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale."
    },
    "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodNetOfTax": {
        "description": "Amount, after tax and before adjustment, of unrealized holding gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale). Excludes unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale."
    },
    "OtherComprehensiveIncomeUnrealizedHoldingGainLossOnSecuritiesArisingDuringPeriodTax": {
        "description": "Amount, before adjustment, of tax expense (benefit) for unrealized holding gain (loss) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale). Excludes tax expense (benefit) for unrealized gain (loss) on investment in debt security measured at amortized cost (held-to-maturity) from transfer to available-for-sale."
    },
    "OtherLiabilitiesCurrent": {
        "description": "Amount of liabilities classified as other, due within one year or the normal operating cycle, if longer."
    },
    "OtherLiabilitiesNoncurrent": {
        "description": "Amount of liabilities classified as other, due after one year or the normal operating cycle, if longer."
    },
    "OtherPostretirementBenefitExpense": {
        "description": "Amount of cost (reversal of cost) for other postretirement benefits. Excludes pension benefits."
    },
    "OtherReceivablesNetCurrent": {
        "description": "Amount, after allowance, of receivables classified as other, due within one year or the operating cycle, if longer."
    },
    "OtherSundryLiabilitiesNoncurrent": {
        "description": "Obligations not otherwise itemized or categorized in the footnotes to the financial statements that are expected to be paid after one year (or the normal operating cycle, if longer), from the balance sheet date."
    },
    "OtherThanTemporaryImpairmentLossDebtSecuritiesAvailableForSaleRecognizedInEarnings": {
        "description": "Amount of other-than-temporary impairment (OTTI) on investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale), recognized in earnings."
    },
    "PaymentsForProceedsFromProductiveAssets": {
        "description": "The net cash outflow or inflow from purchases, sales and disposals of property, plant and equipment and other productive assets, including intangibles."
    },
    "PaymentsForRepurchaseOfCommonStock": {
        "description": "The cash outflow to reacquire common stock during the period."
    },
    "PaymentsForRestructuring": {
        "description": "Amount of cash payments made as the result of exit or disposal activities. Excludes payments associated with a discontinued operation or an asset retirement obligation."
    },
    "PaymentsOfDividendsCommonStock": {
        "description": "Amount of cash outflow in the form of ordinary dividends to common shareholders of the parent entity."
    },
    "PaymentsRelatedToTaxWithholdingForShareBasedCompensation": {
        "description": "Amount of cash outflow to satisfy grantee's tax withholding obligation for award under share-based payment arrangement."
    },
    "PaymentsToAcquireBusinessesNetOfCashAcquired": {
        "description": "The cash outflow associated with the acquisition of a business, net of the cash acquired from the purchase."
    },
    "PaymentsToAcquireInvestments": {
        "description": "The cash outflow associated with the purchase of all investments (debt, security, other) during the period."
    },
    "PaymentsToAcquirePropertyPlantAndEquipment": {
        "description": "The cash outflow associated with the acquisition of long-lived, physical assets that are used in the normal conduct of business to produce goods and services and not intended for resale; includes cash outflows to pay for construction of self-constructed assets."
    },
    "PaymentsToAcquireSoftware": {
        "description": "The cash outflow associated with the acquisition from vendors of software programs or applications for internal use (that is, not to be sold, leased or otherwise marketed to others) that qualify for capitalization."
    },
    "PensionAndOtherPostretirementBenefitExpense": {
        "description": "Amount of cost (reversal of cost) for pension and other postretirement benefits."
    },
    "PensionAndOtherPostretirementDefinedBenefitPlansLiabilitiesNoncurrent": {
        "description": "Amount of liability, recognized in statement of financial position, for defined benefit pension and other postretirement plans, classified as noncurrent."
    },
    "PensionExpense": {
        "description": "Amount of cost (reversal of cost) for pension benefits. Excludes other postretirement benefits."
    },
    "PledgedAssetsSeparatelyReportedOtherAssetsPledgedAsCollateralAtFairValue": {
        "description": "The fair value, as of the date of each statement of financial position presented, of other assets which are owned but transferred to serve as collateral for the payment of the related debt obligation, and that are reclassified and separately reported in the statement of financial position because the transferee has the right by contract or custom to sell or repledge them."
    },
    "PreferredStockParOrStatedValuePerShare": {
        "description": "Face amount or stated value per share of preferred stock nonredeemable or redeemable solely at the option of the issuer."
    },
    "PreferredStockSharesAuthorized": {
        "description": "The maximum number of nonredeemable preferred shares (or preferred stock redeemable solely at the option of the issuer) permitted to be issued by an entity's charter and bylaws."
    },
    "PreferredStockSharesOutstanding": {
        "description": "Aggregate share number for all nonredeemable preferred stock (or preferred stock redeemable solely at the option of the issuer) held by stockholders. Does not include preferred shares that have been repurchased."
    },
    "PrepaidExpenseAndOtherAssetsCurrent": {
        "description": "Amount of asset related to consideration paid in advance for costs that provide economic benefits in future periods, and amount of other assets that are expected to be realized or consumed within one year or the normal operating cycle, if longer."
    },
    "PrepaidExpenseOtherNoncurrent": {
        "description": "Carrying amount as of the balance sheet date of amounts paid in advance which will be charged against earnings in periods after one year or beyond the operating cycle, if longer."
    },
    "PrepaidPensionCosts": {
        "description": "Cumulative employer's contributions in excess of net pension cost recognized, before the adoption of the recognition provisions of FAS 158. Under FAS 158, prepaid pension costs are no longer recognized in the statement of financial position. Note that there is a separate concept for noncurrent assets relating to defined benefit pension and other defined benefit postretirement plans for use under the recognition provisions of FAS 158."
    },
    "PrepaidTaxes": {
        "description": "Amount of asset related to consideration paid in advance for income and other taxes that provide economic benefits within a future period of one year or the normal operating cycle, if longer."
    },
    "ProceedsFromDivestitureOfBusinessesNetOfCashDivested": {
        "description": "This element represents the cash inflow during the period from the sale of a component of the entity."
    },
    "ProceedsFromIssuanceOfCommercialPaper": {
        "description": "The cash inflow from borrowing by issuing commercial paper."
    },
    "ProceedsFromIssuanceOfLongTermDebtAndCapitalSecuritiesNet": {
        "description": "The cash inflow associated with security instrument that either represents a creditor or an ownership relationship with the holder of the investment security with a maturity of beyond one year or normal operating cycle, if longer. Includes proceeds from (a) debt, (b) capital lease obligations, (c) mandatory redeemable capital securities, and (d) any combination of (a), (b), or (c)."
    },
    "ProceedsFromIssuanceOrSaleOfEquity": {
        "description": "The cash inflow from the issuance of common stock, preferred stock, treasury stock, stock options, and other types of equity."
    },
    "ProceedsFromPaymentsForOtherFinancingActivities": {
        "description": "Amount of cash inflow (outflow) from financing activities classified as other."
    },
    "ProceedsFromRepaymentsOfShortTermDebt": {
        "description": "The net cash inflow or outflow for borrowing having initial term of repayment within one year or the normal operating cycle, if longer."
    },
    "ProceedsFromRepaymentsOfShortTermDebtMaturingInThreeMonthsOrLess": {
        "description": "The cash inflow from a borrowing net of the cash outflow from repayment of a borrowing having initial term of repayment within three months."
    },
    "ProceedsFromSaleMaturityAndCollectionsOfInvestments": {
        "description": "The cash inflow associated with the sale, maturity and collection of all investments such as debt, security and so forth during the period."
    },
    "ProceedsFromSaleOfAvailableForSaleSecuritiesDebt": {
        "description": "Amount of cash inflow from sale of investment in debt security measured at fair value with change in fair value recognized in other comprehensive income (available-for-sale)."
    },
    "ProceedsFromSaleOfPropertyPlantAndEquipment": {
        "description": "The cash inflow from the sale of long-lived, physical assets that are used in the normal conduct of business to produce goods and services and not intended for resale."
    },
    "ProductWarrantyAccrualNoncurrent": {
        "description": "Carrying value as of the balance sheet date of obligations incurred through that date and due after one year (or beyond the operating cycle if longer) for estimated claims under standard and extended warranty protection rights granted to customers."
    },
    "ProfitLoss": {
        "description": "The consolidated profit or loss for the period, net of income taxes, including the portion attributable to the noncontrolling interest."
    },
    "PropertyPlantAndEquipmentGross": {
        "description": "Amount before accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."
    },
    "PropertyPlantAndEquipmentNet": {
        "description": "Amount after accumulated depreciation, depletion and amortization of physical assets used in the normal conduct of business to produce goods and services and not intended for resale. Examples include, but are not limited to, land, buildings, machinery and equipment, office equipment, and furniture and fixtures."
    },
    "ProvisionForLoanLeaseAndOtherLosses": {
        "description": "Amount of expense related loan transactions, lease transactions, credit loss from transactions other than loan and lease transactions, and other loss based on assessment of uncollectability from the counterparty to reduce the account to their net realizable value."
    },
    "ReceivablesHeldForSaleAmount": {
        "description": "Amount, before valuation allowance, of accounts and financing receivables held for sale."
    },
    "ReclassificationFromAccumulatedOtherComprehensiveIncomeCurrentPeriodNetOfTax": {
        "description": "Amount after tax of reclassification adjustments of other comprehensive income (loss)."
    },
    "RepaymentsOfDebt": {
        "description": "The cash outflow during the period from the repayment of aggregate short-term and long-term debt. Excludes payment of capital lease obligations."
    },
    "RepaymentsOfLongTermDebtAndCapitalSecurities": {
        "description": "Amount of cash outflow for debt, mandatory redeemable security, and principal payment for finance lease obligation."
    },
    "ResearchAndDevelopmentExpense": {
        "description": "The aggregate costs incurred (1) in a planned search or critical investigation aimed at discovery of new knowledge with the hope that such knowledge will be useful in developing a new product or service, a new process or technique, or in bringing about a significant improvement to an existing product or process; or (2) to translate research findings or other knowledge into a plan or design for a new product or process or for a significant improvement to an existing product or process whether intended for sale or the entity's use, during the reporting period charged to research and development projects, including the costs of developing computer software up to the point in time of achieving technological feasibility, and costs allocated in accounting for a business combination to in-process projects deemed to have no alternative future use."
    },
    "ResearchAndDevelopmentExpenseSoftwareExcludingAcquiredInProcessCost": {
        "description": "Research and development expense during the period related to the costs of developing and achieving technological feasibility of a computer software product to be sold, leased, or otherwise marketed."
    },
    "ResearchAndDevelopmentInProcess": {
        "description": "The amount of purchased research and development assets that are acquired in a business combination have no alternative future use and are therefore written off in the period of acquisition."
    },
    "RestrictedCash": {
        "description": "Amount of cash restricted as to withdrawal or usage. Cash includes, but is not limited to, currency on hand, demand deposits with banks or financial institutions, and other accounts with general characteristics of demand deposits."
    },
    "RestructuringCharges": {
        "description": "Amount of expenses associated with exit or disposal activities pursuant to an authorized plan. Excludes expenses related to a discontinued operation or an asset retirement obligation."
    },
    "RestructuringReserveCurrent": {
        "description": "Carrying amount as of the balance sheet date of known and estimated obligations associated with exit from or disposal of business activities or restructurings pursuant to a duly authorized plan, which are expected to be paid in the next twelve months or in the normal operating cycle if longer. Costs of such activities include those for one-time termination benefits, termination of an operating lease or other contract, consolidating or closing facilities, relocating employees, and costs associated with an ongoing benefit arrangement, but excludes costs associated with the retirement of a long-lived asset."
    },
    "RestructuringReserveNoncurrent": {
        "description": "Carrying amount as of the balance sheet date of known and estimated costs associated with exit from or disposal of business activities or restructurings pursuant to a duly authorized plan, which are expected to be paid after one year or beyond the next operating cycle, if longer. Costs of such activities include those for one-time termination benefits, termination of an operating lease or other contract, consolidating or closing facilities, and relocating employees, and costs associated with an ongoing benefit arrangement, but excludes costs associated with the retirement of a long-lived asset."
    },
    "RestructuringReserveSettledWithCash": {
        "description": "Amount of cash paid in the period to fully or partially settle a specified, previously accrued type of restructuring cost."
    },
    "RetainedEarningsAccumulatedDeficit": {
        "description": "The cumulative amount of the reporting entity's undistributed earnings or deficit."
    },
    "RevenueRemainingPerformanceObligation": {
        "description": "Amount of transaction price allocated to performance obligation that has not been recognized as revenue."
    },
    "Revenues": {
        "description": "Amount of revenue recognized from goods sold, services rendered, insurance premiums, or other activities that constitute an earning process. Includes, but is not limited to, investment and interest income before deduction of interest expense when recognized as a component of revenue, and sales and trading gain (loss)."
    },
    "RightOfUseAssetObtainedInExchangeForFinanceLeaseLiability": {
        "description": "Amount of increase in right-of-use asset obtained in exchange for finance lease liability."
    },
    "RightOfUseAssetObtainedInExchangeForOperatingLeaseLiability": {
        "description": "Amount of increase in right-of-use asset obtained in exchange for operating lease liability."
    },
    "SaleAndLeasebackTransactionGainLossNet": {
        "description": "Amount of gain (loss) on sale and leaseback transaction from transfer of asset accounted for as sale."
    },
    "SalesRevenueGoodsNet": {
        "description": "Aggregate revenue during the period from the sale of goods in the normal course of business, after deducting returns, allowances and discounts."
    },
    "SalesRevenueServicesNet": {
        "description": "Aggregate revenue during the period from services rendered in the normal course of business, after deducting allowances and discounts."
    },
    "SalesTypeAndDirectFinancingLeasesInterestIncome": {
        "description": "Amount of interest income from net investment in sales-type and direct financing leases."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivable": {
        "description": "Present value of lease payments not yet received by lessor and amount expected to be derived from underlying asset, following end of lease term guaranteed by lessee or other third party unrelated to lessor, from sales-type and direct financing leases."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceived": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceivedFiveYears": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases in fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceivedFourYears": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases in fourth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceivedNextTwelveMonths": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases in next fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceivedRemainderOfFiscalYear": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases in remainder of current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceivedThereafter": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases after fifth fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceivedThreeYears": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases in third fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivablePaymentsToBeReceivedTwoYears": {
        "description": "Amount of undiscounted cash flows to be received by lessor for sales-type and direct financing leases in second fiscal year following current fiscal year. Excludes interim and annual periods when interim periods are reported from current statement of financial position date (rolling approach)."
    },
    "SalesTypeAndDirectFinancingLeasesLeaseReceivableUndiscountedExcessAmount": {
        "description": "Amount of undiscounted lease receivable in excess of discounted receivable for sales-type and direct financing leases."
    },
    "SalesTypeLeaseRevenue": {
        "description": "Amount of sales-type lease revenue."
    },
    "SalesTypeLeaseSellingProfitLoss": {
        "description": "Amount of profit (loss) recognized at commencement from sales-type lease."
    },
    "SegmentReportingInformationIncomeLossBeforeIncomeTaxes": {
        "description": "Amount of income or loss for the reportable segment before income taxes and extraordinary items."
    },
    "SegmentReportingInformationIntersegmentRevenue": {
        "description": "Amount of revenue from transactions with other operating segments of the same entity. Such disclosure is presented if the amount is: (a) included in the measure of segment profit or loss reviewed by the chief operating decision maker or (b) otherwise regularly provided to the chief operating decision maker, even if not included in that measure of segment profit or loss."
    },
    "SegmentReportingInformationRevenue": {
        "description": "Amount of total revenue for the reportable segments, including revenue from external customers, transactions with other operating segments of the same entity, and (gross) interest revenue. All considered to be \"operating revenue\" for purposes of the taxonomy."
    },
    "SegmentReportingInformationRevenueFromExternalCustomers": {
        "description": "Amount of revenue from external customers for the reportable segment. Such disclosure is presented if the amount is: (a) included in the measure of segment profit or loss reviewed by the chief operating decision maker or (b) otherwise regularly provided to the chief operating decision maker, even if not included in that measure of segment profit or loss."
    },
    "SegmentReportingReconcilingItemsForOperatingProfitLoss": {
        "description": "Total of reconciling items from segment operating profit or loss to consolidated income before income taxes, extraordinary items, and discontinued operations."
    },
    "SegmentReportingReconcilingItemsRevenue": {
        "description": "Total of reconciling items between total reportable segments' revenues and consolidated entity revenues."
    },
    "SellingGeneralAndAdministrativeExpense": {
        "description": "The aggregate total costs related to selling a firm's product and services, as well as all other general and administrative expenses. Direct selling expenses (for example, credit, warranty, and advertising) are expenses that can be directly linked to the sale of specific products. Indirect selling expenses are expenses that cannot be directly linked to the sale of specific products, for example telephone expenses, Internet, and postal charges. General and administrative expenses include salaries of non-sales personnel, rent, utilities, communication, etc."
    },
    "ShareBasedCompensation": {
        "description": "Amount of noncash expense for share-based payment arrangement."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardNumberOfSharesAuthorized": {
        "description": "Number of shares authorized for issuance under share-based payment arrangement."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardNumberOfSharesAvailableForGrant": {
        "description": "The difference between the maximum number of shares (or other type of equity) authorized for issuance under the plan (including the effects of amendments and adjustments), and the sum of: 1) the number of shares (or other type of equity) already issued upon exercise of options or other equity-based awards under the plan; and 2) shares (or other type of equity) reserved for issuance on granting of outstanding awards, net of cancellations and forfeitures, if applicable."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableNumber": {
        "description": "The number of shares into which fully or partially vested stock options outstanding as of the balance sheet date can be currently converted under the option plan."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisableWeightedAverageExercisePrice": {
        "description": "The weighted-average price as of the balance sheet date at which grantees can acquire the shares reserved for issuance on vested portions of options outstanding and currently exercisable under the stock option plan."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriod": {
        "description": "The decrease in the number of reserved shares that could potentially be issued attributable to the exercise or conversion during the reporting period of previously issued stock options under the option plan."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriodTotalIntrinsicValue": {
        "description": "Amount of accumulated difference between fair value of underlying shares on dates of exercise and exercise price on options exercised (or share units converted) into shares."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsExercisesInPeriodWeightedAverageExercisePrice": {
        "description": "The weighted average price at which option holders acquired shares when converting their stock options into shares under the plan during the reporting period."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsForfeituresAndExpirationsInPeriod": {
        "description": "For presentations that combine terminations, the number of shares under options that were cancelled during the reporting period as a result of occurrence of a terminating event specified in contractual agreements pertaining to the stock option plan or that expired."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsForfeituresAndExpirationsInPeriodWeightedAverageExercisePrice": {
        "description": "Weighted average price of options that were either forfeited or expired."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingIntrinsicValue": {
        "description": "Amount by which the current fair value of the underlying stock exceeds the exercise price of options outstanding."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingNumber": {
        "description": "Number of options outstanding, including both vested and non-vested options."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsOutstandingWeightedAverageExercisePrice": {
        "description": "Weighted average price at which grantees can acquire the shares reserved for issuance under the stock option plan."
    },
    "ShareBasedCompensationArrangementByShareBasedPaymentAwardOptionsVestedAndExpectedToVestOutstandingAggregateIntrinsicValue": {
        "description": "Amount by which current fair value of underlying stock exceeds exercise price of fully vested and expected to vest options outstanding. Includes, but is not limited to, unvested options for which requisite service period has not been rendered but that are expected to vest based on achievement of performance condition, if forfeitures are recognized when they occur."
    },
    "ShareBasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeExercisableOptionsWeightedAverageExercisePrice": {
        "description": "Weighted average exercise price as of the balance sheet date for those equity-based payment arrangements exercisable and outstanding."
    },
    "ShareBasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeExercisableOptionsWeightedAverageRemainingContractualTerm": {
        "description": "The weighted average remaining life of the outstanding, exercisable stock options as of the balance sheet date for all option plans in the customized range of exercise prices."
    },
    "ShareBasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeNumberOfExercisableOptions": {
        "description": "The number of shares reserved for issuance pertaining to the outstanding exercisable stock options as of the balance sheet date in the customized range of exercise prices for which the market and performance vesting condition has been satisfied."
    },
    "ShareBasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeNumberOfOutstandingOptions": {
        "description": "The number of shares reserved for issuance pertaining to the outstanding stock options as of the balance sheet date for all option plans in the customized range of exercise prices."
    },
    "ShareBasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeOutstandingOptionsWeightedAverageExercisePriceBeginningBalance": {
        "description": "The weighted average price as of the balance sheet date at which grantees could acquire the underlying shares with respect to all outstanding stock options which are in the customized range of exercise prices."
    },
    "ShareBasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeOutstandingOptionsWeightedAverageRemainingContractualTerm": {
        "description": "The weighted-average period remaining as of the balance sheet date until option expiration pertaining to the outstanding stock options for all option plans in the customized range of exercise prices, which may be expressed in a variety of ways (for example, years, months)."
    },
    "SharebasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeExercisableOptionsWeightedAverageExercisePrice1": {
        "description": "Weighted average exercise price as of the balance sheet date for those equity-based payment arrangements exercisable and outstanding."
    },
    "SharebasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeExercisableOptionsWeightedAverageRemainingContractualTerm1": {
        "description": "The weighted average remaining life of the exercisable stock options as of the balance sheet date for all option plans in the customized range of exercise prices."
    },
    "SharebasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeOutstandingOptionsWeightedAverageExercisePriceBeginningBalance1": {
        "description": "The weighted average price as of the balance sheet date at which grantees could acquire the underlying shares with respect to all outstanding stock options which are in the customized range of exercise prices."
    },
    "SharebasedCompensationSharesAuthorizedUnderStockOptionPlansExercisePriceRangeOutstandingOptionsWeightedAverageRemainingContractualTerm1": {
        "description": "The weighted-average period remaining as of the balance sheet date until option expiration pertaining to the outstanding stock options for all option plans in the customized range of exercise prices, which may be expressed in a variety of ways (for example, years, months)."
    },
    "SharesPaidForTaxWithholdingForShareBasedCompensation": {
        "description": "Number of shares used to settle grantee's tax withholding obligation for award under share-based payment arrangement."
    },
    "ShortTermBankLoansAndNotesPayable": {
        "description": "Amount of borrowings from a bank classified as other, maturing within one year or operating cycle, if longer."
    },
    "ShortTermBorrowings": {
        "description": "Reflects the total carrying amount as of the balance sheet date of debt having initial terms less than one year or the normal operating cycle, if longer."
    },
    "ShortTermLeaseCost": {
        "description": "Amount of short-term lease cost, excluding expense for lease with term of one month or less."
    },
    "SignificantChangeInUnrecognizedTaxBenefitsIsReasonablyPossibleAmountOfUnrecordedBenefit": {
        "description": "The amount of the unrecognized tax benefit of a position taken for which it is reasonably possible that the total amount thereof will significantly increase or decrease within twelve months of the balance sheet date."
    },
    "StandardProductWarrantyAccrual": {
        "description": "Amount as of the balance sheet date of the aggregate standard product warranty liability. Does not include the balance for the extended product warranty liability."
    },
    "StandardProductWarrantyAccrualPayments": {
        "description": "Amount of decrease in the standard product warranty accrual from payments made in cash or in kind to satisfy claims under the terms of the standard product warranty. Excludes extended product warranties."
    },
    "StandardProductWarrantyAccrualPreexistingIncreaseDecrease": {
        "description": "Amount of increase (decrease) in the standard product warranty accrual from changes in estimates attributable to preexisting product warranties. Excludes extended product warranties."
    },
    "StandardProductWarrantyAccrualWarrantiesIssued": {
        "description": "Amount of increase in the standard product warranty accrual from warranties issued. Excludes extended product warranties."
    },
    "StateAndLocalIncomeTaxExpenseBenefitContinuingOperations": {
        "description": "Amount of state and local current and deferred income tax expense (benefit) attributable to continuing operations."
    },
    "StockholdersEquity": {
        "description": "Total of all stockholders' equity (deficit) items, net of receivables from officers, directors, owners, and affiliates of the entity which are attributable to the parent. The amount of the economic entity's stockholders' equity attributable to the parent excludes the amount of stockholders' equity which is allocable to that ownership interest in subsidiary equity which is not attributable to the parent (noncontrolling interest, minority interest). This excludes temporary equity and is sometimes called permanent equity."
    },
    "StockholdersEquityIncludingPortionAttributableToNoncontrollingInterest": {
        "description": "Amount of stockholders' equity (deficit), net of receivables from officers, directors, owners, and affiliates of the entity, attributable to both the parent and noncontrolling interests. Amount excludes temporary equity. Alternate caption for the concept is permanent equity."
    },
    "StockholdersEquityOther": {
        "description": "This element represents movements included in the statement of changes in stockholders' equity which are not separately disclosed or provided for elsewhere in the taxonomy."
    },
    "StockIssuedDuringPeriodSharesShareBasedCompensation": {
        "description": "Number, after forfeiture, of shares or units issued under share-based payment arrangement. Excludes shares or units issued under employee stock ownership plan (ESOP)."
    },
    "StockIssuedDuringPeriodValueShareBasedCompensation": {
        "description": "Value, after forfeiture, of shares issued under share-based payment arrangement. Excludes employee stock ownership plan (ESOP)."
    },
    "StockRepurchaseProgramRemainingAuthorizedRepurchaseAmount1": {
        "description": "Amount remaining of a stock repurchase plan authorized."
    },
    "SubleaseIncome": {
        "description": "Amount of sublease income excluding finance and operating lease expense."
    },
    "SupplementalUnemploymentBenefitsDisabilityRelatedBenefits": {
        "description": "Liability for amount due a former employee for benefits as a result of them becoming physically or mentally impaired."
    },
    "TangibleAssetImpairmentCharges": {
        "description": "The charge against earnings resulting from the aggregate write down of tangible assets from their carrying value to their fair value."
    },
    "TaxAdjustmentsSettlementsAndUnusualProvisions": {
        "description": "Amount of increase (decrease) to previously recorded tax expense. Includes, but is not limited to, significant settlements of income tax disputes, and unusual tax positions or infrequent actions taken by the entity, including tax assessment reversal, and IRS tax settlement."
    },
    "TaxCutsAndJobsActOf2017MeasurementPeriodAdjustmentIncomeTaxExpenseBenefit": {
        "description": "Amount of income tax expense (benefit) for measurement period adjustment from accounting for tax effect pursuant to Tax Cuts and Jobs Act."
    },
    "TaxCutsAndJobsActOf2017ReclassificationFromAociToRetainedEarningsTaxEffect": {
        "description": "Amount of increase (decrease) in accumulated other comprehensive income (AOCI) for reclassification to retained earnings of tax effect from remeasurement of deferred tax pursuant to Tax Cuts and Jobs Act."
    },
    "TaxesPayableCurrent": {
        "description": "Carrying value as of the balance sheet date of obligations incurred and payable for statutory income, sales, use, payroll, excise, real, property and other taxes. Used to reflect the current portion of the liabilities (due within one year or within the normal operating cycle if longer)."
    },
    "TranslationAdjustmentForNetInvestmentHedgeIncreaseDecreaseNetOfTax": {
        "description": "Amount, after tax, of reclassification from accumulated other comprehensive income (AOCI) of gain (loss) from increase (decrease) in fair value of net investment hedge."
    },
    "TreasuryStockCommonShares": {
        "description": "Number of previously issued common shares repurchased by the issuing entity and held in treasury."
    },
    "TreasuryStockCommonValue": {
        "description": "Amount allocated to previously issued common shares repurchased by the issuing entity and held in treasury."
    },
    "TreasuryStockShares": {
        "description": "Number of common and preferred shares that were previously issued and that were repurchased by the issuing entity and held in treasury on the financial statement date. This stock has no voting rights and receives no dividends."
    },
    "TreasuryStockSharesAcquired": {
        "description": "Number of shares that have been repurchased during the period and are being held in treasury."
    },
    "TreasuryStockValue": {
        "description": "The amount allocated to treasury stock. Treasury stock is common and preferred shares of an entity that were issued, repurchased by the entity, and are held in its treasury."
    },
    "TreasuryStockValueAcquiredCostMethod": {
        "description": "Equity impact of the cost of common and preferred stock that were repurchased during the period. Recorded using the cost method."
    },
    "UnamortizedDebtIssuanceExpense": {
        "description": "The remaining balance of debt issuance expenses that were capitalized and are being amortized against income over the lives of the respective bond issues. This does not include the amounts capitalized as part of the cost of the utility plant or asset."
    },
    "UnbilledContractsReceivable": {
        "description": "Unbilled amounts due for services rendered or to be rendered, actions taken or to be taken, or a promise to refrain from taking certain actions in accordance with the terms of a legally binding agreement between the entity and, at a minimum, one other party. An example would be amounts associated with contracts or programs where the recognized revenue for performance thereunder exceeds the amounts billed under the terms thereof as of the date of the balance sheet."
    },
    "UndistributedEarningsOfForeignSubsidiaries": {
        "description": "Amount of undistributed earnings of foreign subsidiaries intended to be permanently reinvested outside the country of domicile."
    },
    "UnrealizedGainLossOnForeignCurrencyDerivativesNetBeforeTax": {
        "description": "Amount of net unrealized gain (loss) related to the change in fair value of foreign currency exchange rate derivatives designated as cash flow hedging instruments. Recorded in accumulated other comprehensive income to the extent that the cash flow hedge is determined to be effective."
    },
    "UnrecognizedTaxBenefits": {
        "description": "Amount of unrecognized tax benefits."
    },
    "UnrecognizedTaxBenefitsDecreasesResultingFromPriorPeriodTaxPositions": {
        "description": "Amount of decrease in unrecognized tax benefits resulting from tax positions taken in prior period tax returns."
    },
    "UnrecognizedTaxBenefitsDecreasesResultingFromSettlementsWithTaxingAuthorities": {
        "description": "Amount of decrease in unrecognized tax benefits resulting from settlements with taxing authorities."
    },
    "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestAccrued": {
        "description": "Amount accrued for interest on an underpayment of income taxes and penalties related to a tax position claimed or expected to be claimed in the tax return."
    },
    "UnrecognizedTaxBenefitsIncomeTaxPenaltiesAndInterestExpense": {
        "description": "Amount of expense for interest on an underpayment of income taxes and penalties related to a tax position claimed or expected to be claimed in the tax return."
    },
    "UnrecognizedTaxBenefitsIncreasesResultingFromCurrentPeriodTaxPositions": {
        "description": "Amount of increase in unrecognized tax benefits resulting from tax positions that have been or will be taken in current period tax return."
    },
    "UnrecognizedTaxBenefitsIncreasesResultingFromPriorPeriodTaxPositions": {
        "description": "Amount of increase in unrecognized tax benefits resulting from tax positions taken in prior period tax returns."
    },
    "UnrecognizedTaxBenefitsPeriodIncreaseDecrease": {
        "description": "Amount of increase (decrease) in unrecognized tax benefits attributable to uncertain tax positions taken in tax returns."
    },
    "UnrecognizedTaxBenefitsThatWouldImpactEffectiveTaxRate": {
        "description": "The total amount of unrecognized tax benefits that, if recognized, would affect the effective tax rate."
    },
    "ValuationAllowanceDeferredTaxAssetChangeInAmount": {
        "description": "Amount of increase (decrease) in the valuation allowance for a specified deferred tax asset."
    },
    "VariableLeaseCost": {
        "description": "Amount of variable lease cost, excluded from lease liability, recognized when obligation for payment is incurred for finance and operating leases."
    },
    "VariableLeaseIncome": {
        "description": "Amount of variable lease payments from operating, direct financing, and sales-type leases, excluding amount included in measurement of lease receivable."
    },
    "WeightedAverageNumberOfDilutedSharesOutstanding": {
        "description": "The average number of shares or units issued and outstanding that are used in calculating diluted EPS or earnings per unit (EPU), determined based on the timing of issuance of shares or units in the period."
    },
    "WeightedAverageNumberOfSharesOutstandingBasic": {
        "description": "Number of [basic] shares or units, after adjustment for contingently issuable shares or units and other shares or units not deemed outstanding, determined by relating the portion of time within a reporting period that common shares or units have been outstanding to the total time in that period."
    },
    "AssetsOfDisposalGroupIncludingDiscontinuedOperationCurrent": {
        "description": "Amount classified as assets attributable to disposal group held for sale or disposed of, expected to be disposed of within one year or the normal operating cycle, if longer."
    },
    "DisposalGroupIncludingDiscontinuedOperationAssetsNoncurrent": {
        "description": "Amount classified as assets attributable to disposal group held for sale or disposed of, expected to be disposed of after one year or the normal operating cycle, if longer."
    },
    "DisposalGroupIncludingDiscontinuedOperationCashAndCashEquivalents": {
        "description": "Amount classified as cash and cash equivalents attributable to disposal group held for sale or disposed of."
    },
    "EquitySecuritiesFvNiUnrealizedGainLoss": {
        "description": "Amount of unrealized gain (loss) on investment in equity security measured at fair value with change in fair value recognized in net income (FV-NI)."
    },
    "FinanceLeaseLiabilityCurrent": {
        "description": "Present value of lessee's discounted obligation for lease payments from finance lease, classified as current."
    },
    "FinanceLeaseLiabilityNoncurrent": {
        "description": "Present value of lessee's discounted obligation for lease payments from finance lease, classified as noncurrent."
    },
    "LiabilitiesOfDisposalGroupIncludingDiscontinuedOperationCurrent": {
        "description": "Amount classified as liabilities attributable to disposal group held for sale or disposed of, expected to be disposed of within one year or the normal operating cycle, if longer."
    },
    "PropertyPlantAndEquipmentExcludingLessorAssetUnderOperatingLeaseAccumulatedDepreciation": {
        "description": null
    },
    "PropertyPlantAndEquipmentExcludingLessorAssetUnderOperatingLeaseAfterAccumulatedDepreciation": {
        "description": null
    },
    "PropertyPlantAndEquipmentExcludingLessorAssetUnderOperatingLeaseBeforeAccumulatedDepreciation": {
        "description": null
    },
    "StockholdersEquityNoteSpinoffTransaction": {
        "description": "The change in equity as a result of a spin-off transaction (a regular or reverse spin-off) which is based on the recorded amounts."
    },
    "TradeAndLoansReceivablesHeldForSaleNetNotPartOfDisposalGroup": {
        "description": "Amount, after valuation allowance, of accounts and financing receivables held for sale and not part of disposal group. Excludes loan covered under loss sharing agreement and loan classified as investment in debt security."
    }
}